{
  "Artist": "The Beatles",
  "Album": "Sgt. Pepper's Lonely Hearts Club Band",
  "Title": "A Day In The Life",
  "URL": "https://www.songfacts.com/facts/the-beatles/a-day-in-the-life",
  "Confidence": 1.0,
  "youtube-id": "usNsCeOV4GM",
  "facts": [
    "A 41-piece orchestra played on this song. The musicians were told to attend the session dressed formally. When they got there, they were presented with party novelties (false noses, party hats, gorilla-paw glove) to wear, which made it clear this was not going to be a typical session. The orchestra was conducted by Paul McCartney, who told them to start with the lowest note of their instruments and gradually play to the highest. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jes - Mason City, IA\n                                                  \n                                                  ",
    "This was recorded in three sessions: first the basic track, then the orchestra, then the last note was dubbed in.",
    "The beginning of this song was based on two stories John Lennon read in the Daily Mail newspaper: Guinness heir Tara Browne dying when he smashed his lotus into a parked van, and an article in the UK Daily Express in early 1967 which told of how the Blackburn Roads Surveyor had counted 4000 holes in the roads of Blackburn and commented that the volume of material needed to fill them in was enough to fill the Albert Hall. Lennon took some liberties with the Tara Browne story - he changed it so he \"Blew his mind out in the car.\"\nRegarding the article about Tara Browne, John Lennon stated: \"I didn't copy the accident. Tara didn't blow his mind out. But it was in my mind when I was writing that verse.\" At the time, Paul didn't realize the reference was to Tara. He thought it was about a \"stoned politician.\" The article regarding the \"4000 holes in Blackburn, Lancashire\" was taken from the UK Daily Express, January 17, 1967 in a column called \"Far And Near.\"\nJohn's friend Terry Doran was the one who completed John's line, \"Now they know how many holes it takes to fill...\" Terry told him \"fill the Albert Hall, John.\"",
    "McCartney contributed the line \"I'd love to turn you on.\" This was a drug reference, but the BBC banned it because of another section, which they assumed was about marijuana:\nFound my way upstairs and had a smoke\nSomebody spoke and I went into a dream\nThe ban was finally lifted when author David Storey picked it as one of his Desert Island Discs.",
    "Speaking with GQ in 2018, Paul McCartney explained this song's origin story: \"'A Day In The Life' was a song that John had started. He had the first verse, and this often happened: one of us would have a little bit of an idea and instead of sitting down and sweating it, we'd just bring it to the other one and kind of finish it together, because you could ping-pong - you'd get an idea. So he had the first verse: 'I read the news today oh boy,' and we sat in my music room in London and just started playing around with it, got a second verse, and then we got to what was going to lead into the middle. We kind of looked at each other and knew we were being a little bit edgy where we 'I'd love to turn you on.' We knew that would have an effect.\nIt worked. And then we put on another section I had: 'Woke up, fell out of bed, dragged a comb across my head.' Then we finished the song up and did a big sort of epic recording of it with a big full orchestra and everything. And then did that crescendo thing in the middle of it with the orchestra, which was an idea I'd had because I'd been talking to people and reading about avant-garde music, tonal stuff and crazy ideas. I came up with this idea. I said to the orchestra, 'You should start, all of you.' And they sat all looking at me puzzled. We've got a real symphony orchestra in London who are used to playing Beethoven, and here's me, this crazy guy out of a group and I'm saying, 'Everyone start on the lowest note your instrument can play and work your way up to the highest at your own pace.' That was too puzzling for them, and orchestras don't like that kind of thing. They like it written down and they like to know exactly what they're supposed to do. So George Martin, the producer, said to the people, 'You should leave this note and this point in the song, and then you should go to this note and this note,' and he left the random thing, so that's why it sounds like a chaotic sort of swirl. That was an idea based on the avant-garde stuff I was into at the time.\"",
    "The final chord was produced by all four Beatles and George Martin banging on three pianos simultaneously. As the sound diminished, the engineer boosted to faders. The resulting note lasts 42 seconds; the studio air conditioners can be heard toward the end as the faders were pushed to the limit to record it.",
    "The rising orchestra-glissando and the thundering sound are reminiscent of \"Entry of the Gods into Valhalla\" from Richard Wagner's opera \"Das Rheingold,\" where after the rising glissando, Thor beats with his hammer. George Martin said in his 1979 book All You Need is Ears that the glissando was Lennon's idea. After Lennon's death, Martin seems to have changed his mind. In his 1995 book Summer of Love: The Making of Sgt. Pepper, he states that the rising orchestra-glissando was McCartney's idea. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, a music historian in Stockholm\n                                                  \n                                                  ",
    "This being the last song on the album, The Beatles found an interesting way to close it out. After the final note, Lennon had producer George Martin dub in a high pitched tone, which most humans can't hear, but drives dogs crazy. This was followed by a loop of incomprehensible studio noise, along with Paul McCartney saying, \"Never could see any other way,\" all spliced together. It was put there so vinyl copies would play this continuously in the run-out groove, sounding like something went horribly wrong with the record. Another good reason to own vinyl.",
    "In 2004, McCartney did an interview with the Daily Mirror newspaper where he said he was doing cocaine around this time along with marijuana. \"I'd been introduced to it, and at first it seemed OK, like anything that's new and stimulating,\" he said. \"When you start working your way through it, you start thinking, 'This is not so cool and idea,' especially when you start getting those terrible comedowns.\"",
    "The movie reference in the lyrics (\"I saw a film today, oh boy. The English Army had just won the war\") is to a film John Lennon acted in called How I Won The War.",
    "McCartney's middle section (woke up, got out of bed...) was intended for another song.",
    "The Beatles started this with the working title \"In The Life of...\"",
    "This is a rare Beatles song with a title that is not part of the lyrics. Another one is \"Yer Blues.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "That's Mal Evans doing the counting during the first transition from John to Paul. He set the alarm clock (heard on the recording) to go off at the end of his 24-bar count. Evans also helped with the composition of a couple of songs on the Sgt. Pepper album. Although he never received composer's credit, the Beatles did pay his estate a lump sum in the 1990s for his contributions. Evans died January 5, 1976 after a misunderstanding with the police. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Brad Wind - Miami, FL\n                                                  \n                                                  ",
    "George Martin (from Q Magazine, July 2007): \"John's voice - which he hated - was the kind of thing that would send shivers down your spine. If you hear those opening chords with the guitar and piano, and then his voice comes in, 'I heard the news today, oh boy' It's just so evocative of that time. He always played his songs to me on the guitar and I would sit on a stool as he strummed. The orchestral section was Paul's idea. We put two pieces of songs together that weren't connected in any way. Then we had that 24-bars-of-nothing in between. I had to write a score, but in the climax, I gave each instrument different little waypoints at each bar, so they would know roughly where they should be when they were sliding up. Just so they didn't reach the climax too quickly. With 'A Day In The Life,' I wondered whether we were losing our audience and I was scared. But I stopped being scared when I played it to the head of Capitol Records in America and he was gob smacked. He said, That's fantastic. And of course, it was.\"",
    "In the original take, the 41-piece orchestra was not used. Instead, Lennon had roadie Mal Evans count to 21 in a very trippy manner and set off an alarm clock after the 21 counts. This version is on the second Anthology CD, and is very different than the one on Sgt. Pepper. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Emery - San Jose, CA\n                                                  \n                                                  ",
    "David Crosby was at Abbey Road studios when The Beatles were recording this. In an interview with Filter magazine, he said: \"I was, as near as I know, the first human being besides them and George Martin and the engineers to hear 'A Day In The Life.' I was high as a kite - so high I was hunting geese with a rake. They sat me down; they had huge speakers like coffins with wheels on that they rolled up on either side of the stool. By the time it got the end of that piano chord, man my brains were on the floor.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Brian - Williamsburg, VA\n                                                  \n                                                  ",
    "The orchestral bit was used in the Yellow Submarine movie. Photos of different geographical areas were shown as The Beatles were apparently traveling in the submarine to try and find Pepperland.",
    "When asked by Rolling Stone magazine what songs of his dad's constantly surprise him, Sean Lennon said: \"I've listened so much to that stuff that there are very few surprises. But I do think 'A Day In The Life' is always inspiring.\"",
    "The American rock band Hawthorne Heights originally named themselves A Day in the Life after this song. In 2003, lead vocalist/rhythm guitarist JT Woodruff changed it to their current name.",
    "On June 18, 2010 John Lennon's handwritten lyric sheet for this song featuring corrections and alternate crossed-out lines was auctioned at New York Sotheby's. It was sold for $1.2 million to an anonymous American buyer.",
    "This was rated the greatest ever Beatles song in a special collector's edition issue by The Beatles: 100 Greatest Songs. The list was compiled to coincide with the 40th anniversary of the Fab Four's final studio album, Let It Be.",
    "There is term for the techniques The Beatles used in arranging the final chords of this song: Deceptive Cadence. Glen Burtnik, who was a member of Styx and was also in a popular Beatles tribute band, told us: \"It's an instance where the listener assumes the next chord, or melody note, will go somewhere it doesn't. Even though all the indications lead you to expecting a certain outcome, the writer/arranger intentionally surprises you by going someplace else musically. Not sure it's simple to understand, as you're conditioned to being used to the outcome.\"",
    "Peter Asher, who worked for The Beatles at Apple Records and produced the biggest hits of James Taylor and Linda Ronstadt, considers this the greatest Beatles song from a production standpoint. \"'A Day In The Life' certainly combined Beatle ideas and George Martin ideas very effectively,\" he told Songfacts.",
    "Keith Richards named his second son Tara after Tara Brown, the Guinness heir who smashes his car in Lennon's first verse. Richard's son was premature and died soon after birth."
  ],
  "lyrics": "\"Dub the mic on the piano quite low this\nJust keeping it like maracas, you know\nYou know those old pianos\"\n\n\"Ok, we're on\"\n\n\"Sugarplum fairy, sugarplum fairy\"\n\nI read the news today, oh boy\nAbout a lucky man who made the grade\nAnd though the news was rather sad\nWell, I just had to laugh\nI saw the photograph\n\nHe blew his mind out in a car\nHe didn't notice that the lights had changed\nA crowd of people stood and stared\nThey'd seen his face before\nNobody was really sure if he was from the House of Lords\n\nI saw a film today, oh boy\nThe English Army had just won the war\nA crowd of people turned away\nBut I just had to look\nHaving read the book\nI'd love to turn you on\n\n\"Five, six, seven, eight, nine\nTen, eleven, twelve, thirteen, fourteen\nFifteen, sixteen, seventeen, eighteen, nineteen\nTwenty\"\n\nWoke up, fell out of bed\nDragged a comb across my head\nFound my way downstairs and drank a cup\nAnd looking up I noticed I was late\nFound my coat and grabbed my hat\nMade the bus in seconds flat\nMade my way upstairs and had a smoke\nAnd everybody spoke and I went into a dream\n\n\"Oh shit\"\n\nI read the news today, oh boy\nFour thousand holes in Blackburn, Lancashire\nAnd though the holes were rather small\nThey had to count them all\nNow they know how many holes it takes to fill the Albert Hall\nI'd love to turn you\n\n\"See the worst thing about doing this\nDoing something like this\nIs I think that at first people sort of are a bit suspicious\n'You know, come on, what are you up to?'\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "place": {
    "name": "Blackburn, Lancashire, England",
    "facts": [
      "Blackburn, Lancashire, is a former mill town in northern England as old as 1086. The origins of the name can be found in both the textile work done there and the smoke rising from the mills themselves. Legend has it that when King James I stayed in Blackburn in 1617, he enjoyed the hospitality so much he drew his sword to knight the beef they were eating for supper. Not much else can be discovered about the boring hamlet, which may be precisely why Lennon chose to immortalize a brief mention of the town in his masterpiece, \"A Day in the Life\" – a song drenched with warnings about mundane existence.",
      "Words cannot describe the importance and brilliance of \"A Day in the Life.\" It is the quintessential Beatles song – and arguably the most important composition in the history of popular music. Some of you may be rolling your eyes; however, if you’ll give me an opportunity to explain, I think I’ll make believers out of you yet.",
      "Much has been said over the past fifty years of the Lennon-McCartney songwriting team. Too much, in fact. Their partnership has been blown way out of proportion. Truthfully, each wrote their own songs and only occasionally enlisted the other’s help for a chord here or a lyric there. The two bards kept to themselves… except on \"A Day in the Life.\" It remains the single most collaborative song in the entire Beatles catalog. In an interview with",
      ", Lennon spoke about working with McCartney:",
      "\"Paul and I were definitely working together on 'A Day In The Life,' that was a real ... The way we wrote a lot of the time: you'd write the good bit, the part that was easy, like 'I read the news today' or whatever it was, then when you got stuck or whenever it got hard, instead of carrying on, you just drop it; then we would meet each other, and I would sing half, and he would be inspired to write the next bit and vice versa.”",
      "Additionally, it’s the closing track on the most important album of all time:",
      "which was not only the first concept album, but also the first album as an art form. The Beatles invented the rock album. Prior to 1967, record labels released collections of singles thrown together in one place. There was no rhyme or reason.",
      "was much different. It tells a story of a fictitious band (since the Fab Four were sick of touring and performing, to quote Lennon, ‘soft music for soft people,’ nearing the end of 1966) and many of the tracks contain vibrant imagery to describe life in the northern English towns in which the band members grew up.",
      "Their biggest influence was The Beach Boys’",
      ", particularly the way Brian Wilson utilized vocal harmonies and unconventional instrumentation. The album culminates to the final track, which was recorded with three grand pianos, massive amounts of overdubs, and special effects (spliced tape that was often flipped around backward). Listeners were taken on a journey from innocence to impurity, from slumber to a great awakening. Before June 1967, contemporary society didn’t get it. After listening to",
      ", if they paid attention to the subtext, they just might.",
      "Lennon’s famous line, \"I’d love to turn you on,\" has been misinterpreted as a drug reference at a time when Timothy Leary – famed LSD developer, user, and promoter – peddled his \"Tune in, Turn on, and Drop out,\" philosophy. However, Lennon’s desire to turn on his audience had less to do with using drugs to get high and more (much, much more) to do with realizing universal truths. He hoped to help Beatle fans enrich their spiritual lives. The Los Angeles",
      "quotes McCartney stating, “What we want is to turn you onto truth rather than to pot.”",
      "The lyrics begin with a narrator reading a local newspaper and commenting about what’s been reported: a car crash, a film review, potholes in the streets (of Blackburn, Lancashire), and other observations of daily life. The song’s somewhat slow and ambling tempo suggests the narrator is unimpressed with what he’s reading; he’s become desensitized with the news and life in general. Suddenly, George Martin’s (genius) orchestra rises up, signaling a shift in tone and we enter McCartney’s ‘dream’ sequence, about an average man going about his average day: Woke up, got out of bed, dragged a comb across my head…",
      "So who’s actually dreaming and who’s awake, Lennon or McCartney? The bookended orchestra hits are meant to confuse the audience. The Beatles want their fans asking hard questions and seeking obscure answers. Which is the dream? Which is reality? Does it even matter? No. Frankly, it doesn’t.",
      "The point of the song is that humanity is fast asleep. Our entire world, our entire lives, are being acted out in slow-motion and, according to the Beatles, it’s time to get up and start being aware. They wanted to slap us in the face and scream, “There’s more to life than this! What you think is important, isn’t. What you don’t spend time thinking about, is.”",
      "The final crescendo leads to the album’s last chord. The entire section symbolizes an alarm clock. By the time the composition finishes, the listeners are meant to be one step closer to enlightenment. When the album began, we knew nothing. With the album over, we’ve been baptized in existential philosophy.",
      "\"A Day in the Life\" is the culmination of a theme and message that started with the Lonely Hearts Club Band warming up. The first sounds heard by the listener are the cacophonous orchestra. They’re not together; they’re not in harmony. However, the last sounds heard are the very dramatic and long-sustained E-chord resolution. The noise of the album’s introduction congeals into the conclusion’s perfect harmony. Lennon and McCartney hope to show us the way to that harmony in our own lives.",
      "~"
    ]
  }
}