{
  "Artist": "The Beatles",
  "Album": "A Hard Day's Night",
  "Title": "A Hard Day's Night",
  "URL": "https://www.songfacts.com/facts/the-beatles/a-hard-days-night",
  "Confidence": 1.0,
  "youtube-id": "Yjyj8qnqkYI",
  "facts": [
    "The title was taken from an expression Ringo used to say. In a 1964 interview with DJ Dave Hull, Ringo explained: \"We went to do a job, and we'd worked all day and we happened to work all night. I came up still thinking it was day I suppose, and I said, 'It's been a hard day...' and I looked around and saw it was dark so I said, 'Night!' So we came to 'A Hard Day's Night.'\"\nJohn Lennon used the phrase \"A hard day's night\" in a his book In His Own Write before it was used as a song or movie title. He used it in the short story (more of a vignette) titled \"Sad Michael.\" An excerpt: \"There was no reason for Michael to be sad that morning, (the little wretch): everyone liked him, (the scab). He'd had a hard day's night that day, for Michael was a Cocky Watchtower.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "John Lennon wrote this song, which contains long, repeating notes that are uncommon in Pop music. Even more unusual, Lennon sang it in glissando: \"haaaard days night...\". The melody resembles the Irish folk song \"Donall Og,\" with the same pentatonic, and small glissandos. Such glissandos you even find in the English ballad \"Three Babes.\"\nAlbert Goldman wrote in his 1980 book The Lives of John Lennon, \"The whole composition is written in mixolydic key, an old key which was abandoned in the beginning of the seventeenth century, but is maintained in English and Irish folk music.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, who is a music historian in Stockholm\n                                                  \n                                                  ",
    "This was the title song to the first of five Beatles movies. It got two Oscar nominations and was a hit with critics and audiences. At the time, a lot of movies were made starring musicians, but most were showcases for the singers and not very good (think Elvis movies). A Hard Day's Night was a surprise because it actually had cinematic value. It even sold well when it was released on DVD many years later.\nWhen the deal was made to make the movie, The Beatles had not yet caught on in America and there were fairly low expectations for the film, as The Beatles were thought of as a fad that would soon pass. By the time filming began, The Beatles were huge and it was clear that a lot of people would see the movie. The studio considered putting more money into the film, but they decided to stick with the original modest budget. In order to save money, it was shot in black and white.",
    "The movie presented The Beatles as four distinct personalities, which changed the way they were marketed. Previously, they were always presented as a unified group, but it became clear that fans loved seeing their differences and began to associate with them individually. The concept of focusing on individual personalities in a band continues to this day, as groups like Spice Girls and Backstreet Boys are marketed with a focus on the various traits of the members, allowing fans to get to know them better.",
    "The last song in the movie soundtrack to be composed, the motion picture was being produced when Ringo made his statement that inspired the song (original movie title: Beatlemania). Walter Shenson, who was the movie producer of A Hard Day's Night, told PBS that he said to John, \"You need to write a song that will incorporate the movie's title,\" and Shenson was amazed when John came in the very next day with the song. He thought John would labor over it for days or weeks.",
    "Phil Collins was one of the school kids brought in as extras for a scene in the movie where The Beatles perform. He didn't make the cut, but years later, the film's producer gave Collins the outtake footage with him in it and had Collins add commentary to the DVD release.\nThe footage showed that Collins was rather sedate during the filming, as he was more interested in hearing the music than in getting on camera.",
    "Lennon sang lead and Paul McCartney sang the middle sequences. John had Paul sing the middle section because he felt Paul had the more appropriate vocal range for it. Surprisingly, he insisted on singing a higher harmonization in \"From Me To You\" only a year earlier because he said he could sing the higher stuff better than Paul. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "A journalist friend of Lennon's, Maureen Cleave, claims that she suggested a slight change to one of the lyrics for this song on the way to Abbey Road studios shortly before it was recorded. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n John - London, England\n                                                  \n                                                  ",
    "The Beatles recorded this in nine takes on Thursday, April 16, 1964. It was written and recorded in a little more than 24 hours. It had to be done quickly when film name was changed from \"Beatlemania!\" to \"A Hard Day's Night.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ben - Cheverly, MD\n                                                  \n                                                  ",
    "The Beatles won just four Grammy Awards in the '60s, and one of them was for this song: It won for Best Performance By A Vocal Group in 1964. The Beatles also won for Best New Artist that year.",
    "At the 2002 Super Bowl, where Paul McCartney performed \"Freedom,\" Terry Bradshaw started singing this with McCartney when Paul joined the Fox announcers on the set.",
    "The Hard Day's Night Hotel opened in Liverpool in 2003. It is next to The Cavern Club, where The Beatles played many of their early shows.",
    "A Beatles cartoon aired on ABC from 1965-1969. On each segment, the animated group (voiced by actors) would go on some kind of adventure before performing one of their songs. The very first episode was called \"A Hard Day's Night\" - when the Beatles need a quiet space to rehearse, Ringo suggests a castle, where various monsters and ghouls appear when the boys start playing. In a stroke of luck, the creatures are happy to hear the music, and The Beatles play this song while Dracula and the gang dance along."
  ],
  "lyrics": "It's been a hard day's night, and I've been working like a dog\nIt's been a hard day's night, I should be sleeping like a log\nBut when I get home to you I'll find the things that you do\nWill make me feel alright\n\nYou know I work all day to get you money to buy you things\nAnd it's worth it just to hear you say you're going to give me everything\nSo why on earth should I moan, 'cause when I get you alone\nYou know I feel ok\n\nWhen I'm home everything seems to be right\nWhen I'm home feeling you holding me tight, tight, yeah\n\nIt's been a hard day's night, and I've been working like a dog\nIt's been a hard day's night, I should be sleeping like a log\nBut when I get home to you I'll find the things that you do\nWill make me feel alright, oww\n\nSo why on earth should I moan, 'cause when I get you alone\nYou know I feel ok\n\nWhen I'm home everything seems to be right\nWhen I'm home feeling you holding me tight, tight, yeah\n\nOh, it's been a hard day's night, and I've been working like a dog\nIt's been a hard day's night, I should be sleeping like a log\nBut when I get home to you I'll find the things that you do\nWill make me feel alright\nYou know I feel alright\nYou know I feel alright\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}