{
  "Artist": "The Beatles",
  "Album": "Magical Mystery Tour",
  "Title": "All You Need Is Love",
  "URL": "https://www.songfacts.com/facts/the-beatles/all-you-need-is-love",
  "Confidence": 1.0,
  "youtube-id": "gq5SwK0bGCM",
  "facts": [
    "The Beatles played this for the first time on the \"Our World\" project, the first worldwide TV special. Broadcast in 24 countries on June 25, 1967, the show was six hours long and featured music from 6 continents, with The Beatles representing Britain. The Beatles were supposedly recording this live during the show, but they used a prerecorded backing track and John Lennon's vocal was redone a few hours later. Eric Clapton mimed guitar on this during the special.\nThe concept of the song was born out of a request to bring a song that was going to be understood by people of all nations. The writing began in late May of 1967, with John and Paul working on separate songs. It was decided that John's \"All You Need Is Love\" was the better choice because of its easy to understand message of love and peace. The song was easy to play, the words easy to remember and it encompassed the feeling of the world's youth during that period.",
    "\"All You Need Is Love\" was a popular saying in the '60s anti-war movement. The song was released in the middle of the Summer of Love (1967). It was a big part of the vibe.",
    "John Lennon wrote this as a continuation of the idea he was trying to express in his 1965 song \"The Word.\" John was fascinated by how slogans effect the masses and was trying to capture the same essence as songs like \"We Shall Overcome.\" He once stated, \"I like slogans. I like advertising. I love the telly.\" In a 1971 interview about his song \"Power To The People,\" he was asked if that song was propaganda. He said, \"Sure. So was 'All You Need Is Love.' I'm a revolutionary artist. My art is dedicated to change.\"",
    "Musically, this song is very unusual. The chorus is only one note, and the song is in a rare 7/4 tempo. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dwight Rounds, author of The Year The Music Died, 1964-1972\n                                                  \n                                                  ",
    "It was not until 1983 and the publication of the in the book John Lennon: In My Life by Pete Shotton and Nicholas Schaffner that it was revealed that John Lennon was the primary composer of the song. It is typical of Lennon: Three long notes (\"love -love -love\") and the rise of excitement with at first speaking, then recital, then singing, then the climax and finally the redemption. This as opposed to McCartney's conventional verse, verse, middle part, verse or A,A,B,A. Lennon felt that a good song must have a rise of excitement, climax and redeeming. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, a music historian in Stockholm\n                                                  \n                                                  ",
    "Ringo's second son, Jason, was born the day this hit #1 in the US: August 19, 1967. Jason is also a drummer.",
    "In the orchestral ending, you can hear pieces of both \"Greensleeves,\" a Bach two-part invention (by George Martin) and Glenn Miller's \"In The Mood.\" Royalties were paid to Miller for his contribution.",
    "McCartney sang the chorus to The Beatles 1963 hit, \"She Loves You\" at the end: \"She loves you yeah yeah yeah... She loves you yeah yeah yeah\" ",
    "John Lennon's hand-written lyrics for this song sold for one million pounds in the summer of 2005. Lennon left them in the BBC studios after The Beatles' last live TV appearance, and they were salvaged by an employee. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ryan - Kansas City, MO\n                                                  \n                                                  ",
    "This begins with a clip from the French national anthem, \"La Marseillaise,\" written and composed by Claude Joseph Rouget de Lisle in Strasbourg on April 25, 1792. Its original name was \"Chant de guerre de l'Armee du Rhin\" (\"Marching Song of the Rhine Army\") and it was dedicated to Marshal Nicolas Luckner, a Bavarian-born French officer from Cham. It became the rallying call of the French Revolution and got its name because it was first sung on the streets by troops from Marseille upon their arrival in Paris. Now the national anthem of France, the song was also once the anthem of the international revolutionary movement, contrasting with the theme of The Beatles song. In the late 1970s, Serge Gainsbourg recorded a reggae version \"Aux Armes et cetera,\" with Robbie Shakespeare, Sly Dunbar and Rita Marley in the choir in Jamaica, which resulted in him getting death threats from veterans of the Algerian War of Independence. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "Al and Tipper Gore had this song played at their wedding. They married in 1970 and separated in 2010.",
    "George Harrison mentioned this in his 1981 song \"All Those Years Ago\" with the line, \"But you point the way to the truth when you say 'All you need is love.'\" Harrison's song is a tribute to John Lennon, who was killed in 1980.",
    "This was used in the climactic final episode of the UK sci-fi series The Prisoner, and was the entrance music for Queen Elizabeth II during the UK Millennial celebrations of 1999. It was also sung by choirs across the kingdom in 2002 during the Queen's Golden Jubilee celebration. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "In 2007, this was used in an advertising campaign for Luvs diapers with the lyrics changed to \"All You Need Is Luvs.\" While Beatles songs have been used in commercials before, notably \"Revolution\" in spots for Nike and \"Hello Goodbye\" for Target, this peace anthem shilling for diapers didn't go over well with fans who thought it sullied The Beatles legacy. The publishing rights to \"All You Need Is Love\" and most other Beatles songs are controlled by the Sony corporation and Michael Jackson, which means The Beatles cannot prevent a company from re-recording the song and using it in a commercial.",
    "When asked what his favorite lyric is during an interview with NME, John Lennon's son Sean replied: \"My list of favorite things changes from day to day. I like when my dad said: 'There's nothing you can know that isn't known/ Nothing you can see that isn't shown/ Nowhere you can go that isn't where you're meant to be.' It seems to be a good representation of the sort of enlightenment that came out of the '60s.\""
  ],
  "lyrics": "Love, love, love\nLove, love, love\nLove, love, love\n\nThere's nothing you can do that can't be done\nNothing you can sing that can't be sung\nNothing you can say, but you can learn how to play the game\nIt's easy\nNothing you can make that can't be made\nNo one you can save that can't be saved\nNothing you can do, but you can learn how to be you in time\nIt's easy\n\nAll you need is love\nAll you need is love\nAll you need is love, love\nLove is all you need\n\nAll you need is love\nAll you need is love\nAll you need is love, love\nLove is all you need\n\nThere's nothing you can know that isn't known\nNothing you can see that isn't shown\nThere's nowhere you can be that isn't where you're meant to be\nIt's easy\n\nAll you need is love\nAll you need is love\nAll you need is love, love\nLove is all you need\n\nAll you need is love (all together now)\nAll you need is love (everybody)\nAll you need is love, love\nLove is all you need\n\nLove is all you need\n(Love is all you need)\nLove is all you need\n(Love is all you need)\nLove is all you need\n(Love is all you need)\nLove is all you need\n(Love is all you need)\nLove is all you need\n(Love is all you need)\nLove is all you need\n(Love is all you need)\nLove is all you need\n(Love is all you need)\nLove is all you need\n(Love is all you need)\nLove is all you need\n(Love is all you need)\nLove is all you need\n(Love is all you need)\nLove is all you need\n(Love is all you need)\n(Love is all you need)\n(Love is all you need)\n(Love is all you need)\nYesterday\n(Love is all you need)\nOh\nLove is all you need\nLove is all you need\nOh yeah\nLove is all you need\n(She love you, yeah, yeah, yeah)\n(She love you, yeah, yeah, yeah)\n(Love is all you need)\n(Love is all you need)\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}