{
  "Artist": "The Beatles",
  "Album": "With the Beatles",
  "Title": "All My Loving",
  "URL": "https://www.songfacts.com/facts/the-beatles/all-my-loving",
  "Confidence": 1.0,
  "youtube-id": "pOxAqhTaXzw",
  "facts": [
    "This was the first time Paul McCartney wrote the words to a song before the music. The song began as a poem he conceived while he was shaving one morning thinking about his girlfriend Jane Asher, whom he met when she interviewed him for the magazine Radio Times. He wrote the music that night. He originally envisioned it as a country/western song.",
    "This Beatles classic was never released as a single, but it was the first song the group played on their first Ed Sullivan Show appearance: February 9, 1964. It was a historic telecast, as over 73 million people tuned in. At the time, that was the largest audience ever for a TV show.",
    "McCartney sang lead on this. His vocal was double-tracked to bring it out in the mix.",
    "George Harrison's guitar solo was influenced by Chet Atkins, one of his idols when he was learning to play.",
    "John Lennon was always fond of the grinding rhythm guitar he contributed to the studio recording. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Three very different cover versions charted in the US in 1964: An instrumental by the Hollyridge Strings made #93, a faithful version by Jimmy Griffin hit #118, and a squeaky rendition by The Chipmunks made #134."
  ],
  "lyrics": "Close your eyes and I'll kiss you\nTomorrow I'll miss you\nRemember I'll always be true\nAnd then while I'm away\nI'll write home every day\nAnd I'll send all my lovin' to you\n\nI'll pretend that I'm kissing\nThe lips I am missing\nAnd hope that my dreams will come true\nAnd then while I'm away\nI'll write home every day\nAnd I'll send all my lovin' to you\n\nAll my lovin', I will send to you\nAll my lovin', darlin', I'll be true\n\nClose your eyes and I'll kiss you\nTomorrow I'll miss you\nRemember I'll always be true\nAnd then while I'm away\nI'll write home every day\nAnd I'll send all my loving to you\n\nAll my lovin', I will send to you\nAll my lovin', darlin', I'll be true\nAll my lovin', all my lovin'\nOoh ooh, all my lovin', I will send to you\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd., DistroKid\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}