{
  "Artist": "The Beatles",
  "Album": "Revolver",
  "Title": "And Your Bird Can Sing",
  "URL": "https://www.songfacts.com/facts/the-beatles/and-your-bird-can-sing",
  "Confidence": 1.0,
  "youtube-id": "fH-3y_Ike5E",
  "facts": [
    "\"Bird\" is British slang for \"Girl.\" One theory is that this song is a scolding by John Lennon of his buddy Mick Jagger of the Rolling Stones, who loved to brag about his bird - Marianne Faithfull - who was great, green (jealous/young) and could sing. John made it clear that Mick and the Stones wear great but could never ever match up to John and the other Beatles.",
    "In the 2007 book Can't Buy Me Love, Jonathan Gould makes the case that the song was inspired by a profile of Frank Sinatra by Gay Talese that appeared in the April 1966 issue of Esquire magazine. \"Bird,\" Talese wrote, \"is a favorite Sinatra word. He often inquires of his cronies, 'How's your bird?'\"\nWhat brought the article to Lennon's attention was a press release sent by Sinatra's PR man that read: \"If you happen to be tired of kid singers wearing mops of hair thick enough to hide a crate of melons... 'Tell me that you've heard every sound there is,' crooned the world's greatest kid singer in his enigmatic reply, 'and your bird can swing. But you can't hear me. You can't hear me.'\"\nThe original 1966 article, titled \"Frank Sinatra Has a Cold,\" can be read in Gay Talese's 2003 collection titled The Gay Talese Reader: Portraits and Encounters. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Susan - Toronto, Canada\n                                                  \n                                                  ",
    "The signature dual-harmony electric lead guitar parts were played live (without overdubbing) by Harrison and McCartney. Lennon played the rhythm in the \"D major\" position with the capo on the second fret (to account for the song being in the key of E). John used the 2nd fret capo several times (\"Nowhere Man,\" \"Julia,\" \"Norwegian Wood (This Bird Has Flown)\" to name a few). \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Barry Kesten - Bellmore, NY\n                                                  \n                                                  ",
    "John Lennon said this was a throwaway song with random words of psychedelia added in designed to sound like it meant something. He considered it one of his worst songs. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jonathon - Clermont, FL\n                                                  \n                                                  ",
    "The working title for this was \"You Don't Get Me.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Marcos - Fort Worth, TX\n                                                  \n                                                  ",
    "The double-tracked guitar solo rates in at #69 on the \"100 Greatest Guitar Solos\" list done by Rolling Stone magazine. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jonathon - Clermont, FL\n                                                  \n                                                  ",
    "The middle part of the song has one melody, but in three versions. which are bound together with a counterpoint melody on a giutar. Unusually, the sung-melody even has some quarter notes, for example the note behind the word \"broken\" in \"when your bird is broken...\" When Lennon finishes the middle part with singing \"I'll be around\" twice in the same melody, he changes chord when he sings it the second time, without changing the melody. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, who is a music historian in Stockholm\n                                                  \n                                                  ",
    "In America, this was included on the Yesterday... And Today album, but left off of Revolver."
  ],
  "lyrics": "Tell me that you've got everything you want\nAnd your bird can sing\nBut you don't get me\nYou don't get me\n\nYou say you've seen the seven wonders\nAnd you bird is green\nBut you can't see me\nYou can't see me\n\nWhen your prized possessions\nStart to weigh you down\nLook in my direction\nI'll be round, I'll be round\n\nWhen your bird is broken\nWill it bring you down?\nYou may be awoken\nI'll be round, I'll be round\n\nYou tell me that you've heard every sound there is\nAnd your bird can swing\nBut you can't hear me\nYou can't hear me\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}