{
  "Artist": "The Beatles",
  "Album": "A Hard Day's Night",
  "Title": "And I Love Her",
  "URL": "https://www.songfacts.com/facts/the-beatles/and-i-love-her",
  "Confidence": 1.0,
  "youtube-id": "9_c2XZd9mMo",
  "facts": [
    "Paul McCartney wrote most of this song. In a 1984 interview with Playboy magazine, he stated, \"It's just a love song; no, it wasn't for anyone.\" That was probably the chivalrous thing to do, as by then he was 15 years into his marriage to Linda. When he wrote the song, he was dating an actress named Jane Asher. For a while, they were the most popular couple in England. After they broke up in 1968, McCartney married Linda Eastman and Asher became a proficient author. She later started her own business called \"Jane Asher Party Cakes.\"\nMcCartney did write \"We Can Work It Out\" and \"Here, There And Everywhere\" about Asher.",
    "This was one of the first pop songs with a title that starts in mid-sentence. Paul was inspired by songs such as Perry Como's \"And I Love Her So.\"",
    "Most of the songs on the album A Hard Days Night are John Lennon compositions. Lennon helped out with the middle part of this song, but it's mostly the work of McCartney. Structurally, the song is fairly conventional, with a clear melody in A+A+B+A system similar to popular music from the '30s that Irving Berlin wrote. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, a music historian in Stockholm\n                                                  \n                                                  ",
    "Paul McCartney was the only Beatle to sing on this. Like \"Yesterday,\" it is one of just a few Beatle songs with only one vocalist.",
    "George Harrison came up with the acoustic guitar intro that made the song instantly recognizable. \"I think that song wouldn't be anything without that,\" McCartney told GQ in 2018. \"He just made up that riff, and you think about that song without that riff, it wouldn't be half as good.\"",
    "This is one of the most-covered Beatles songs, with well over 300 recorded versions Their most-covered track is \"Yesterday.\"",
    "McCartney always intended this to be a ballad. He felt that all of their albums, regardless of how \"rocky\" they were, should have at least one ballad \"to enrich the show.\" It's the reason he added \"Till There Was You\" to With The Beatles. The Beatles Anthology 1 album has a much faster version that includes both drums and George's 12-string electric guitar, but that wasn't the original intent.",
    "The Beatles recorded this song at the end of February 1964, in the week after returning from the United States and before the start of filming their movie A Hard Day's Night, where they perform the song. The take you hear on record is Take 21.",
    "Ringo played the bongos on this track; George Harrison played the acoustic guitar solo.",
    "The guitar duo Santo & Johnny recorded a mellow surf instrumental version of this song in 1965 which was a huge hit in Mexico. Santo & Johnny are known for their #1 hit \"Sleep Walk.\"",
    "Despite the fact that he wrote 35% of this song (the middle eight), John Lennon called this \"Paul's first 'Yesterday.'\"",
    "This was the first Beatles recording using purely acoustic instruments.",
    "Paul once stated \"This was the first song that I impressed myself with.\"",
    "When Paul McCartney was asked during a 2014 Twitter Q&A what he considers to be his favorite cover of one of his tracks, the former Beatle replied: \"There are so many that I love it's difficult to say, but Esther Phillips' version of 'And I love HIM' comes to mind.\""
  ],
  "lyrics": "I give her all my love\nThat's all I do\nAnd if you saw my love\nYou'd love her, too\nI love her\n\nShe gives my everything\nAnd tenderly\nThe kiss my lover brings\nShe brings to me\nAnd I love her\n\nA love like ours\nCould never die\nAs long as I\nHave you near me\n\nBright are the stars that shine\nDark is the sky\nI know this love of mine\nWill never die\nAnd I love her\n\nBright are the stars that shine\nDark is the sky\nI know this love of mine\nWill never die\nAnd I love her\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Tratore, Kobalt Music Publishing Ltd., DistroKid\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-43.jpg",
    "facts": "Jane Asher met The Beatles when she was backstage after one of their shows; all four instantly proposed marriage (which they said to every girl at the time). When it became obvious she was interested in Paul, the others discreetly left the two in his hotel suite... only to come back later and find them discussing their favorite foods. Paul stayed overnight with the Ashers in 1964 when he missed his train to Liverpool; within weeks he'd practically moved in with them. Once engaged to Paul McCartney; while Jane could tolerate his occasional dalliances, she and Paul disagreed on when to start a family."
  }
}