{
  "Artist": "The Beatles",
  "Album": "Help!",
  "Title": "Another Girl",
  "URL": "https://www.songfacts.com/facts/the-beatles/another-girl",
  "Confidence": 1.0,
  "youtube-id": "M-_Qu6Jl3S0",
  "facts": [
    "Paul McCartney wrote this while on a 10-day holiday in Tunisia. \"Another Girl\" stands out as one of the most prototypical songs of the early Beatles formula. Here we have Paul's \"silly love song,\" a poppy-upbeat tempo, downward scale fragments, limited pitch range on guitar, and double-tracked lead vocals. McCartney could crank these out all day like McDonald's assembling Big Macs.\nMcCartney explains that when he wrote this song, he was a guest of the British government while staying in a secluded beach-side villa at Hammamet, Tunisia. He found the tiled bathroom ideal for songwriting, due to the acoustics. However, one downside is that he had a lot of foreign dignitaries dropping by.",
    "Paul McCartney played lead guitar toward the end of this song, which was unusual as normally he was The Beatles bass player.",
    "Paul has defended songs like this one, claiming that no matter how much they sound like album filler, they had to pass \"The Beatles Test.\" Which is to say, all four members had to like the song. If even Ringo said, \"I don't like this one,\" the song got thrown out.",
    "\"Another Girl\" was recorded in one take. Afterwards, George Harrison noodled around in the studio trying to add a guitar flourish to the end of the song. But when Paul remixed it, George's track-work was lost.",
    "In the video (taken from the Beatles movie Help!) - what, exactly, is Paul doing? He's supposed to be playing the woman like a guitar? With a hover-hand over the breast region? This is as surreal as McCartney gets."
  ],
  "lyrics": "For I have got another girl, another girl\nYou're making me say that I've got nobody but you\nBut as from today, well, I've got somebody that's new\nI ain't no fool and I don't take what I don't want\n\nFor I have got another girl, another girl\nShe's sweeter than all the girls and I've met quite a few\nNobody in all the world can do what she can do\nAnd so I'm telling you this time you'd better stop\n\nFor I have got another girl\nAnother girl who will love me 'til the end\nThrough thick and thin she will always be my friend\n\nI don't want to say that I've been unhappy with you\nBut as from today, well, I've seen somebody that's new\nI ain't no fool and I don't take what I don't want\n\nFor I have got another girl\nAnother girl who will love me 'til the end\nThrough thick and thin she will always be my friend\n\nI don't want to say that I've been unhappy with you\nBut as from today, well, I've seen somebody that's new\nI ain't no fool and I don't take what I don't want\n\nFor I have got another girl\nAnother girl\nAnother girl\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}