{
  "Artist": "The Beatles",
  "Album": "A Hard Day's Night",
  "Title": "Any Time At All",
  "URL": "https://www.songfacts.com/facts/the-beatles/any-time-at-all",
  "Confidence": 1.0,
  "youtube-id": "txSs2FFRt8s",
  "facts": [
    "This is one of those songs that was finished \"on the fly\" so to speak. John Lennon had it half written when they went into the studio with it and he just finished it up and recorded it there. He called it, \"An effort at writing 'It Won't Be Long'... with me shouting.\"",
    "Lennon's original draft of this song had two extra verses that he left off, the last of which started, \"I'll be waiting here all alone/Just like I've always done.\" He left them off because he felt they didn't really advance the story in the song.",
    "Lennon's handwritten lyrics were auctioned for £6000 in 1988.",
    "This is one of the songs not in the film A Hard Day's Night which was written to fill out the album. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "Lennon wrote 10 of the 13 songs on A Hard Day's Night. In his Playboy interview in September of 1980, he went through the entire Lennon/McCartney catalogue song by song, and stated which bits of the songs were his and which were Paul's. This was the first time we learned specifically about the songwriting breakdown between John and Paul.",
    "Albert Goldman thought in his book The Lives of John Lennon that the refrain was fantastic: \"It sounds as a pistol shot... his voice is burning in a true gospel frenzy... he had a remarkable ability to utter cries from the deep of his soul.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, a music historian in Stockholm\n                                                  \n                                                  "
  ],
  "lyrics": "Any time at all, any time at all\nAny time at all, all you gotta do is call\nAnd I'll be there\n\nIf you need somebody to love\nJust look into my eyes\nI'll be there to make you feel right\nIf you're feeling sorry and sad\nI'd really sympathize\nDon't you be sad, just call me tonight\n\nAny time at all, any time at all\nAny time at all, all you gotta do is call\nAnd I'll be there\n\nIf the sun has faded away\nI'll try to make it shine\nThere is nothing I won't do\nWhen you need a shoulder to cry on\nI hope it will be mine\nCall me tonight and I'll come to you\n\nAny time at all, any time at all\nAny time at all, all you gotta do is call\nAnd I'll be there\n\nAny time at all, any time at all\nAny time at all, all you gotta do is call\nAnd I'll be there\nAny time at all, all you gotta do is call\nAnd I'll be there\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}