{
  "Artist": "The Beatles",
  "Album": "Magical Mystery Tour",
  "Title": "Baby You're A Rich Man",
  "URL": "https://www.songfacts.com/facts/the-beatles/baby-youre-a-rich-man",
  "Confidence": 1.0,
  "youtube-id": "IRmE2AiabUY",
  "facts": [
    "This song is about how everybody can have the things that matter, and it has nothing to do with material possessions. The Beatles were rich, but they claimed that money was not that important to them.",
    "John Lennon and Paul McCartney wrote parts of this separately and combined it to make one song - something they would repeat on \"A Day In The Life.\" At one point, the song was called \"One Of The Beautiful People.\"",
    "The trumpet-like sound at the beginning is a clavioline, an amplified keyboard that acted as a crude synthesizer. Other songs that used a clavoline include \"Telstar\" by The Tornados and \"Runaway\" by Del Shannon.",
    "It was rumored that The Beatles sang \"Baby you're a rich fag Jew\" as a slur to their manager, Brian Epstein. He was rich, gay and Jewish, but The Beatles never said this was about him. Epstein died later in that year when he overdosed on sleeping pills.",
    "The Beatles started working on this song with the intention of using it on the Yellow Submarine soundtrack. It was used in the 1968 movie, but didn't appear on the soundtrack.",
    "Mick Jagger sang backup. McCartney and Lennon returned the favor by singing on The Stones' \"We Love You.\"",
    "Brian Jones, the guitarist from The Rolling Stones, played an oboe on this. A few years earlier, Lennon and McCartney gave The Stones a song called \"I Wanna Be Your Man,\" which was one of their first hits, and helped convince Mick Jagger and Keith Richards that they should write their own songs.",
    "This was released as the B-side of \"All You Need Is Love.\"",
    "Lennon played clavioline and piano on the song and George Harrison played tambourine. There is actually no guitar on this song at all. Paul played bass and piano as well.",
    "This was released in mono, but in 1971 it was remixed in stereo along with several other tracks for a German version of Magical Mystery Tour. The stereo version is the one that is now the most common. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The comedy rap trio The Fat Boys performed this song in their 1987 movie Disorderlies.",
    "In 2010, this song was used at the end of the movie The Social Network to punctuate the raging financial success of the guys who invented Facebook. It was one of the few Beatles songs licensed to a movie in its original form, meaning the Beatles version was used. Apple Corp. is very particular about where Beatles songs are used.",
    "At one point in this song, The Beatles ask, \"How does it feel to be one of the beautiful people?\" The phrase \"beautiful people\" was used a lot in 1967 as a derisive way to describe the social elite. A popular book by Marilyn Bender was published that year called The Beautiful People: a Candid Examination of a Cultural Phenomenon - the Marriage of Fashion and Society in the '60s."
  ],
  "lyrics": "How does it feel to be\nOne of the beautiful people\nNow that you know who you are\nWhat do you want to be\nAnd have you traveled very far?\nFar as the eye can see\n\nHow does it feel to be\nOne of the beautiful people\nHow often have you been there\nOften enough to know\nWhat did you see when you were there\nNothing that doesn't show\n\nBaby you're a rich man\nBaby you're a rich man\nBaby you're a rich man, too\nYou keep all your money in a big brown bag\nInside a zoo, what a thing to do\nBaby you're a rich man\nBaby you're a rich man\nBaby you're a rich man, too\n\nHow does it feel to be\nOne of the beautiful people\nTuned to a natural E\nHappy to be that way\nNow that you've found another key\nWhat are you going to play\n\nBaby you're a rich man\nBaby you're a rich man\nBaby you're a rich man, too\nYou keep all your money in a big brown bag\nInside a zoo, what a thing to do\nBaby, baby, you're a rich man\nBaby you're a rich man\nBaby you're a rich man, too, oh\nBaby you're a rich man\nBaby you're a rich man (baby)\nBaby you're a rich man, too\nBaby you're a rich man\nBaby you're a rich man\nBaby you're a rich man, too\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}