{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "Back in the USSR",
  "URL": "https://www.songfacts.com/facts/the-beatles/back-in-the-ussr",
  "Confidence": 1.0,
  "youtube-id": "nS5_EQgbuLc",
  "facts": [
    "The story of this song begins in Hrishikesh, India, where The Beatles were on a retreat learning Transcendental Meditation from their guru, Maharishi Mahesh Yogi. Also on the retreat was Mike Love of The Beach Boys, who told us: \"Paul (McCartney) came down to the breakfast table one morning saying, 'Hey, Mike, listen to this.' And he starts strumming and singing, 'Back in the U.S.S.R.,' the verses. And I said, 'Well, Paul, what you ought to do is talk about the girls around Russia, Ukraine girls and then Georgia on my mind, and that kind of thing.' Which he did.\nSo I think it was the fact I was there, which caused Paul to think in terms of Beach Boys, and then my suggestion for what to do on the bridge, he took that suggestion and crafted, like only Sir Paul can, a really great song.\"\nMcCartney was impressed with the idea and used some Beach Boys' elements in this song: Instead of \"California Girls\" it was \"Moscow Girls.\" Plus, the definitive Beach Boy \"Oooeeeeoooo\" in the background harmonies.\nThe title was inspired by Chuck Berry's \"Back In The U.S.A.\" The Beach Boys had been influenced by that song and also \"Sweet Little Sixteen\" to come up with \"California Girls\" and \"Surfin' U.S.A.\"",
    "Paul stated in 1968, \"In my mind it's just about a (Russian) spy who's been in America for a long time and he's become very American but when he gets back to the USSR he's saying, 'Leave it 'til tomorrow to unpack my case, Honey, disconnect the phone.' and all that, but to Russian women.\"",
    "Things were tense when they were working on this album, and Ringo walked out during recording, briefly quitting the band. Paul McCartney played drums in his place.",
    "In early 1968, the British government launched the \"I'm Backing Britain\" campaign to rally enthusiasm and boost their economy, even encouraging workers to stay on the job an extra 30 minutes every day without pay. As part of the campaign, Bruce Forsyth released a song of that title, with the lyrics:\nIn offices and factories up and down the country\nAn extra half an hour is all we need each day\nIn shops and supermarkets, everybody's started\nTo work a little more without the pay\nThis campaign may have influenced \"Back In The U.S.S.R.,\" at least the title.",
    "The line \"Georgia's always on my mind\" in a play on the Ray Charles song \"Georgia On My Mind.\" It has a double meaning, since Georgia was part of the U.S.S.R.",
    "Elton John performed this song when he toured Russia in 1979, and he got a huge response. This was the year before Moscow hosted the Summer Olympics, which the United States boycotted. Elton told Q magazine: \"The first night as an encore I did 'Back In The U.S.S.R.' And they went apes--t. It was like playing 'Philadelphia Freedom' in Philadelphia. You just noticed that the people there were as ordinary and as good as the people you'd notice anywhere else.\"\nBilly Joel got a similar reaction when he played the song in Moscow in 1987.",
    "This song caused a controversy with conservative America, because it came out during Vietnam and the Cold War and it appeared to be celebrating the enemy.",
    "This opens with the sound of an airplane flying from left to right across the speakers. Stereo was relatively new, so this was very innovative for the time.",
    "On August 22, 1968, following an argument with McCartney over the drum part for this song, Ringo walked out on The Beatles. He flew to Sardinia for a holiday to consider his future. While there he received a telegram from his bandmates saying, 'You're the best rock 'n' roll drummer in the world. Come on home, we love you.' On his return, he found his drum kit covered with flowers. A banner above read, 'Welcome Back.'",
    "Paul McCartney told Mojo magazine October 2008 that the song's middle-eight was a spoof of the Beach Boys leading up to Pet Sounds. He added: \"The rest is (sings first bars of the melody line of the opening verse) more Jerry Lee (Lewis). And the title is Chuck Berry, Back In The U.S.A., and the song itself is more a take on Chuck. You'd get these soldiers back from Korea or Vietnam, wherever the hell, and Chuck was picking up on that. I thought it was a funny idea to spoof that with the most unlikely thing of way back in Siberia.\"",
    "There was a rumor in the Soviet Union that The Beatles had secretly visited the U.S.S.R. and given a private concert for the children of top Communist party members. They believed the song was written because of the concert. Actually, some fans still believe so. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Alex - Tomsk, Russia Federation\n                                                  \n                                                  ",
    "The wafer-thin actress and model Twiggy claimed that this song was written for her to sing on a tour of Russia that didn't materialize. She and McCartney had met to discuss a film project, but it's unlikely this song was written for her.",
    "Paul McCartney used this as the title to an album he released only in Russia in 1989. In 2002, McCartney called his US tour the \"Back In The US\" tour.",
    "In Stephen King's 1979 novel The Dead Zone, a serial killer hums this tune as he contemplates his first murder."
  ],
  "lyrics": "Flew in from Miami Beach BOAC\nDidn't get to bed last night\nOn the way the paper bag was on my knee\nMan, I had a dreadful flight\nI'm back in the USSR\nYou don't know how lucky you are, boy\nBack in the USSR, yeah\n\nBeen away so long I early knew the place\nGee, it's good to be back home\nLeave it till tomorrow to unpack my case\nHoney disconnect the phone\nI'm back in the USSR\nYou don't know how lucky you are, boy\nBack in the US\nBack in the US\nBack in the USSR\n\nWell the Ukraine girls really knock me out\nThey leave the west behind\nAnd Moscow girls make me sing and shout\nThat Georgia's always on my my my my my my my my my mind\nOh, come on\nHu hey hu, hey, ah, yeah\nYeah, yeah, yeah\nI'm back in the USSR\nYou don't know how lucky you are, boys\nBack in the USSR\n\nWell the Ukraine girls really knock me out\nThey leave the west behind\nAnd Moscow girls make me sing and shout\nThat Georgia's always on my my my my my my my my my mind\n\nOh, show me round your snow peaked\nMountain way down south\nTake me to your daddy's farm\nLet me hear your balalaika's ringing out\nCome and keep your comrade warm\nI'm back in the USSR\nHey, you don't know how lucky you are, boy\nBack in the USSR\nOh, let me tell you, honey\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "place": {
    "name": "Russia",
    "facts": [
      "The Beatles were at their best when they were being complete, utter smart-asses. Consider \"Back in the U.S.S.R.,\" which could have made a good",
      "episode.",
      "In the first place, it was a parody of Chuck Berry's \"Back in the U.S.A.\" In the second place, it's a",
      "parody of the Beach Boys, with their surfer-style doo-wop chorus. Now, note how masterfully the verses blend into the chorus and back again, all set to Paul McCartney's pedal-to-the-metal piano, which almost threatens to run you over if you can't keep up.",
      "In the third place, there are puns in the words as well. The title is a punt at British Prime Minister Harold Wilson's 1968 campaign to boost the British economy, which ran by the slogan \"I'm backing Britain,\" in an attempt to convince the British to work an additional half hour each day without pay. So he's backin' the USSR (in all its Communist glory). And then there's Georgia, which is always on your your your your your your mind. Georgia is a republic of the former Soviet Union, but this is also a play on Hoagy Carmichael's and Stuart Gorrell's song \"Georgia on My Mind.\" John and Paul managed to sass everybody popular that year with one quick song.",
      "A notable piece of trivia: Surprise! that's not Ringo Starr on the drums - it's Paul McCartney! Ringo and McCartney had an argument that day (August 22, 1968), and Ringo stormed out of the studio in a huff, saying he'd quit. So rather than going after Ringo, Paul just recorded a drum track and added it to the song, making his full credits on the song read \"vocals, piano, lead guitar, drums, bass, handclaps, percussion.\" Do you detect a note of extra sass in Paul's playing in this song? That's him saying to Ringo, \"Fine, be a baby and throw your little tantrum. We don't need you.\" Ringo came crawling back two weeks later, in time for \"Hey, Jude.\"",
      "Note the point in time, as well. 1968 was smack in the middle of the Cold War, the epic period of struggle between the Soviet Union and its satellite nations and the Western world. It was also during the Vietnam War and during a time of tension in places like North Korea. The Cuban Missile Crisis had only happened six years prior. So the song is politically thumbing its nose at several national targets, as well. The worldwide protests of 1968 - a symptom of the post-WWII Baby Boomers reaching the age of temper tantrums - were a great time to release a protest song.",
      "As a part of the famous",
      ", this is the first song on side one that you hear, and it segues into the song melodies of \"Dear Prudence.\" As a single, it was released with \"Don't Pass Me By\" on the B-side. The single's cover photo of all four is especially telling of the Ringo incident. Paul is dressed like",
      ", with a provocative stance and an impatient scowl, taking center stage. Ringo is in front, but turning his head back towards his shoulder to return Paul's glare. John is barely visible, but he's sticking his face in between the two, as if to say \"break it up!\" And George is off to Paul's flank, hands behind back, pulling an innocent poker face - \"I'm not in this!\"",
      "Ah, those crazy Beatles of 1968! What will they do next?"
    ]
  }
}