{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Because",
  "URL": "https://www.songfacts.com/facts/the-beatles/because",
  "Confidence": 1.0,
  "youtube-id": "g4Msnn20clQ",
  "facts": [
    "John Lennon got the idea for this song when he heard Yoko Ono playing Beethoven's \"Moonlight Sonata\" on the piano. He asked her to play it backwards, and came up with \"Because\" based on what he heard. John said, \"I was lying on the sofa in our house, listening to Yoko play Beethoven's 'Moonlight Sonata' on the piano. Suddenly, I said 'Can you play those chords backward?' She did, and I wrote 'Because' around them. The song sounds like 'Moonlight Sonata,' too. The lyrics are clear, no bulls--t, no imagery, no obscure references.\"",
    "The vocals are a 3-part harmony by Lennon, Paul McCartney, and George Harrison that was overdubbed twice, creating a 9-part harmony. This is the only Beatles song with three singers throughout. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dwight Rounds, author of The Year The Music Died, 1964-1972\n                                                  \n                                                  ",
    "Lennon said the arrangement was terrible, but McCartney and Harrison both cited \"Because\" as the best track on Abbey Road, noting the 3-part harmony.",
    "This was the first use of a Moog synthesizer on any recording. Harrison had the instrument specially made, and did his best to figure it out.",
    "The 2006 Love album, which is a soundtrack to the Beatles Cirque du Soleil show of the same name, features an a cappella version of this song. The album contains 26 tracks made up of 130 separate recordings - some are just a chord or two, and some tracks are superimposed on other tracks. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "Because the world is round it turns me on\nBecause the world is round, ah\n\nBecause the wind is high it blows my mind\nBecause the wind is high, ah\n\nLove is old, love is new\nLove is all, love is you\n\nBecause the sky is blue, it makes me cry\nBecause the sky is blue, ah\n\nAh, ah, ah, ah\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}