{
  "Artist": "The Beatles",
  "Album": "Sgt. Pepper's Lonely Hearts Club Band",
  "Title": "Being For The Benefit Of Mr. Kite!",
  "URL": "https://www.songfacts.com/facts/the-beatles/being-for-the-benefit-of-mr-kite",
  "Confidence": 1.0,
  "youtube-id": "Oy4ItVCZEc4",
  "facts": [
    "During the filming of the video for \"Strawberry Fields Forever,\" John Lennon and Apple Records employee Tony Bramwell went into an antique shop close to their hotel. Tony says, \"John and I wandered in and John spotted this framed Victorian circus poster and bought it.\" John stated, \"'Mr. Kite' was a straight lift. I had all the words staring me in the face one day when I was looking for a song. It was from this old poster I'd bought at an antique shop. We'd been down in Surrey or somewhere filming a piece. There was a break, and I went into this shop and bought an old poster advertising a variety show which starred Mr. Kite. It said the Henderson's would also be there, late of Pablo Fanques Fair. there would be hoops and horses and someone going through a hogshead of real fire. Then there was Henry The Horse. The band would start at ten to six. All at Bishopsgate. Look, there's the bill, with Mr. Kite topping it. I hardly made up a word, just connecting the lists together. Word for word, really.\"",
    "The song's title comes from a standard 19th century phrase used in advertising testimonial performances in Britain: \"Being for the benefit of...\"\nAll-round performer William Kite worked alongside Pablo Fanque and wire-walker/clown/trampolines the Hendersons in 1843. John Lennon got the phrase when he saw a poster advertising their show.",
    "As he did with many songs he wrote, John Lennon downplayed this one. \"I was just going through the motions because we needed a new song for Sgt. Pepper,\" he said.",
    "This song was credited to Lennon/McCartney, but often assumed to be written almost entirely by John. Paul McCartney claims that he had a hand in writing it, however. \"'Mr. Kite' is such a crazy oddball song, and I have great memories of writing it with John,\" he told Rolling Stone in 2013. McCartney, who played the song on his tour that year, added that if he envisioned the song as a live number, he wouldn't have made the bass line so complicated when he composed it.",
    "The carnival sounds came from recordings of old steam organs that would be heard at county fairs and amusement parks. Producer George Martin had them on tape, but wanted them to sound chaotic to simulate the carnival experience. So, he had engineer Geoff Emerick chop up the tapes and splice them back together in random order, creating a loop that was augmented by various organs played in the studio.",
    "This was going to come after the title track on the album, but they decided to use \"With A Little Help From My Friends,\" sung by the fictional Billy Shears, so that the concept of the album would continue.",
    "It was rumored that \"Henry The Horse\" was heroin. \"Horse\" is slang for heroin, but Lennon denied that it was a drug reference. The horse is in the poster, but his name is Zanthus. Since the name Zanthus is not very musical, Lennon used the much better sounding name of Henry, making use of alliteration. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Craig - Hudson, NH\n                                                  \n                                                  ",
    "George Harrison and Ringo Starr played harmonicas on this song along with Mal Evans and Neil Aspinall.",
    "George Martin revealed at a 2008 LA presentation for members of the National Recording Academy of Arts and Sciences one of his recording techniques for this song. The Beatles producer told engineer Geoff Emerick to cut up old tapes of organ music, threw them in the air and onto the floor and then reassembled them at random, running the new sounds concurrent with the song's main organ melody.",
    "Asked during a 2014 Twitter Q&A what his favorite bassline to play is, Paul McCartney replied: \"At the moment it's 'Being for the Benefit of Mr. Kite!' It's challenging!\""
  ],
  "lyrics": "For the benefit of Mr. Kite\nThere will be a show tonight on trampoline\nThe Hendersons will all be there\nLate of Pablo Fanques Fair, what a scene\nOver men and horses, hoops and garters\nLastly through a hogshead of real fire\nIn this way Mr. K. will challenge the world\n\nThe celebrated Mr. K.\nPerforms his feat on Saturday at Bishops Gate\nThe Hendersons will dance and sing\nAs Mr. Kite flies through the ring, don't be late\nMessrs. K and H. assure the public\nTheir production will be second to none\nAnd of course Henry The Horse dances the waltz\n\nThe band begins at ten to six\nWhen Mr. K. performs his tricks without a sound\nAnd Mr. H. will demonstrate\nTen summer sets he'll undertake on solid ground\nHaving been some days in preparation\nA splendid time is guaranteed for all\nAnd tonight Mr. Kite is topping the bill\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-124.jpg",
    "facts": "Before video games, people had to find creative ways to entertain themselves. This circus looks like fun!"
  }
}