{
  "Artist": "The Beatles",
  "Album": "CD2 - The Beatles",
  "Title": "Birthday",
  "URL": "https://www.songfacts.com/facts/the-beatles/birthday",
  "Confidence": 1.0,
  "youtube-id": "Cs5vUfddkT8",
  "facts": [
    "According to Q magazine May 2008, the Beatles were in a rush to get to Paul McCartney's house in time to catch the rock 'n' roll movie The Girl Can't Help It. Consequently they played around with a simple Blues track rather than record anything too involved. Duly inspired after watching the movie, they completed the song back in studio that night.",
    "Paul McCartney told Mojo magazine October 2008 the story of this song: \"With 'Birthday' we had a few friends around and it was one of our party's birthday, can't remember who. Pattie Boyd was there, Terry Dolan, just a few mates. Normally we didn't have friends around to sessions so it was very unusual. We didn't know what song to do so we decided to make one up. We did what Roy Orbison had done with 'Pretty Woman' and Little Richard had started with 'Lucille,' do-do do-do do-do do-do; Roy Orbison goes, do-do do-do DO-DO DO-DO- he just changes the end a little bit. We changed basically the same riff of Lucille and Pretty Woman into Birthday- do-do do-do do-do do-do…'You say it's your birthday.'\"",
    "This was one of the last songs John Lennon and Paul McCartney collaborated on. Even though all of their songs were credited to Lennon/McCartney, many of their later songs were written separately.",
    "The unique sound of this song was not supplied by an organ or any kind of keyboard. It came from running a guitar through a Leslie speaker. Such speakers are commonly found in keyboard instruments. The speaker rotates, which is what provides the different sound. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n don - rapid city, SD\n                                                  \n                                                  ",
    "There is a rumor that McCartney owns the rights to the song \"Happy Birthday.\" McCartney does own publishing rights to a lot of songs, but not that one.",
    "McCartney played an upright piano that was rigged to sound like a harpsichord.",
    "The Beatles could have used traditional background singers on this track, but instead they commandeered Pattie Harrison and Yoko Ono to sing the \"birthday\" line in the chorus, simulating the regular voices that would sing a birthday greeting. When Bob Rivers recorded a Christmas parody called \"Jesus's Birthday,\" he learned that professional background singers don't work on the song - he ended up getting his wife to sing on it.",
    "Paul Weller covered the song to celebrate McCartney turning 70. His version was made available for download on Sir Paul's actual birthday (June 18th, 2012) for one day only and it entered the UK Singles chart at #64. Proceeds from the cover went to the War Child charity.",
    "Paul played the lead guitar on this with John, as well as the piano, which was cleverly miked and fed into a Vox Defiant, a solid state amp, which featured a unique mid-range booster. You can hear the settings change throughout. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Eli - Melrose Park, PA\n                                                  \n                                                  "
  ],
  "lyrics": "You say it's your birthday\nIt's my birthday too, yeah\nThey say it's your birthday\nWe're gonna have a good time\nI'm glad it's your birthday\nHappy birthday to you\n\nYes we're going to a party party\nYes we're going to a party party\nYes we're going to a party party\n\nI would like you to dance, birthday\nTake a cha-cha-cha-chance, birthday\nI would like you to dance, birthday\nDance\n\nI would like you to dance, birthday\nTake a cha-cha-cha-chance, birthday\nI would like you to dance, birthday\nDance\n\nYou say it's your birthday\nWell it's my birthday too, yeah\nYou say it's your birthday\nWe're gonna have a good time\nI'm glad it's your birthday\nHappy birthday to you\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}