{
  "Artist": "The Beatles",
  "Album": "Magical Mystery Tour",
  "Title": "Blue Jay Way",
  "URL": "https://www.songfacts.com/facts/the-beatles/blue-jay-way",
  "Confidence": 1.0,
  "youtube-id": "Coz0TmK2ZIg",
  "facts": [
    "George Harrison wrote this in a house he rented in Los Angeles on a street named Blue Jay Way. He was waiting for his friend Derek Taylor when he came up with the song.",
    "Brian Kehew, who wrote the book Recording The Beatles: The Studio Equipment and Techniques Used to Create Their Classic Albums, tells us that \"Blue Jay Way\" is the most impressive Beatles song in terms of engineering. Says Brian: \"It has phasing, flanging, it has varied speed recording, it has tape echo. They put things through Leslies, they compressed and EQed things. It's really fascinating, and it has more stuff going on with it that's more detached from traditional classical recording or a Miles Davis record. It's more Beatles-y in that way. All the tricks that The Beatles had developed with compressing instruments and with EQing things in very strange ways are present on \"Blue Jay Way.\" \nMy favorite part of it, which is really a fascinating concept, they took the track, specifically with the vocals, and then mixed it. That mix was played backwards and recorded back into the record on the multi-track, but they played it through a Leslie speaker that's spinning in the room. So occasionally during the song you hear some backwards Leslied tracks, especially vocals, swirling in and out. It's the actual song playing backwards against itself through a Leslie and then fading up and down, which is a really creative and very strange idea. I've never heard of anyone else doing something like that.\"",
    "The line \"Don't Be Long\" is repeated 29 times.",
    "This was used in the Beatles movie Magical Mystery Tour.",
    "The vocals, organ, and drums were played on two tape machines slightly out of sync to get the phasing effect.",
    "When the ending is reversed, it sounds suspiciously like \"Paul is bloody.\" This added to the \"Paul is Dead\" hoax. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dominic - Pittsburgh, PA\n                                                  \n                                                  "
  ],
  "lyrics": "There's a fog upon L.A.\nAnd my friends have lost their way\nWe'll be over soon they said\nNow they've lost themselves instead\n\nPlease don't be long\nPlease don't you be very long\nPlease don't be long\nOr I may be asleep\n\nWell, it only goes to show\nAnd I told them where to go\nAsk a policeman on the street\nThere's so many there to meet\n\nPlease don't be long (don't be long)\nPlease don't you be very long (don't be long)\nPlease don't be long\nOr I may be asleep\n\nNow it's past my bed I know\nAnd I'd really like to go\nSoon will be the break of day\nSitting here in Blue Jay Way\n\nPlease don't be long (don't be long)\nPlease don't you be very long (don't be long)\nPlease don't be long\nOr I may be asleep\n\nPlease don't be long\nPlease don't you be very long\nPlease don't be long\n\nPlease don't be long\nPlease don't you be very long\nPlease don't be long\n\nPlease don't be long\nPlease don't you be very long\nPlease don't be long\n\nDon't be long, don't be long\nDon't be long, don't be long\nDon't be long, don't be long\nDon't be long\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "place": {
    "name": "Blue Jay Way, Hollywood, California",
    "facts": [
      "How did you think songs get written? Does the songwriter perch on his stool before his desk, fluffy feather quill in hand, beads of sweat dripping from his brow, until a light shines down from the heavens and a flock of cherubs descends and crowns the artist with his muse?",
      "Well,",
      "was written by George Harrison, who was sitting in his house at night waiting for his friend, who was lost. He was bored, he was sleepy, he wanted to stay awake until his friend arrived, so he plonked around with a Hammond organ",
      ", and he wrote a song.",
      "Imagine if we were all this creative. You could write a song about waiting in line at Starbucks:",
      "You could pick any minute of the day and put it to music and turn all that downtime into cash,",
      ", CASH! And haven't we seen that the more mundane a subject is, the more popular the song is?",
      "Anyway, Blue Jay Way is a real, actual street in West Hollywood, and if you look it up on a map, its one of the streets lost in the middle of a maze of winding, twisty roads snaking around the Hollywood Hills. The map looks like somebody threw a handful of spaghetti at the wall. Who wouldn't get lost in that? You could lose a minotaur in there! Let alone with the fog.",
      "To see the place today, it isn't really as impressive as you'd imagine to be the kind of place that a Beatle would be hanging out. It's just California-style crackerboxes all scattered around nose-to-butt with no place left to park and with smog so thick you could hang your coat in it. That's one of the things about Southern California is that there's never any sense of urban planning; streets simply appear and wander off like an ant leaving a trail, and the other ants follow because, why not? Sixty years later, they wonder why there's traffic. Anyway, since California real estate has taken such a hit from the housing crash, it could be the case that some Beatles fan could end up owning the place for chump change.",
      "The song itself is one of the moodiest, spookiest pieces the Beatles ever did. It has been compared to Pink Floyd. George the Mystic really lays on the psychedelic here. There's a drone bass, a raga harmony, flanging, and mixing with stereo and mono just a flicker out of step with each other. This produces a muddy, weary sound, as if the whole song were melting off the air and dripping down the walls. Light some incense and say your mantras."
    ]
  }
}