{
  "Artist": "The Beatles",
  "Album": "Please Please Me",
  "Title": "Boys",
  "URL": "https://www.songfacts.com/facts/the-beatles/boys",
  "Confidence": 1.0,
  "youtube-id": "h2t9DIh4kMA",
  "facts": [
    "This was originally recorded by The Shirelles, a popular female vocal quartet who were inducted into the Rock and Roll Hall of Fame in 1996. John Lennon was a big fan of the group.",
    "Pete Best sang lead on this during live appearances, until he was fired and replaced by Ringo Starr. The song served Ringo well: he often performed it in his post-Beatles career, including on the CBS special The Beatles: The Night That Changed America, which aired on February 9, 2014 in honor of the 50th anniversary of the group's famous Ed Sullivan Show appearance.",
    "Nine of the songs on Please Please Me, including this one, were recorded in one day so the Beatles could quickly issue the album to take advantage of their UK success. They filled the album with the singles they had released along with cover songs that were often part of their live show, which is how \"Boys\" made the cut. The budget for the album was £400 (about $800), with each Beatle receiving a union scale pay of 29 pounds. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "\"Boys\" was written by the songwriting team of Luther Dixon and Wes Farrell. Dixon was a member of the Brill Building club cranking out songs for \"girl groups\" at the height of their popularity, and also produced songs for Elvis, B. B. King, The Jackson 5, and other hit acts. Farrell had this song as an early break, but would go on to produce songs for the Partridge Family.",
    "Although the lyrics talk specifically about boys kissing girls, not each other, the issue of gender-flipped confusion did come up. McCartney told Rolling Stone in 2005, \"If you think about it, here's us doing a song and it was really a girls' song... Or it was a gay song. But we never even listened. It's just a great song. I think that's one of the things about youth - you just don't give a s--t. I love the innocence of those days.\"",
    "In the The Rolling Stone Illustrated History Of Rock & Roll, it is noted: \"The Boy is the central mythic figure in the lyrics of girl group rock. He is shadowy: the boy who'll love walking in the rain, the fine fine boy, the leader of the pack, the angel baby. He is irresistible - and almost never macho. He is sensitive. He must be pursued. How to reach him?\" In short, just about every girl group of the '60s consistently failed the Bechdel Test, as they were songs by women targeted to women while talking of nothing but men.",
    "At the 2015 Rock and Roll Hall of Fame induction ceremony, Ringo Starr and Green Day - who were each inducted at the event - took the stage to perform a rousing rendition of this song."
  ],
  "lyrics": "I been told when a boy kiss a girl\nTake a trip around the world\nHey, hey (bop shuop, m'bop bop shuop)\nHey, hey (bop shuop, m'bop bop shuop)\nHey, hey (bop shuop), yeah, she say ya do (bop shuop)\n\nMy girl says when I kiss her lips\nGets a thrill through her fingertips\nHey, hey (bop shuop, m'bop bop shuop)\nHey, hey (bop shuop, m'bop bop shuop)\nHey, hey (bop shuop), yeah, she say ya do (bop shuop)\n\nWell, I talk about boys (yeah, yeah, boys)\nDon't ya know I mean boys (yeah, yeah, boys)\nWell, I talk about boys, now (yeah, yeah, boys)\nAah, boys (yeah, yeah, boys)\nWell, I talk about boys, now (yeah, yeah, boys)\nWhat a bundle of joy! (yeah, yeah, boys)\n(Alright, George!)\n\nMy girl says when I kiss her lips\nGets a thrill through her fingertips\nHey, hey (bop shuop, m'bop bop shuop)\nHey, hey (bop shuop, m'bop bop shuop)\nHey, hey (bop shuop), yeah, she say ya do (bop shuop)\n\nWell, I talk about boys (yeah, yeah, boys)\nDon't ya know I mean boys (yeah, yeah, boys)\nWell, I talk about boys, now (yeah, yeah, boys)\nAah (yeah, yeah, boys)\nWell, I talk about boys, now (yeah, yeah, boys)\nWhat a bundle of joy! (yeah, yeah, boys)\n\nOh, oh, ah yeah boys (yeah, yeah, boys)\nDon't ya know I mean boys? (yeah, yeah, boys)\nOoh, boys (yeah, yeah, boys)\nAh ha (yeah, yeah, boys)\nWell, I talk about boys now\n                                                  \n                                                  Writer/s: Luther Dixon, Wes Farrell \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}