{
  "Artist": "The Beatles",
  "Album": "A Hard Day's Night",
  "Title": "Can't Buy Me Love",
  "URL": "https://www.songfacts.com/facts/the-beatles/cant-buy-me-love",
  "Confidence": 1.0,
  "youtube-id": "srwxJUXPHvE",
  "facts": [
    "Paul McCartney wrote this song. Despite rumors to the contrary, he claimed it was not about a prostitute. Rather, the song makes a simple yet profound statement on what matters most in life. The word \"Love\" appeared in many Beatles lyrics, especially in their early songs.",
    "This song was recorded on January 29, 1964 in Paris, although when The Beatles returned to Britain, George Harrison decided to overdub another lead guitar part in London. The original solo is still audible in the background. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mark - Rotterdam, Netherlands\n                                                  \n                                                  ",
    "This was one of the Beatles songs that held the top five positions on the US chart on April 4, 1964. The others were: \"Twist and Shout,\" \"She Loves You,\" \"I Want To Hold Your Hand,\" \"Please, Please Me.\" The week after it hit #1 in the US, The Beatles had 14 songs in the Billboard Hot 100. It's also the first song to hit #1 from outside the Top 20, something that didn't happen again until Billboard began using its \"Soundscan\" method of recording sales. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "This was one of the first pop songs to start with the chorus rather than a verse. That was producer George Martin's idea.",
    "Paul McCartney sang the lead vocal. It was one of the first Beatles songs where only one member of the group sang.",
    "\"Can't Buy Me Love\" was used as the title for a popcorn movie starring Patrick Dempsey in 1987. In the film, his character goes from \"totally geek to totally chic\" by paying a popular girl to pretend they are dating. Gerardo, who sang \"Rico Suave,\" was also in the movie.",
    "This was used in the first Beatles movie, A Hard Day's Night, which was re-released in 2000. It was used to replace \"I'll Cry Instead,\" which the film's director Dick Lester thought was an inappropriate song to use when the Beatles were to break out and have some fun.",
    "This replaced \"Roll Over Beethoven\"/\"Please Mr. Postman\" as the single to be released by Capitol Records USA in March 1964.",
    "In the first two takes of this song, John and George sang back up harmonies. Take four is the one they used. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "The jazz singer Ella Fitzgerald recorded this shortly after The Beatles version came out. Her version reached #34 in the UK, making her the first artist to chart with a Beatles cover (\"I Wanna Be Your Man\" was a hit for The Rolling Stones in 1963, but theirs was released before The Beatles version).",
    "Jim Carrey and Zooey Deschanel perform part of this song in the 2008 movie Yes Man."
  ],
  "lyrics": "Can't buy me love, love\nCan't buy me love\n\nI'll buy you a diamond ring, my friend\nIf it makes you feel all right\nI'll get you anything, my friend\nIf it makes you feel all right\n'Cause I don't care too much for money\nMoney can't buy me love\n\nI'll give you all I've got to give\nIf you say you love me, too\nI may not have a lot to give\nBut what I've got I'll give to you\nI don't care too much for money\nMoney can't buy me love\n\nCan't buy me love\nEverybody tells me so\nCan't buy me love\nNo, no, no, no\n\nSay you don't need no diamond rings\nAnd I'll be satisfied\nTell me that you want the kind of things\nThat money just can't buy\nI don't care too much for money\nMoney can't buy me love\n\nCan't buy me love\nEverybody tells me so\nCan't buy me love\nNo, no, no, no\n\nSay you don't need no diamond rings\nAnd I'll be satisfied\nTell me that you want the kind of things\nThat money just can't buy\nI don't care too much for money\nMoney can't buy me love\nCan't buy me love, love\nCan't buy me love, oh\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}