{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Carry That Weight",
  "URL": "https://www.songfacts.com/facts/the-beatles/carry-that-weight",
  "Confidence": 1.0,
  "youtube-id": "6B224XDJw6g",
  "facts": [
    "Paul McCartney wrote this about his struggle to keep the Beatles together after Brian Epstein's death. Epstein was their manager and handled their business affairs, but he became overwhelmed by the success of The Beatles and died from a sleeping pill overdose in 1967. McCartney took over most of The Beatles' business affairs, and gained a greater respect for what Epstein went through.\nAlong with their other turmoil at the time, McCartney told Barry Miles in an interview that the emotional weight of this song also came from too many drug issues with the group, and they were having difficulties with their new manager Allen Klein. Apple Corps (no relation to the computer company) was already in dire financial straights by the time Klein took the helm. Doubtless, there was a bit of nostalgia for the time when they were four carefree mop-tops from Liverpool who could just have fun being a band without a care in the world.\nAnother cause of strife between McCartney and manager Klein was when he brought in Phil Spector to work on the Let It Be sessions. As has been noted in many places, not the least of which his murder trial, Spector tended to rub people the wrong way.",
    "This was recorded as one song with \"Golden Slumbers.\" It is part of a suite of songs at the end of Abbey Road made up of bits of unfinished songs strung together.",
    "All four Beatles sang in the chorus. It's one of the few Beatles tracks where they all provide vocal harmony. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The orchestral backup, comprised of session musicians, includes 12 violins, four violas, four cellos, four horns, three trumpets, a double bass, a trombone, and a bass trombone.",
    "\"Carry That Weight\" has an inserted verse of \"You Never Give Me Your Money.\" It's Paul singing solo, but double-tracked to give it harmony. And cryptic, enigmatic lyrics that nevertheless manage to evoke sadness."
  ],
  "lyrics": "Boy, you gotta carry that weight\nCarry that weight a long time\nBoy, you gonna carry that weight\nCarry that weight a long time\n\nI never give you my pillow\nI only send you my invitation\nAnd in the middle of the celebrations\nI break down\n\nBoy, you gotta carry that weight\nCarry that weight a long time\nBoy, you gotta carry that weight\nYou're gonna carry that weight along time\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}