{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Come Together",
  "URL": "https://www.songfacts.com/facts/the-beatles/come-together",
  "Confidence": 1.0,
  "youtube-id": "45cYwDMibGo",
  "facts": [
    "Timothy Leary was a psychologist who became famous for experimenting with LSD as a way to promote social interaction and raise consciousness. Leary did many experiments on volunteers and himself and felt the drug had many positive qualities if taken correctly. When the government cracked down on LSD, Leary's experiments were stopped and he was arrested on drug charges. In 1969, Leary decided to run for Governor of California, and asked John Lennon to write a song for him. \"Come Together, Join The Party\" was Leary's campaign slogan (a reference to the drug culture he supported) and was the original title of the song. Leary never had much of a campaign, but the slogan gave Lennon the idea for this song.",
    "After Timothy Leary decided against using this song for his political campaign Lennon added some nonsense lyrics and brought it to the Abbey Road sessions. Paul McCartney recalled in Rolling Stone magazine's 500 Greatest Songs: \"I said, 'Let's slow it down with a swampy bass-and-drums vibe.' I came up with a bass line, and it all flowed from there.\"",
    "In a 1980 interview with Playboy magazine, John Lennon said: \"The thing was created in the studio. It's gobbledygook. 'Come Together' was an expression that Tim Leary had come up with for (perhaps for the governorship of California against Reagan), and he asked me to write a campaign song. I tried and I tried, but I couldn't come up with one. But I came up with this, 'Come Together,' which would've been no good to him - you couldn't have a campaign song like that, right?\"",
    "John Lennon was sued for stealing the guitar riff and the line \"Here comes old flat-top\" from Chuck Berry's \"You Can't Catch Me.\" The lawsuit did not come from Berry, but from Morris Levy, one of the music industry's most infamous characters (see our interview with Tommy James for more on Levy). He owned the song along with thousands of other early rock songs that he obtained from many poor, black, and unrepresented artists. Levy sued the Beatles, or more accurately, John Lennon, over the song around the time the Beatles broke up.\nFor years, Lennon delayed the trial while he and the Beatles tried to sort out all the legal and business problems that plagued Apple Records. Finally, in an attempt to avoid the court room as much as he could (Lennon felt like he was appearing in court more often than not), he settled with Levy. Lennon agreed to record his Rock N Roll album, which was just a series of cover songs, including three songs Levy owned (including \"You Can't Catch Me\") on the tracklist.\nThe deal made sense: Lennon always wanted to make a covers album, and Levy wanted the value of his songs to increase (when a Beatle re-records a song, that is just what happens). To make a long long long story short, Lennon recorded the album over the Lost Weekend, a year-or-two period when he was separated from Yoko Ono and lived in Los Angeles. During that time he was often drunk or high, and was rather sloppy and useless. Levy was getting frustrated with the lack of progress. Phil Spector was the producer, but in a fit of madness (which was not too unusual for Spector) he ran away and stole the recording session tapes. Levy invited Lennon to his upstate New York recording studio, and that is where he finally recorded the album, which ended up with only two Levy songs: \"You Can't Catch Me\" and \"Ya Ya.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Matthew - New York, NY\n                                                  \n                                                  ",
    "The whispered lyric that sounds like \"shoot\" is actually Lennon saying \"shoot me\" followed by a handclap. The bass line drowns out the \"me.\"",
    "The Beatles recorded this on July 21, 1969 and it was the first session John Lennon actively participated in following his and Yoko's car accident 3 weeks earlier. John was so insistent on Yoko being in the studio with him that he had a hospital bed set up in the studio for her right after the accident, since she was more seriously injured than he was. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "The line \"Ono sideboard\" refers to Yoko.",
    "The British Broadcasting Company (The BBC) banned this because of the reference to Coca Cola, which they considered advertising.",
    "This has one of the most commonly misheard lyrics in the history of popular music: \"Hold you in his -armchair- you can feel his disease.\" It's actually \"Hold you in his arms, yeah, you can feel his disease.\" All published sheet music had the \"armchair\" lyric, including the inner sleeve of the 1967-1970 compilation, which contained lots of other errors too, notably on \"Strawberry Fields Forever.\" After John heard that his lyric was incorrect in the sheet music and other folios, he decided he liked \"armchair\" better and kept it. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mark - London, England\n                                                  \n                                                  ",
    "The Beatles released this as a \"double A side\" single with \"Something.\"",
    "In 1969, this won a Grammy for best engineered recording.",
    "When rumors were spreading that Paul McCartney was dead, some fans thought the line \"One and one and one is three\" meant that only George, John and Ringo were left. The line \"Got to be good lookin' cuz he's so hard to see\" was supposed to be Paul's spirit. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n jill - placentia, CA\n                                                  \n                                                  ",
    "A rotary phone was used to make the sound heard before each verse and after the chorus. The sound was accompanied by the bass Paul played. Kids, ask your parents or grandparents what a rotary phone was. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Patrick - Tallapoosa, GA\n                                                  \n                                                  ",
    "Aerosmith recorded this song with Beatles producer George Martin for the 1978 movie Sgt. Pepper's Lonely Hearts Club Band, which turned out to be one of the worst films ever made. Aerosmith appeared in the film performing this song (as the Future Villain Band), agreeing to the role only because they couldn't resist the chance to record a Beatles song with George Martin. They weren't the only big names in the film - Peter Frampton and The Bee Gees were also in it.\nThe Aerosmith version of \"Come Together\" made #23 in the US when it was released as a single. When we asked their guitarist Brad Whitford why some folks prefer the Aerosmith version, he replied, \"I've actually never heard anybody say that.\" Whitford added, \"But you know, it's funny, I hear our version more on the radio than I do The Beatles' version.\"",
    "In 2001, Beck, Moby, Marc Anthony, and Nelly Furtado were scheduled to put on a tribute concert in Radio City Music Hall called \"Come Together: A Night For John Lennon.\" Due to the terrorist attacks on America, it was postponed and dedicated to the people of New York City, with proceeds benefiting victims of the attacks.",
    "Nortel used this in commercials, as did Macy's.",
    "On an early demo version of \"My Monkey\" by Marilyn Manson (whose vocals were sped up to sound like \"a demonic toddler\"), Manson sang the second verse as an opener. It appeared on Demos in Lunchbox by Manson's former band, The Spooky Kids.",
    "This has been covered by Michael Jackson, Tina Turner, Meat Loaf, Guns N' Roses, Soundgarden, Marilyn Manson, Nazareth, and Oasis. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Brett - Edmonton, Canada, for above 2\n                                                  \n                                                  ",
    "Though Ringo is best known for playing on Oyster Black Pearl Ludwig drum kit, he used for this his Ludwig \"Hollywood\" maple-finish equipment, with a 22\" kick. Starr produced his distinctive late '60s drum muffling sound on tracks like this by wrapping tea towels (dishtowels) around his snares and toms.",
    "The Arctic Monkeys performed the song during the London 2012 Olympic Games opening ceremony. Their version reached #21 on the UK singles chart in the week after the event.",
    "On October 7, 2016, The Rolling Stones covered this song during their headline set at the Desert Trip festival in Indio, California. Before launching into the tune, Mick Jagger told the crowd: \"We're gonna do a cover song of a sort of unknown beat group. I think you might remember [them], we're gonna try a cover of one of their tunes.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "Here come old flat top\nHe come groovin' up slowly\nHe got joo joo eyeballs\nHe one holy roller\nHe got hair down to his knee\nGot to be a joker\nHe just do what he please\n\nHe wear no shoeshine\nHe got toe jam football\nHe got monkey finger\nHe shoot Coca-Cola\nHe say I know you, you know me\nOne thing I can tell you is\nYou got to be free\nCome together, right now\nOver me\n\nHe bad production\nHe got walrus gumboot\nHe got Ono sideboard\nHe one spinal cracker\nHe got feet down below his knee\nHold you in his armchair\nYou can feel his disease\nCome together, right now\nOver me\n\nHe roller coaster\nHe got early warning\nHe got muddy water\nHe one Mojo filter\nHe say one and one and one is three\nGot to be good looking\n'Cause he's so hard to see\nCome together right now\nOver me\n\nCome together, yeah\nCome together, yeah\nCome together, yeah\nCome together, yeah\nCome together, yeah\nCome together, yeah\nCome together, yeah\nCome together, yeah\nCome together, yeah\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}