{
  "Artist": "The Beatles",
  "Album": "CD2 - The Beatles",
  "Title": "Cry Baby Cry",
  "URL": "https://www.songfacts.com/facts/the-beatles/cry-baby-cry",
  "Confidence": 1.0,
  "youtube-id": "NG4-cIxICKE",
  "facts": [
    "The lyrics were inspired by nursery rhymes and the songs Donovan was writing: Donovan's songs were \"fairy tale\" like. Donovan states, \"I think the eventual imagery was suggested by my own songs of fairy tales. We had become very close in exchanging musical vibes.\" The song was based in part by two nursery rhymes, \"Sing A Song Of Sixpence\" and \"Cry, baby, cry...stick a finger in your eye...etc.\"",
    "John Lennon said he got the title for the song from an advertisement. The original line from that advertisement was, \"Cry, baby cry. Make your mother buy.\" John told Hunter Davies (the Beatles official biographer) \"I've got another (song) here, a few words, I think I got them from an advert - 'Cry baby cry, Make your mother buy.' I've been playing it over on the piano. I've let it go now. It'll come back if I really want it.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "At the very end of the song, there is a conversation between George Martin and Alistair Taylor. Here is what's said:\nAlistair Taylor: \"Bottle of claret for you if I'd realized. I'd forgotten all about it George, I'm sorry...\"\nGeorge Martin: \"Well, do next time.\"\nAlistair: \"Will you forgive me?\"\nGeorge: \"Mmmm...yes...\"\nAlistair: \"cheeky bitch.\"",
    "This is one of the songs begun in Rishikesh, India when the Beatles were staying with the Maharishi Mahesh Yogi.",
    "In the song, John mentions the \"Duchess of Kircaldy.\" Kircaldy is in Fife, Scotland and when he was young, Kircaldy was a stop that John always made when in route to visit his relations in Durness. The Beatles also performed in Kircaldy in their early years."
  ],
  "lyrics": "Cry baby cry\nMake your mother sigh\nShe's old enough to know better.\n\nThe King of Marigold was in the kitchen\nCooking breakfast for the Queen\nThe Queen was in the parlor\nPlaying piano for the children of the King.\n\nCry baby cry\nMake your mother sigh\nShe's old enough to know better.\nSo cry baby cry.\n\nThe King was in the garden\nPicking flowers for a friend who came to play\nThe Queen was in the playroom\nPainting pictures for the children's holiday.\n\nCry baby cry\nMake your mother sigh\nShe's old enough to know better.\nSo cry baby cry.\n\nThe Dutchess of Kircaldy always smiling\nAnd arriving late for tea\nThe Duke was having problems\nWith a message at the local Bird and Bee.\n\nCry baby cry\nMake your mother sigh\nShe's old enough to know better.\nSo cry baby cry.\n\nAt twelve o'clock a meeting round the table\nFor a seance in the dark\nWith voices out of nowhere\nPut on specially by the children for a lark.\n\nCry baby cry\nMake your mother sigh\nShe's old enough to know better.\nSo cry baby cry cry cry cry baby\nMake your mother sigh.\n\nShe's old enough to know better\nCry baby cry\nCry cry cry\nMake your mother sigh\nShe's old enough to know better.\nSo cry baby cry.\n                                                  \n                                                  Writer/s: JOHN LENNON, PAUL MCCARTNEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}