{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "Dear Prudence",
  "URL": "https://www.songfacts.com/facts/the-beatles/dear-prudence",
  "Confidence": 1.0,
  "youtube-id": "IUKYiQCB7ss",
  "facts": [
    "While Mia Farrow inspired such men as Andre Previn, Frank Sinatra and Woody Allen, her sister Prudence left her mark on John Lennon. According to Nancy de Herrera's book, All You Need Is Love, Prudence met The Beatles on a spiritual retreat with their guru, Maharishi Mahesh Yogi, in India, which she attended with Mia. When Prudence, suffering depression, confined herself to her room, Lennon wrote this song hoping to cheer her up. It did.\nAccording to American flautist Paul Horn, who was also with them in Rishikesh, Prudence was a highly sensitive person, and by jumping straight into deep meditation, against the Maharishi's advice, she had allowed herself to fall into a catatonic state. Horn stated, \"She was ashen-white and didn't recognize anybody. She didn't even recognize her own brother who was on the course with her. The only person she showed any slight recognition towards was Maharishi. We were all concerned about her and Maharishi assigned her a full-time nurse.\"",
    "Prudence Farrow wanted to \"Teach God quicker than anyone else,\" according to John Lennon. She would lock herself in her room trying to meditate for hours and hours. From A Hard Day's Write, by Steve Turner: \"At the end of the demo version of Dear Prudence John continues playing guitar and says: 'No one was to know that sooner or later she was to go completely berserk, under the care of Maharishi Mahesh Yogi. All the people around were very worried about the girl because she was going insane. So, we sang to her.'\"\nPrudence Farrow explained years later that she was just trying to take Transcendental Meditation seriously. She said in Mojo magazine, September 2008: \"They were trying to be cheerful, but I wished they'd go away. I don't think they realized what the training was all about.\"",
    "Ringo had left the group as the White Album sessions got very tense, so Paul McCartney played drums. When Ringo came back a short time later, there were flowers on his drum kit welcoming him back.",
    "According to the singer-songwriter Donovan, who was on the retreat in India with The Beatles, he taught John Lennon a \"clawhammer\" guitar technique that he used on this track. \"He was so fascinated by fingerstyle guitar that he immediately started to write in a different color and was very inspired,\" Donovan said in his Songfacts interview. \"That's what happens when you learn a new style.\"\nThe clawhammer style, is played with the strumming hand formed into a claw, using the backs of the fingernails to strum down on the strings.",
    "John Lennon's handwritten lyrics were auctioned off for $19,500 in 1987.",
    "Lennon considered this one of his favorites.",
    "Siouxsie And The Banshees covered this in 1983. Their version went to #3 in the UK and became their biggest hit.\n\"Dear Prudence\" was the second Beatles song that the Banshees had covered from their White Album. Previously, they'd recorded a version of \"Helter Skelter\" for their 1978 LP The Scream.\n\"Helter Skelter was very much part of our live show before we recorded it,\" mused Siouxsie Sioux to TeamRock. \"The great thing was that the two Beatles songs we chose – 'Helter Skelter' and 'Dear Prudence' – were not originally singles by The Beatles, so it wasn't necessarily a surefire: 'Oh, they're doing a Beatles song.' And it was also a bit irreverent as well, I suppose. A good test of doing a cover version is when people think that you've written it. Quite a lot of people thought Dear Prudence was an original.\"",
    "This song was in the movie Across the Universe, which was based on The Beatles music. In the movie, Prudence (played by T.V. Carpio) locked herself in a closet after discovering that Sadie and JoJo were together when she thought she loved Sadie. Lucy (Evan Rachel Wood), Jude (Jim Sturges), Sadie (Dana Fuges) and Max (Joe Anderson) sing this to make her feel better. It gets her out of the closet and they end the song at a anti-Vietnam War rally. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Breanna - Henderson, NV\n                                                  \n                                                  ",
    "Siouxsie and the Banshees' take on the song added to The Beatles' simple original arrangement. \"It was kind of an undeveloped song on the White Album,\" Siouxsie said. \"and so there was a lot of scope to put in your own stuff, really. What did I want to bring? Oh, some psychedelic transformation there [laughing].\"\n\"No, I think that actual track's fairly restrained, simple and understated on the White Album,\" she added. \"I was listening to singles like Itchycoo Park by the Small Faces, so I think it was wanting to capture the 60s, and all that kind of phasing. Also, it was where we were at the time.\""
  ],
  "lyrics": "Dear Prudence, won't you come out to play?\nDear Prudence, greet the brand new day\nThe sun is up, the sky is blue\nIt's beautiful and so are you\nDear Prudence, won't you come out to play?\n\nDear Prudence, open up your eyes\nDear Prudence, see the sunny skies\nThe wind is low, the birds will sing\nThat you are part of everything\nDear Prudence, won't you open up your eyes?\n\nLook around, round (round, round, round)\n(Round, round, round, round, round)\nLook around, round, round (round, round)\n(Round, round, round, round, round)\nLook around\n\nDear Prudence, let me see you smile\nDear Prudence, like a little child\nThe clouds will be a daisy chain\nSo let me see you smile again\nDear Prudence, won't you let me see you smile?\n\nDear Prudence, won't you come out to play\nDear Prudence, greet the brand new day\nThe sun is up, the sky is blue\nIt's beautiful and so are you\nDear Prudence, won't you come out to play?\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}