{
  "Artist": "The Beatles",
  "Album": "Let It Be",
  "Title": "Dig It",
  "URL": "https://www.songfacts.com/facts/the-beatles/dig-it",
  "Confidence": 1.0,
  "youtube-id": "A5Kg_c_A-yU",
  "facts": [
    "\"Dig It\" was taken from a 12-minute improvised jam session in the studio. The Beatles were planning to record the album in front of a live TV audience, with another TV special made about how the album was made. When George Harrison protested, plans for the live show were scrapped and the album was assembled from various sessions. Phil Spector was brought in to work with the tapes, and the album was finally released about a year after it was recorded.",
    "The Beatles were constantly using the phrase \"Dig it\" at this time.",
    "This appears in the Beatles movie Let It Be, which was the result of footage shot for what was going to be the TV special.",
    "This song did not age very well, and was left off the album when Apple records released Let It Be... Naked, a version of the album without Phil Spector's orchestrations. That album came out in 2003.",
    "Billy Preston played the organ. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The original title was \"Can You Dig It,\" which John says at the end (spliced in from an earlier session) when he says \"That was 'Can You Dig It' by Georgie Wood. And now we'd like to do 'Hark The Angels Come.'\" Incidentally, George Wood was the name of the man who bought John's childhood home Mendips from his Auntie Mimi. It was also the name of a British child star."
  ],
  "lyrics": "Like a rolling stone\nA like a rolling stone\nLike the FBI and the CIA\nAnd the BBC, BB King\nAnd Doris Day\nMatt Busby\nDig it, dig it, dig it\nDig it, dig it, dig it, dig it, dig it, dig it, dig it, dig it\n\n\"That was 'Can You Dig It' by Georgie Wood.\nAnd now we'd like to do 'Hark The Angels Come'.\"\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney, George Harrison, Richard Starkey \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, CONCORD MUSIC PUBLISHING LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}