{
  "Artist": "The Beatles",
  "Album": "Let It Be",
  "Title": "Dig a Pony",
  "URL": "https://www.songfacts.com/facts/the-beatles/dig-a-pony",
  "Confidence": 1.0,
  "youtube-id": "TiciTBTvFMo",
  "facts": [
    "John Lennon would often string words together to create nonsensical phrases for his lyrics - the best example is \"I Am The Walrus.\" Listeners could often discern hidden meaning in his words, even when there was none, which rather amused him.\n\"Dig A Pony\" is in this tradition, with lines line \"I do a road hog\" and \"you can syndicate any boat you row.\" Of course, fans formed their own interpretations, including one young man who was found hiding on the property surrounding Tittenhurst, Lennon's home in Ascot, England. In the 1988 film Imagine: John Lennon, we see this fellow asking what's really behind \"Dig A Pony\"; Lennon assures him that the song refers to no specific person and that the lyrics are \"nonsense,\" a lyrical technique he also attributes to unspecified Bob Dylan songs. John stated in 1969 about this song, \"I just make it up as I go along.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Nick - La Crosse, WI\n                                                  \n                                                  ",
    "The Beatles recorded this on the Apple Records rooftop on the afternoon of January 30, 1969. It appears in rooftop sequence of the movie Let It Be. This was their first live performance since they stopped touring in 1965.",
    "There is a false start in this song that was caused by Ringo, as you can see Lennon looking back at him to make sure he's ready before they start again. What caused the hiccup is unclear: if you watch the clip, just as they are getting ready to count into the song, you see Ringo blowing smoke out of his mouth. There is a hesitation and you see him bending over, but it looks like he's already put his cigarette down prior to that.",
    "The working title of this song was \"Con A Lowry.\" Lennon changed it because, \"'I con a Lowry' didn't sing well... it's got to be d's and p's you know.\"",
    "Lennon wrote this as two songs: \"All I Want Is You\" and \"Dig a Pony.\" In the original pressings of the Let It Be LP, it's listed as \"All I Want Is You.\"",
    "The original version, which can be heard on the Anthology 3 compilation, opens with the line \"All I want is\" and ends with \"All I want is you.\" Phil Spector cut these lines out when he produced the song for Let It Be. The unedited version also appears in the movie.",
    "This song was listed as \"I Dig A Pony\" on the album (though that error was corrected for the CD). Some people thought that the line \"Hi, hi hi, hi hiyeeee.... dig a pony\" was \"I, I, I, I Iyeeeeeeeee.... dig a pony.\" You can still find tabs online for \"I Dig A Pony.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Loretta - Liverpool, England\n                                                  \n                                                  ",
    "The line \"I do a road hot\" was originally \"I dig a skylight\" and then \"I did a groundhog.\""
  ],
  "lyrics": "I dig a pony\nWell, you can celebrate anything you want\nYes, you can celebrate anything you want\nOh\n\nI do a road hog\nWell, you can penetrate any place you go\nYes, you can penetrate any place you go\nI told you so\n\nAll I want is you\nEverything has got to be just like you want it to\nBecause\n\nI pick a moon dog\nWell, you can radiate everything you are\nYes, you can radiate everything you are\nOh now\n\nI roll a stoney\nWell, you can imitate everyone you know\nYes, you can imitate everyone you know\nI told you so\n\nAll I want is you\nEverything has got to be just like you want it to\nBecause (woo)\n\nOh now\nI feel the wind blow\nWell, you can indicate everything you see\nYes, you can indicate everything you see\nOh now\n\nI load a lorry\nWell, you can syndicate any boat you row\nYeah, you can syndicate any boat you row\nI told you so\n\nAll I want is you\nEverything has got to be just like you want it to\nBecause\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}