{
  "Artist": "The Beatles",
  "Album": "Please Please Me",
  "Title": "Do You Want To Know A Secret",
  "URL": "https://www.songfacts.com/facts/the-beatles/do-you-want-to-know-a-secret",
  "Confidence": 1.0,
  "youtube-id": "3T7iFfkX_nA",
  "facts": [
    "John Lennon claimed this song came to him based on the tune \"I'm Wishing\" that his mother used to sing him from the Disney movie Snow White. In the beginning of the Disney song, Snow White is singing to the doves, \"Wanna know a secret? Promise not to tell? We are standing by a wishing well.\"",
    "John Lennon and Paul McCartney wrote this song, but George Harrison sang lead. It's one of the few Beatles songs not sung by the person who wrote it.",
    "This was the first Lennon/McCartney song to be a hit for another artist - it was recorded by Billy J. Kramer with the Dakotas. Their version was #1 in the UK for two weeks.",
    "The Beatles were very close to a record deal, and John Lennon wanted to marry. Their manager, Brian Epstein, was very upset, as he had been pitching the boys as four good-looking single chaps from England. Lennon could not be talked out of the wedding, so Epstein made him a deal. As the two could not afford a honeymoon, and did not have a place of their own, he would let them use his flat for two weeks, with the promise that they not tell anyone they were married. In the flat on their honeymoon, for obvious reasons, John wrote \"Listen, do you want to know a secret?\" John has said that the secret in question wasn't necessarily that he was married, but that he finally realized he was actually in love. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ken - Hartland, MI\n                                                  \n                                                  ",
    "Lennon said in interviews in 1971 and 1980 that he wrote this song in time for his wedding in August 1962. Most Beatles tracks were credited to Lennon/McCartney, and while the band was together, they rarely discussed who actually wrote what songs, so it wasn't until after their breakup that Lennon revealed he was the composer of this song. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli - Stockholm\n                                                  \n                                                  ",
    "George Harrison said in Musician magazine that the musical inspiration for the song came from \"I Really Love You\" by the group The Stereos.",
    "In the UK, this first appeared on The Beatles' debut album Please Please Me on March 22, 1963, and wasn't released as a single. In America, it was released as a single on March 23, 1964, during the height of Beatlemania. It climbed to #2 on May 9, held off the top by another Beatles song, \"Can't Buy Me Love.\""
  ],
  "lyrics": "You'll never know how much I really love you\nYou'll never know how much I really care\n\nListen, do you want to know a secret?\nDo you promise not to tell?\nWhoa-oh-oh, closer\nLet me whisper in your ear\nSay the words you long to hear\nI'm in love with you, ooh\n\nListen (doo da do), do you want to know a secret? (doo da do)\nDo you promise not to tell? (doo da do)\nWhoa-oh-oh, closer (doo da do)\nLet me whisper in your ear (doo da do)\nSay the words you long to hear\nI'm in love with you, ooh\n\nI've known a secret for a week or two\nNobody knows, just we two\n\nListen (doo da do), do you want to know a secret? (doo da do)\nDo you promise not to tell? (doo da do)\nWhoa-oh-oh, closer (doo da do)\nLet me whisper in your ear (doo da do)\nSay the words you long to hear\nI'm in love with you, ooh, ooh, ooh\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}