{
  "Artist": "The Beatles",
  "Album": "Revolver",
  "Title": "Doctor Robert",
  "URL": "https://www.songfacts.com/facts/the-beatles/doctor-robert",
  "Confidence": 1.0,
  "youtube-id": "niuNlPo1q9M",
  "facts": [
    "This is about Doctor Robert Freymann, a \"Speed Doctor\" in New York who supplied many celebrities, including The Beatles, with drugs. Reportedly, Dr. Freymann, who died in 1987, treated patients with injects of amphetamine-spiked vitamin B-12 from his Manhattan East 78th Street clinic. It should be noted that most Americans, due to diet and convenience culture, suffer from a vitamin B deficiency, and so an infusion of B vitamins feels like a \"pick me up\" all by itself, which is why many popular \"energy drinks\" (Red Bull, Monster, etc.) have this in the ingredients.",
    "The Beatles recorded this on Sunday, April 17, 1966. Two days later, they chose Take 7 to overdub all the vocals. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ben - Cheverly, MD\n                                                  \n                                                  ",
    "John Lennon did indeed peg this song as autobiographical, stating in interviews that he was the one who carried a pocket full of pills on tour. However, both he and Paul McCartney deny going to this specific doctor, but say that this song was kind of a piss-take at the idea, which struck them as funny.",
    "John's vocals are double-tracked and then split into two slightly out-of-phase stereo channels to simulate a trip on drugs. Also, the pivot to the key of B during the bridge gives a sudden blissful shot to the song.",
    "American copies of Revolver didn't include \"Doctor Robert,\" \"I'm Only Sleeping\" or \"And Your Bird Can Sing,\" but these three songs appeared two months earlier in that country on the Yesterday and Today album."
  ],
  "lyrics": "Ring, my friend I said you'd call \nDoctor Robert \nDay or night he'll be there any time at all \nDoctor Robert \n\nDoctor Robert \nYou're a new and better man \nHe help you to understand \nHe does everything he can \nDoctor Robert \n\nIf you're down he'll pick you up \nDoctor Robert \nTake a drink from his special cup \nDoctor Robert \n\nDoctor Robert \nHe's a man you must believe \nHelping anyone in need \nNo one can succeed like \nDoctor Robert \n\nWell, well, well, you're feeling fine \nWell, well, well, he'll make you \nDoctor Robert \n\nMy friend works for the National Health \nDoctor Robert \nDon't pay money just to see yourself \nDoctor Robert \n\nDoctor Robert \nYou're a new and better man \nHe help you to understand \nHe does everything he can \nDoctor Robert \n\nWell, well, well, you're feeling fine \nWell, well, well, he'll make you \nDoctor Robert \n\nRing, my friend I said you'd call \nDoctor Robert \nDoctor Robert\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}