{
  "Artist": "The Beatles",
  "Album": "With the Beatles",
  "Title": "Don't Bother Me",
  "URL": "https://www.songfacts.com/facts/the-beatles/dont-bother-me",
  "Confidence": 1.0,
  "youtube-id": "z02oTI__0Mo",
  "facts": [
    "\"Don't Bother Me\" was the first song George Harrison wrote, and his first song to be recorded. His older bandmates John Lennon and Paul McCartney had been writing all the group's material, so it took him a while to pluck up the courage to write one himself. When he did, it was up to form and released as track 4 on With The Beatles, their second UK album (in America, it was the first song on side 2 of Meet The Beatles, their first album released in there).\nHarrison never regarded this song very highly, possibly because he was holding it to the standards of Lennon-McCartney material, but it's well regarded by fans and shows that Harrison had the goods as a songwriter. He explained: \"I don't think it's a particularly good song... It mightn't even be a song at all, but at least it showed me that all I needed to do was keep on writing, and then maybe eventually I would write something good.\"\nA Harrison-penned song would not appear again until the 1965 album Help!. That would be \"You Know What To Do.\"",
    "Harrison wrote this song in August 1963 when he was down with the flu, resting in a hotel room in Bournemouth, in the south of England. The Beatles were playing a week of shows at the Gaumont Cinema, so when Harrison fell ill, he stayed in bed all day to save his energy for the shows at night. A doctor gave him medicine with morphine in it, which was common at the time.\n\"I was taking that stuff and in bed, all feeling weak and tired but trying to reserve my energy so I could get out of bed each night to do the concert,\" he told Timothy White in 1992. \"So it was the first thing I thought of, really as a lyric. And I never really thought it was a great song. I was quite happy that I had written it, because that was the thing. I just thought, 'I'm going to see if I can write a song because they're writing them.'\"",
    "This song has a darker, more pessimistic mood that was uncommon of The Beatles main sound, but would come to be Harrison's trademark stamp. This is actually part of what made the Beatles' formula work: McCartney was the chirpy, positive one, and Harrison was the melancholic counterpart.",
    "Like most Beatles songs at this time, this one is about a girl. In the song, Harrison sings from the perspective of a guy whose girl has left him and is in no mood for visitors.",
    "This song in its very earliest stages is available on a bootleg recording where Harrison is heard working out the music and lyrics as he goes along. This recording came from the Beatles' chauffeur, Alf Bicknell, who kept various tapes the band was working on. Years later these were sold off at one of the London auction houses.",
    "George Harrison may have thought very little of this song, but his friend Tom Petty didn't share this sentiment. \"I thought it was just the coolest song, like nothing I'd heard in rock,\" Petty told Rolling Stone in 2014. \"I'd say, 'Well, I like it. A lot. If you did that today, I'd say it was really good.' And he'd go, 'Well, you'd be wrong.'\"",
    "The photography technique for the cover of With The Beatles, in which the Fab Four's headshots hover in a half-moon, light-and-shadow effect, is called \"chiaroscuro.\" It's an Italian word to describe the Renaissance technique of dramatically contrasted lighting effects in oil paintings."
  ],
  "lyrics": "Since she's been gone I want no one to talk to me\nIt's not the same but I'm to blame, it's plain to see\n\nSo go away, leave me alone, don't bother me\nI can't believe that she would leave me on my own\nIt's just not right when every night I'm all alone\n\nI've got no time for you right now, don't bother me\nI know I'll never be the same if I don't get her back again\nBecause I know she'll always be the only girl for me\n\nBut 'til she's here please don't come near, just stay away\nI'll let you know when she's come home\nUntil that day\nDon't come around, leave me alone, don't bother me\n\nI've got no time for you right now, don't bother me\nI know I'll never be the same if I don't get her back again\nBecause I know she'll always be the only girl for me\n\nBut 'til she's here please don't come near, just stay away\nI'll let you know when she's come home\nUntil that day\n\nDon't come around, leave me alone, don't bother me\nDon't bother me\nDon't bother me\nDon't bother me\nDon't bother me\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: Universal Music Publishing Group, BMG Rights Management, Peermusic Publishing, Roba Music Verlag GMBH\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}