{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "Drive My Car",
  "URL": "https://www.songfacts.com/facts/the-beatles/drive-my-car",
  "Confidence": 1.0,
  "youtube-id": "DcQDqZIN09I",
  "facts": [
    "Laden with sexual innuendo, this song is about a guy who meets an aspiring actress, who tells him he can \"drive my car,\" as she has a keen interest in him, and might even be in love.\nShe keeps trying to lure him in (\"I can show you a better time\"), but when he finally agrees to take the job, she admits that she doesn't have a car, but still wants him to be her driver. It's pretty clear that all this driving talk is leading to sex, but there's no proof that it isn't just a song about a guy, a girl, and a car - making it another radio-friendly Beatles track.",
    "By this time, John Lennon and Paul McCartney were writing more songs separately, but this one was an equal collaboration, with Lennon writing most of the lyrics and McCartney coming up with the melody.\nOriginally, it was a very different song lyrically, with the chorus, \"I can give you golden rings, I can give you anything, baby, I love you.\" Knowing that storyline would lead them nowhere good, they hashed it out until they came up with \"Drive My Car\" for the title, and changed the song so it was the woman soliciting the man.",
    "Paul McCartney played bass, piano and lead guitar on this one; George Harrison played guitar and did backing vocals. John Lennon sang lead with McCartney and also played tambourine.",
    "The \"beep beep\" refrain is a take-off on The Beatles own \"yeah, yeah yeah\"s in \"She Loves You\" as well as a nod to The Playmates song \"Beep Beep\" (a #4 US novelty hit in 1958).",
    "Paul McCartney played this at halftime of the 2005 Super Bowl. The year before, Janet Jackson exposed a breast on live TV, which caused a great deal of controversy. McCartney was a solid choice because he was unlikely to offend anyone.",
    "At the 2005 Live 8 Concert in London, McCartney performed this in a duet with George Michael.",
    "The title of the album comes from \"plastic soul,\" a derogatory phrase McCartney had overheard black musicians using about Mick Jagger. (\"Plastic\" in those days meant anything fake or processed.) Paul can be heard using the phrase in studio chatter on June 14, 1965, during recording of the \"Help!\" B-side \"I'm Down.\" Reliably, he put his own spin on the phrase. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France, for above 2\n                                                  \n                                                  "
  ],
  "lyrics": "Asked a girl what she wanted to be\nShe said, \"baby, can't you see\nI want to be famous, a star on the screen\nBut you can do something in between\n\nBaby, you can drive my car\nYes, I'm gonna be a star\nBaby, you can drive my car\nAnd maybe I'll love you\"\n\nI told a girl that my prospects were good\nAnd she said, \"baby, it's understood\nWorking for peanuts is all very fine\nBut I can show you a better time\n\nBaby, you can drive my car\nYes, I'm gonna be a star\nBaby, you can drive my car\nAnd maybe I'll love you\"\n\nBeep beep'm beep beep yeah\n\nBaby, you can drive my car\nYes, I'm gonna be a star\nBaby, you can drive my car\nAnd maybe I'll love you\n\nI told a girl I can start right away\nAnd she said, \"listen, babe, I got something to say\nI got no car and it's breaking my heart\nBut I've found a driver and that's a start\n\nBaby, you can drive my car\nYes, I'm gonna be a star\nBaby, you can drive my car\nAnd maybe I'll love you\"\n\nBeep beep'm beep beep yeah\nBeep beep'm beep beep yeah\nBeep beep'm beep beep yeah\nBeep beep'm beep beep yeah\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}