{
  "Artist": "The Beatles",
  "Album": "Beatles for Sale",
  "Title": "Eight Days a Week",
  "URL": "https://www.songfacts.com/facts/the-beatles/eight-days-a-week",
  "Confidence": 1.0,
  "youtube-id": "kle2xHhRHg4",
  "facts": [
    "This fades up from silence. It was the first pop song to do so.",
    "There are two possibilities on where the title came from. In Bob Spitz' The Beatles: The Biography, Paul McCartney claims that he asked his chauffeur (while being driven to John's house in Weybridge) if he was busy, and got the answer \"Busy? I've been working eight days a week.\" In a later interview, Paul says that it was Ringo who coined the phrase: \"He said it as though he were an overworked chauffeur. When we heard it we said 'Really?' Bing! Got it\"! John Lennon also claimed it was one of Ringo's malapropisms.",
    "The Beatles wrote this for the movie Help, which was at one point titled \"Eight arms to hold you.\"",
    "McCartney wrote most of this song, while Lennon added the middle eight and a few other lines. Usually John and Paul sang lead on songs that they wrote or principally wrote. This is an exception to that, with Paul writing the song but John singing lead. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Carl - Eugene, OR\n                                                  \n                                                  ",
    "In the first few takes of this song, the John Lennon and Paul McCartney harmonized an opening rather than having the song begin with the guitar. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "John Lennon claimed not to like the song. In his 1980 interview with Playboy magazine, he stated, \"'Eight Days A Week' was never a good song. We struggled to record it and struggled to make it into a song. It was [Paul's] initial effort, but I think we both worked on it. I'm not sure. But, it was lousy anyway.\"",
    "This was not released as a single in the UK. It was scheduled for release there until Lennon wrote \"I Feel Fine.\" It was immediately changed to the new song.",
    "Artists to cover this song include The Dandy Warhols, Joan Jett, Lorrie Morgan, The Persuasions, Billy Preston and Procol Harum. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "Both this song and \"You Won't See Me\" lift the chord sequence from The Four Tops' \"It's the Same Old Song.\" McCartney later admitted, \"we were the biggest nickers in town.\"",
    "This song was used in the movie My Best Friend's Wedding, and also in an episode of the TV show Scrubs."
  ],
  "lyrics": "Oh, I need your love, babe\nGuess you know it's true\nHope you need my love babe\nJust like I need you\n\nHold me, love me, hold me, love me\nI ain't got nothing but love, babe\nEight days a week\n\nLove you every day, girl\nAlways on my mind\nOne thing I can say, girl\nLove you all the time\n\nHold me, love me, hold me, love me\nI ain't got nothing but love, girl\nEight days a week\n\nEight days a week\nI love you\nEight days a week\nIs not enough to show I care\n\nOoh I need your love, babe\nGuess you know it's true\nHope you need my love babe\nJust like I need you\n\nHold me, love me, hold me, love me\nI ain't got nothing but love, babe\nEight days a week\n\nEight days a week\nI love you\nEight days a week\nIs not enough to show I care\n\nLove you every day, girl\nAlways on my mind\nOne thing I can say girl\nLove you all the time\n\nHold me, love me, hold me, love me\nI ain't got nothing but love, babe\nEight days a week\nEight days a week\nEight days a week\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}