{
  "Artist": "The Beatles",
  "Album": "CD2 - The Beatles",
  "Title": "Everybody's Got Something To Hide Except Me and My Monkey",
  "URL": "https://www.songfacts.com/facts/the-beatles/everybodys-got-something-to-hide-except-me-and-my-monkey",
  "Confidence": 1.0,
  "youtube-id": "VVIVYV_m6t4",
  "facts": [
    "John Lennon described this song as, \"About me and Yoko. Everybody seemed to be paranoid except for us two, who were in the glow of love.\" According to Mojo magazine, Lennon had recently been piqued by a cartoon that portrayed Yoko as a monkey clinging to her Beatle lover's back and took 'monkey' as his pet name for Ono.",
    "This has the longest title of any Beatles song.",
    "The backing track was sped up to give a frantic pace.",
    "The line, \"Come on, Come on, its such a joy\" was something the Maharishi said while The Beatles were in India in 1967. The original title of this was \"Come On, Come On.\"",
    "This was covered by Fats Domino. Lennon really loved his cover.",
    "John Lennon played lead guitar on this one. George Harrison is playing rhythm guitar."
  ],
  "lyrics": "Come on come on come on come on\nCome on is such a joy\nCome on is such a joy\nCome on take it easy\nCome on take it easy\nTake it easy take it easy\nEverybody's got something to hide except for me and\nMy monkey.\n\nThe deeper you go the higher you fly\nThe higher you fly the deeper you go\nSo come on come on\nCome on is such a joy\nCome on is such a joy\nCome on make it easy\nCome on make it easy.\n\nTake it easy take it easy\nEverybody's got something to hide except for me and\nMy monkey.\n\nYour inside is out and your outside is in\nYour outside is in and your inside is out\nSo come on come on\nCome on is such a joy\nCome on is such a joy\nCome on make it easy\nCome on make it easy\nMake it easy make it easy\nEverybody's got something to hide except for me and\nMy monkey.\n                                                  \n                                                  Writer/s: JOHN LENNON, PAUL MCCARTNEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}