{
  "Artist": "The Beatles",
  "Album": "Beatles for Sale",
  "Title": "Everybody's Trying to Be My Baby",
  "URL": "https://www.songfacts.com/facts/the-beatles/everybodys-trying-to-be-my-baby",
  "Confidence": 1.0,
  "youtube-id": "u7vc6_qW0UA",
  "facts": [
    "Carl Perkins was the first to record this. The Beatles also covered Perkins' \"Matchbox\" and \"Honey Don't.\"\nSo, to track down the pedigree of this song: It was written by Carl Perkins, a Memphis, Tennessee rockabilly artist, but it's also very similar to another song by the same title by Alabama country singer Rex Griffon - while using music more keeping with \"Blue Suede Shoes.\" Meanwhile the melody was also borrowed back to country by Hank Williams in the songs \"Move It On Over\" and \"Mind Your Own Business.\" The melody was also re-borrowed for \"Rock Around The Clock.\" Confused now?",
    "George Harrison sang lead - he was a huge fan of Perkins. It was his showcase song on early tours. The technique used for George Harrison's vocals, in which they are both double-tracked and echoed to create a fuller sound, goes by the acronym STEED, for \"Single Tape Echo + Echo Delay.\" For that 1950s \"rocker from outer space\" effect.",
    "This was the last Beatles album to which George Harrison did not offer any lyrical contribution. After Beatles For Sale, he became more prominent as a songwriter in the group - he wrote two songs for Help and two for Rubber Soul. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Ironically considering the album title, Beatles For Sale was not for sale in the United States until the 1980s. The album Beatles '65 contained mostly the same tracks, and was the US version of the UK Beatles For Sale."
  ],
  "lyrics": "Well they took some honey from a tree\nDressed it up and they called it me\n\nEverybody's trying to be my baby\nEverybody's trying to be my baby\nEverybody's trying to be my baby, now\n\nWoke up last night, half past four\nFifty women knocking on my door\n\nEverybody's trying to be my baby\nEverybody's trying to be my baby\nEverybody's trying to be my baby, now\n\nWent out last night, I didn't stay late\n'Fore I got home I had nineteen dates\n\nEverybody's trying to be my baby\nEverybody's trying to be my baby\nEverybody's trying to be my baby, now\n\nWent out last night, I didn't stay late\n'Fore I got home I had nineteen dates\n\nEverybody's trying to be my baby\nEverybody's trying to be my baby\nEverybody's trying to be my baby, now\n\nWell they took some honey from a tree\nDressed it up and they called it me\n\nEverybody's trying to be my baby\nEverybody's trying to be my baby\nEverybody's trying to be my baby, now\n                                                  \n                                                  Writer/s: Carl Lee Perkins \n\n                                                   Publisher: Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}