{
  "Artist": "The Beatles",
  "Album": "Sgt. Pepper's Lonely Hearts Club Band",
  "Title": "Fixing A Hole",
  "URL": "https://www.songfacts.com/facts/the-beatles/fixing-a-hole",
  "Confidence": 1.0,
  "youtube-id": "vSOVVwLhx3Y",
  "facts": [
    "Paul McCartney wrote this after fixing the roof on his farm in Scotland. McCartney said the song was \"about the hole in the road where the rain gets in, a good old analogy.\"",
    "This was the first time The Beatles used a studio other than one owned and operated by their record label EMI. The takes in this new studio - Regent Sound Studio, located in Tottenham Court Road, London - were numbered 1-3. They returned to Abbey Road the next day however, recording \"A Day In The Life.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Matt - Lancaster, PA\n                                                  \n                                                  ",
    "It was rumored that this was about heroin, as in \"getting a fix.\" There is no truth to this rumor.",
    "George Harrison became annoyed at the number of times Paul re-recorded vocals for this song, later saying he did almost nothing during the recording of the album but sit around all day listening to Paul singing the words \"Fixing a hole\" all day. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jonathon - Clermont, FL\n                                                  \n                                                  "
  ],
  "lyrics": "I'm fixing a hole where the rain gets in\nAnd stops my mind from wandering\nWhere it will go\n\nI'm filling the cracks that ran through the door\nAnd kept my mind from wandering\nWhere it will go\n\nAnd it really doesn't matter if I'm wrong I'm right\nWhere I belong I'm right\nWhere I belong.\n\nSee the people standing there who disagree and never win\nAnd wonder why they don't get in my door\nI'm painting my room in the colourful way\n\nAnd when my mind is wandering\nThere I will go\nAnd it really doesn't matter if I'm wrong I'm right\nWhere I belong I'm right\nWhere I belong.\n\nSilly people run around they worry me\nAnd never ask me why they don't get past my door\nI'm taking the time for a number of things\nThat weren't important yesterday\nAnd I still go\n\nI'm fixing a hole where the rain gets in\nAnd stops my mind from wandering\nWhere it will go\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}