{
  "Artist": "The Beatles",
  "Album": "Let It Be",
  "Title": "For You Blue",
  "URL": "https://www.songfacts.com/facts/the-beatles/for-you-blue",
  "Confidence": 1.0,
  "youtube-id": "TIFHRaZERHg",
  "facts": [
    "George Harrison wrote this. It was inspired by his wife, Pattie.",
    "A little after half way through the song, John Lennon makes a reference to Elmore James, a blues musician: \"Elmore James got nothin' on this.\" If you listen to the song \"Madison Blues\" by Elmore James, the tune is very similar to \"For You Blue.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ben - Encinitas, CA\n                                                  \n                                                  ",
    "John Lennon played the slide guitar part. The Beatles performed this in their last movie, Let It Be, and Lennon can be seen using a shotgun shell for the slide.",
    "The version on Anthology 3 and also the Let It Be... Naked album are different takes from earlier in the January 25, 1969 session (1/25/69) when this was recorded. The Naked version is the same one seen in the Let It Be film. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "Harrison played this on his 1974 Dark Horse tour.",
    "This hit #1 along with \"The Long and Winding Road,\" which was its A-side. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "This was originally titled \"George's Blues.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "Because you're sweet and lovely, girl, I love you\nBecause you're sweet and lovely, girl, it's true\nI love you more than ever, girl, I do\n\nI want you in the morning, girl, I love you\nI want you at the moment I feel blue\nI'm living every moment, girl, for you\n\n(Walk, walk cat, walk)\n(Go, Johnny, go)\n(Same old tale of blues)\n(Elmo James got nothing on this, baby)\n\nI've loved you from the moment, I saw you\nYou looked at me that's all you had to do\nI feel it now, I hope you feel it too\n\nBecause you're sweet and lovely, girl, I love you\nBecause you're sweet and lovely, girl, it's true\nI love you more than ever, girl, I do\nI really love you\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: CONCORD MUSIC PUBLISHING LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}