{
  "Artist": "The Beatles",
  "Album": "Revolver",
  "Title": "For No One",
  "URL": "https://www.songfacts.com/facts/the-beatles/for-no-one",
  "Confidence": 1.0,
  "youtube-id": "HuphFPEqJqw",
  "facts": [
    "Paul McCartney wrote this song sitting in a chalet while on holiday with his girlfriend Jane Asher in Klosters, Switzerland, March of 1966. The working title was \"Why Did It Die,\" and there is speculation that McCartney wrote the song about Asher, who was a successful London actress.\nThe theory is that Paul wanted her to cater to his schedule, tour with him, and be the \"perfect Beatle wife,\" but Jane had a life and career of her own, hence the \"She doesn't need you\" lyrics. Paul has never said it was about Jane specifically, however he did say, \"I guess there had been an argument. I never have easy relationships with women.\" He knew what he was getting into when he got involved with Jane, and being that the song was written in 1966 and they didn't break up until 1968, it's likely that if the song was about Jane, it wasn't a serious argument.",
    "When he heard the title, Alan Civil, who played the French Horn on this track, thought it was an orchestral piece called \"For No. One\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Chet - Saratoga Springs, NY\n                                                  \n                                                  ",
    "This was recorded on May 9, 16 and 19, 1966 by only two Beatles - Paul singing and playing the keyboard and bass, and Ringo on percussion. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dominic - Pittsburgh, PA\n                                                  \n                                                  ",
    "Maureen McGovern recorded this and \"Things We Said Today\" as a 2-song medley for her 1992 album Baby I'm Yours.",
    "McCartney used this in his 1984 movie Give My Regards to Broad Street.",
    "Revolver was the last Beatles album to have different US and UK versions. In 2002, Rolling Stone readers voted it the greatest album of all time. The album cover was created by artist Klaus Voormann, who became friends with the band when they were playing clubs in Hamburg, Germany in the early '60s. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "Your day breaks, your mind aches\nYou find that all the words of kindness linger on\nWhen she no longer needs you\n\nShe wakes up, she makes up\nShe takes her time and doesn't feel she has to hurry\nShe no longer needs you\n\nAnd in her eyes you see nothing\nNo sign of love behind the tears\nCried for no one\nA love that should have lasted years!\n\nYou want her, you need her\nAnd yet you don't believe her when she says her love is dead\nYou think she needs you\n\nAnd in her eyes you see nothing\nNo sign of love behind the tears\nCried for no one\nA love that should have lasted years!\n\nYou stay home, she goes out\nShe says that long ago she knew someone but now he's gone\nShe doesn't need him\n\nYour day breaks, your mind aches\nThere will be times when all the things she said will fill your head\nYou won't forget her\n\nAnd in her eyes you see nothing\nNo sign of love behind the tears\nCried for no one\nA love that should have lasted years!\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}