{
  "Artist": "The Beatles",
  "Album": "Let It Be",
  "Title": "Get Back",
  "URL": "https://www.songfacts.com/facts/the-beatles/get-back",
  "Confidence": 1.0,
  "youtube-id": "UocEGvQ10OE",
  "facts": [
    "Early versions include the line \"I dig no Pakistanis.\" The song began as a commentary about immigration, telling people to \"get back\" to their own countries. It was meant to mock Britain's anti-immigrant proponents. Paul McCartney, who wrote the song and sang lead, thought better of it and made the lyrics more palatable.",
    "\"Get Back\" was going to be the title of the album and the documentary film about making it. The Beatles stopped touring in 1966 and were worn thin by 1968, but they rekindled their passion for performance after shooting the \"Hey Jude\" promotional film in September that year before a live audience. Energized by the effort, they agreed to the documentary; the concept was The Beatles \"getting back\" to their roots and playing new songs for a live audience without any studio tricks.\nThe song \"Get Back\" came closest to capturing that spirit. Produced by George Martin, it was released as the follow-up single to \"Hey Jude\" in April 1969 (a month later in America) and was another blockbuster for the group, going to #1 in most territories.\nThe album became something completely different from the live set they planned. Glyn Johns, who engineered the sessions, was asked to put it together from what were really rehearsal tapes. After he assembled the album, it sat around while the Let It Be documentary was being edited from the film footage of The Beatles rehearsing in the studio and playing on the rooftop. During this time, The Beatles made the Abbey Road album, released it, and broke up.\nPhil Spector, who had worked on John Lennon's solo song \"Instant Karma\" (which George Harrison played on), was brought in to produce the Get Back album, which was re-titled Let It Be. Spector took the tapes and added orchestrations using his \"Wall Of Sound\" technique, and the album that was supposed to be the raw sound of The Beatles returning to their roots was released as a highly produced swan song on May 8, 1970, after they had broken up.",
    "The Beatles famously performed this song from the rooftop of Apple Records on January 30, 1969, footage of which serves as the climax to their Let It Be documentary film. Knowing it would get shut down pretty quickly, the group kept mum about the performance, which was designed to promote the single and provide an ending for their film. They got in three takes of \"Get Back\" before police pulled the plug. The plan worked: Not only did they get their film ending, but the audio (including their banter) was used on various edits of \"Get Back\" to give it a live feel and add some character.",
    "In their early days, The Beatles were musical warriors, playing in clubs for hours most nights. The \"Get Back\" single harkened to those days and was advertised as \"The Beatles as nature intended.\"",
    "The single version runs 3:11 and contains a false ending at 2:34, after which McCartney comes back with a spoken verse:\n\"Get back Loretta, your mummy's waiting for you, wearing her high-heeled shoes and her low-neck sweater, get back home, Loretta.\"\nThe album version is a little shorter (3:09) and omits this section. It begins with a behind-the-scenes bit from the band tuning up during a session for the song on January 27, 1969. We hear John Lennon poke fun at the first line (\"Jojo was a man who thought he was a loner, but he knew it couldn't last\") by saying:\n\"Sweet Loretta fat she thought she was a cleaner, but she was a frying pan.\"\nAt the end of this album version, we hear cheering, followed by McCartney saying, \"Thanks Mo\" in response to Ringo's wife, Maureen, who was clapping. Lennon then says, \"I'd like to say thank you on behalf of the group and ourselves, and I hope we've passed the audition.\" This part came from the live rooftop performance.",
    "Billy Preston played piano on this track and became the only guest artist to get a credit on a Beatles single when it was credited to \"The Beatles with Billy Preston.\"\nPreston was a salve and a spark for the group. On January 10, 1969, George Harrison quit and almost left for good. He came back to work on January 21, but the tension lingered. Preston showed up the next day and galvanized the group; he played on \"Get Back\" and \"Don't Let Me Down,\" and participated in sessions for several other tracks.\nThe Beatles met Preston in 1962 when they were both playing in Germany, but they hadn't seen each other since. It was Harrison's idea to bring him in; after George left the Let It Be sessions, he saw Preston in concert with Ray Charles and arranged for him to join The Beatles. Having him in the studio eased the tension and made it easier for the group to put personal conflicts aside and record the album.",
    "The press release to promote the single contains this quote from McCartney: \"We were sitting in the studio and we made it up out of thin air... we started to write words there and then... when we finished it, we recorded it at Apple Studios and made it into a song to roller coast by.\"",
    "Lennon claimed this was basically a rewrite of their 1968 song \"Lady Madonna.\"",
    "Beatles fans found lots of hidden meaning in their lyrics, and sometimes the band did too. In his 1980 Playboy interview, John Lennon claimed that Paul looked at Yoko in the studio when he sang the line \"get back to where you once belong.\" John was sure he was disrespecting her.",
    "McCartney got the idea for the title \"Get Back\" from the line \"Get back to where you should be\" from a song George Harrison wrote called \"Sour Milk Sea,\" which was eventually recorded by Jackie Lomax. McCartney changed the line to, \"Get back to where you once belonged.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "There was speculation that the character \"JoJo\" was based on Joseph Melville See Jr., Linda McCartney's first husband, who was from Tucson, Arizona. McCartney denied this, explaining in his 1988 autobiography Many Years From Now that he and Linda were on good terms with See, who used the first name Melville, and that \"JoJo\" was \"an imaginary character, half-man and half-woman.\" \nLinda attended the University of Arizona in Tucson, and in 1979 she and Paul bought a ranch there. As for Joseph Melville See, he never remarried, and in 2000 he killed himself in Tucson.",
    "Billy Preston's piano solo was spontaneous. he told New Jersey's Asbury Park Press in 2000: \"I was playing a Fender Rhodes on 'Get Back.' They just told me, 'Take a solo!' I wasn't expecting to do a solo. When we were rehearsing, I wasn't playing a solo.\"",
    "The last version of the song The Beatles played on the Apple rooftop can be heard in the widely bootlegged \"rooftop sessions,\" which finds McCartney mocking the police as they shut them down. You can hear him ad-lib the lines \"You been out too long, Loretta! You've been playing on the roofs again! That's no good! You know your mommy doesn't like that! Oh, she's getting angry... she'll have you arrested! Get back!\"\nAn edited version of the rooftop performances was released on the Anthology 3 collection in 1996.",
    "Some of the artists to cover this song include: The Bee Gees, The Crusaders, Dizzy Gillespie, Al Green, Elton John, The London Symphony Orchestra, The Main Ingredient, Nitty Gritty Dirt Band, Billy Preston, Kenny Rogers, The Royal Philharmonic Orchestra, The Shadows, Status Quo, Rod Stewart, Ike and Tina Turner, and Sarah Vaughan.",
    "In 2003, Paul McCartney and Ringo Starr gave permission to Apple Records to rework the album and remove Phil Spector's production. The result is the stripped-down version called Let It Be... Naked, which McCartney claims is what the group intended.",
    "McCartney played this at halftime of the 2005 Super Bowl. This was the year after Janet Jackson's breast was exposed during the halftime show, so the NFL insisted on an act that wouldn't incite controversy or push the envelope. McCartney fit the bill."
  ],
  "lyrics": "Jojo was a man who thought he was a loner\nBut he knew it wouldn't last\nJojo left his home in Tucson, Arizona\nFor some California grass\n\nGet back, get back\nGet back to where you once belonged\nGet back, get back\nGet back to where you once belonged\nGet back Jojo, go home\n\nGet back, get back\nBack to where you once belonged\nGet back, get back\nBack to where you once belonged\nGet back Jo\n\nSweet Loretta Martin thought she was a woman\nBut she was another man\nAll the girls around her say she's got it coming\nBut she gets it while she can\n\nGet back, get back\nGet back to where you once belonged\nGet back, get back\nGet back to where you once belonged\nGet back Loretta, go home\n\nGet back, get back\nGet back to where you once belonged\nGet back, get back\nGet back to where you once belonged\n\nGet back, get back\nGet back to where you once belonged\nGet back, get back, get back\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "place": {
    "name": "Tucson, Arizona",
    "facts": [
      "If ever someone asked, I would have to say that “Get Back” is one of my absolute favorite Beatles songs. Not just because it is a good song, but because of what that song represents. It’s the very last song on their last album",
      "and, while it was recorded well before 1970, it’s the last you hear of the Beatles being together and happy as friends and as a band. This was as tensions were building between members because of a variety of reasons, and when I hear “Get Back,” I hear a group of friends just playing a song together and enjoying it. In the song, Paul sings about a character named JoJo who lived in Tucson, Arizona, the place I’ll be talking about later on in this article.",
      "Let’s begin with the song and the album. The Beatles’ last album,",
      ", was recorded before their second-to-last album,",
      ". If that timeline is confusing, let me help un-confuse (that’s not a word) it. Around the time that the Beatles were away in India with Maharishi Mahesh Yogi, John, Paul, and George were all writing music furiously. From that time came almost all of the album ostensibly known as",
      "(but in reality is entitled simply",
      ") and many of the songs that would be later released on",
      ". Initially, the plan for",
      "was to call it “Get Back,” representing the Beatles getting back to the way they used to be. They wanted this album to be like their older albums. They had released",
      "and",
      "with all of their studio tricks and sounds, but now the Beatles just wanted to record a rock album. Straight rock music, no gimmicks, nothing. As time went on, they somewhat strayed from that idea, and eventually the album stagnated. The recording was pretty much done, but they just let it lie there. During the time that",
      "was sitting around, the Beatles recorded",
      ", released it, and then promptly broke up. Shortly after they broke up, John Lennon recorded his first solo single, “Instant Karma,” with Phil Spector producing it and George Harrison playing on it. Harrison and Lennon liked Spector’s producing so much they asked him to produce their last album,",
      ", which was changed to",
      ". Spector added to it his trademark Wall of Sound with grand orchestration and the like, and it was released.",
      "“Get Back” is what",
      "was supposed to be. It’s the song that came closest to the sound the Beatles were going for. It’s a fun song, somewhat nonsensical, and just enjoyable to listen to. Throughout the song you can hear the band joking around, taking the song very lightly. At the beginning of the album version, John says, “Sweet Loretta fart she thought she was a cleaner, but she was a frying pan,” making fun of the first line in the song. According to McCartney, “We were sitting in the studio and we made it [“Get Back”] up out of thin air…we started to write there and then…when we finished it, we recorded it at Apple Studios and made it into a song to roller coast by.” It sounds like that too, like a song they just kind of made up while they were jamming together. A song about people who think they’re men or women and aren’t, or are… or who knows what that song is about. Whatever it is, it’s fun, and that’s the message of the song. At the end, you can hear clapping and then Paul says “Thanks, Mo,” which was directed at Ringo’s wife, Maureen, who was clapping at the end of the song. After that, John says one of my favorite things I’ve ever heard him say, “I’d like to say thank you on behalf of the group and ourselves, and I hope we passed the audition.” Initially, Lennon said that at the famous rooftop concert, but Spector decided to add that in to the end of the song.",
      "Now we get to the place: Tucson, Arizona, where the character in the song - JoJo - is from. Tucson, Arizona, is the second-largest populated city in Arizona behind Phoenix, and it looks exactly like you’d expect a city in Arizona to look: like civilization in the middle of the desert. Not that that’s a bad thing. It’s absolutely beautiful, with mountains surrounding the city and all the beauty that the desert brings. But being that it’s the desert, it’s also hotter than a fat kid’s chaffed thighs after an hour on a treadmill. The coldest it ever really gets in Tucson during the day is about 65 degrees in January, and in the summertime it’s usually in the 90s or 100s. Tucson is also home to the University of Arizona, home of the Arizona Wildcats and roughly 39,000 students. There was a bit of speculation that the character JoJo in “Get Back” was a reference to Joseph Melville See, Jr., Linda McCartney’s first husband who was from Tucson, Arizona. McCartney later denied that in his autobiography, claiming that JoJo was just a made up character who was half-man, half-woman. Linda McCartney had actually attended University of Arizona, and Paul and Linda later owned a very large ranch there.",
      "\"Get Back\" is the last song Beatles fans heard on the last album they ever released and that has some strong meaning to a lot of people. It’s kind of sad in a sense, because with “Get Back,” you get this feeling of the Beatles getting back together as friends, when in reality they weren’t able to. However, we still get a great song out of it, and that’s worth something, for sure.",
      "~",
      "(Thanks to Sudhir Menon for the Songplace suggestion.)"
    ]
  }
}