{
  "Artist": "The Beatles",
  "Album": "Sgt. Pepper's Lonely Hearts Club Band",
  "Title": "Getting Better",
  "URL": "https://www.songfacts.com/facts/the-beatles/getting-better",
  "Confidence": 1.0,
  "youtube-id": "nqomuMaW1Fw",
  "facts": [
    "The idea of \"Getting Better\" came to Paul McCartney while he was walking his dog, Martha. The sun started to rise on the walk and he thought \"it's getting better.\" It also reminded him of something that Jimmy Nichol used to say quite often during the short period when he was The Beatles drummer. This song was a true collaborative effort for Lennon and McCartney, with Lennon adding that legendary part about being bad to his woman. He later admitted to being a \"hitter\" when it came to women. He said \"I was a hitter. I couldn't express myself, and I hit.\"",
    "John Lennon had a bad acid trip during the recording. While doing the overdubs, John began to get very sick. He said, \"I suddenly got so scared on the mike. I thought I felt ill and I thought I was going to crack. I said I must get some air.\" George Martin took him up on the roof of the studios for air and John started walking towards the edge. Martin panicked, thinking that John would fall or leap off and that would be it. On the roof, when John saw Martin looking at him \"funny,\" he realized he was on acid. John decided he couldn't do any more that night, so he sat in the booth and watched the others record. Paul eventually took him home and stayed to keep him company, and he decided to drop some acid with John. It was Paul's first LSD experience.",
    "George Harrison played the tamboura, a large Indian string instrument. It is the droning noise about 2/3rds of the way through.",
    "The string sound at the end was Beatles producer George Martin hitting the strings inside a piano.",
    "Lennon contributed the pessimistic viewpoint, coming up with the line, \"It can't get no worse.\" McCartney usually wrote much happier lyrics than Lennon.\nLennon revisited this song when he used the lyrics, \"Every day, in every way, it's getting better and better\" for his 1980 track \"Beautiful Boy (Darling Boy).\" This time, instead of taking the cynical side, he was affirming that life does just get keep getting better and better. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Leigh - NY, NY\n                                                  \n                                                  ",
    "This was used in commercials for Phillips television sets in 1999. The living Beatles resent the use of their songs in advertisements, but cannot prevent it because they do not own the publishing rights; Michael Jackson does.",
    "The Beatles had stopped touring by the time this was released. The first time McCartney played it live was on his 2002 \"Back In The US\" tour. That tour was made into a CD and a 2-hour concert film that aired on ABC and was released on DVD.",
    "This was used in the 2003 movie The Cat in the Hat starring Mike Myers. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  "
  ],
  "lyrics": "It's getting better all the time \nI used to get mad at my school \nThe teacher's that taught me weren't cool \nYou're holding me down \n\nTurning me 'round\nFilling me up with your rules \n\nI've got to admit it's getting better \nA little better all the time \nI have to admit it's getting better \nIt's getting better since you've been mine \n\nMe used to be angry young man \nMe hiding me head in the sand \nYou gave me the word \nI finally heard \nI'm doing the best that I can \nI've got to admit it's getting better \n\nI used to be cruel to my woman \nI beat her and kept apart from the things that she loved \nMan I was mean but I'm changing my scene \nAnd I'm doing the best that I can \n\nI admit it's getting better \nA little better all the time \nYes I admit it's getting better \nIt's getting better since you've been mine...\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}