{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "Girl",
  "URL": "https://www.songfacts.com/facts/the-beatles/girl",
  "Confidence": 1.0,
  "youtube-id": "_0FLrQCOuxs",
  "facts": [
    "John Lennon said: \"This was about a dream girl.\" His wife Cynthia thought this song might have been about her. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Mountlake Terrace, WA. U.S.A\n                                                  \n                                                  ",
    "As a joke, George Harrison and Paul McCartney repeated \"tit\" on the backing vocals. Most people don't notice it or think they are singing something more innocent.",
    "This was one of John Lennon's favorite Beatles songs. He revealed in the January 1971 edition of Rolling Stone, that in this song he was, \"in a way, trying to say something or other about Christianity\" which he was \"opposed to at the time.\" He explained: \"I was just talking about Christianity in that - a thing like you have to be tortured to attain heaven. I'm only saying that I was talking about 'pain will lead to pleasure' in 'Girl' and that was sort of the Catholic Christian concept - be tortured and then it'll be alright, which seems to be a bit true but not in their concept of it. But I didn't believe in that, that you have to be tortured to attain anything, it just so happens that you were.\"",
    "Jackson Browne said in Rolling Stone magazines 100 Greatest Singers Of All Time issue: \"There was a tremendous intimacy in everything John Lennon did, combined with a formidable intellect. That is what makes him a great singer. In 'Girl,' he starts in this steely, high voice: 'Is there anybody going to listen to my story.' It's so impassioned, like somebody stepping from the shadows in a room. But when he comes to the chorus, you suddenly realize: He's talking directly to her. When I heard this, as a young teenager, it hit the nail on the head. It embodied the feelings I was living with every day - completely burning with sexual desire, with almost a regret at being so overpowered.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "Is there anybody going to listen to my story\nAll about the girl who came to stay?\nShe's the kind of girl\nYou want so much, it makes you sorry\nStill you don't regret a single day\nAh, girl, girl\n\nWhen I think of all the times\nI tried so hard to leave her\nShe will turn to me and start to cry\nAnd she promises the earth to me\nAnd I believe her\nAfter all this time I don't know why\nAh, girl, girl\n\nShe's the kind of girl who puts you down\nWhen friends are there\nYou feel a fool\nWhen you say she's looking good\nShe acts as if it's understood\nShe's cool, ooh, ooh, ooh\nGirl, girl, girl\n\nWas she told when she was young\nThat pain would lead to pleasure?\nDid she understand it when they said\nThat a man must break his back\nTo earn his day of leisure?\nWill she still believe it when he's dead?\nAh, girl, girl, girl\nAh, girl, girl\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Universal Music Publishing Group, BMG Rights Management, Kobalt Music Publishing Ltd., Roof Music Schallplatten- und Verlags GmbH\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}