{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "Glass Onion",
  "URL": "https://www.songfacts.com/facts/the-beatles/glass-onion",
  "Confidence": 1.0,
  "youtube-id": "aBQIAWh3YBs",
  "facts": [
    "John Lennon used meaningless lyrics to confuse people who were reading too much into his songs. He got a kick out of people trying to analyze his lyrics.",
    "A glass onion is a coffin with a see-through lid. Because of this, it became a big part of the \"Paul is Dead\" hoax. Another clue for those who believed the hoax: Lennon sang, \"The Walrus is Paul.\" In many European countries, a walrus represents death. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dominic - Greensboro, NC\n                                                  \n                                                  ",
    "Lennon mentioned other Beatles songs in the lyrics: \"Strawberry Fields,\" \"I am the Walrus,\" \"Lady Madonna,\" \"The Fool on the Hill,\" and \"Fixing a Hole.\"",
    "Lennon wanted to name one of the bands they signed to Apple Records \"Glass Onion.\" They chose \"Badfinger\" instead.",
    "One theory is that \"Glass Onion\" refers to Lennon's opinion of the yogic concept of the lotus with its layered petals (layers of consciousness to be stripped away, much like an onion, through meditation) as a bunch of transparent bull used by the Maharishi to manipulate and seduce. He's also saying the Maharishi's whole shtick stinks and is a crying shame. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n ELBUSH - Greensboro, NC\n                                                  \n                                                  ",
    "When Lennon sings about the \"Cast Iron Shore,\" he's referring to what was an area of beach at Liverpool, that is now partly built over. This area of Liverpool is called Otterspool. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Murray - Liverpool, England, England\n                                                  \n                                                  ",
    "According to Mojo magazine, the Beatles recorded 34 takes of the song's basic rhythm track on Wednesday September 11, 1968, then returned the next day to overdub Lennon's vocal and again on Friday and the following Monday for further overdubs. On October 10th George Martin, after returning from holiday, added the string section.",
    "Paul McCartney had the original idea for writing a song that had a poke at all those who read too much into the Beatles lyrics. McCartney came up with its structure and he and Lennon wrote it roughly 50-50.",
    "Lennon explained to Rolling Stone in a 1971 interview why he said \"The Walrus is Paul.\" Said Lennon: \"'I Am The Walrus' was originally the B side of 'Hello Goodbye.' I was still in my love cloud with Yoko and I thought, well, I'll just say something nice to Paul: 'It's all right, you did a good job over these few years, holding us together.' He was trying to organize the group, and organize the music, and be an individual and all that, so I wanted to thank him. I said 'the Walrus is Paul' for that reason. I felt, 'Well, he can have it. I've got Yoko, and thank you, you can have the credit.'\""
  ],
  "lyrics": "I told you about strawberry fields\nYou know the place where nothing is real\nWell here's another place you can go\nWhere everything flows.\n\nLooking through the bent-backed tulips\nTo see how the other half live\nLooking through a glass onion.\n\nI told you about the walrus and me, man\nYou know we're as close as can be, man\nWell here's another clue for you all\nThe walrus was Paul.\n\nStanding on the cast iron shore, yeah\nLady Madonna trying to make ends meet, yeah\nLooking through the glass onion\n\nOh yeah, oh yeah, oh yeah\nLooking through the glass onion.\n\nI told you about the fool on the hill\nI tell you man he's living there still\nWell here's another place you can be\nListen to me.\n\nFixing a hole in the ocean\nTrying to make a dove-tail joint, yeah\nLooking through a glass onion.\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}