{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Golden Slumbers",
  "URL": "https://www.songfacts.com/facts/the-beatles/golden-slumbers",
  "Confidence": 1.0,
  "youtube-id": "AcQjM7gV6mI",
  "facts": [
    "This song was based on a 17th century poem by Thomas Dekker called Golden Slumbers Kiss Your Eyes:\nGolden slumbers kiss your eyes\nSmiles awake you when you rise\nSleep, pretty wantons, do not cry\nAnd I will sing a lullaby\nRock them, rock them, lullaby\nCare is heavy, therefore sleep you\nYou are care, and care must keep you\nSleep, pretty wantons, do not cry\nAnd I will sing a lullaby\nRock them, rock them, lullaby",
    "Paul McCartney wrote this on his stepsister's piano. He saw the song \"Golden Slumbers\" in her songbook and, unable to read music, made up his own using most of the original lyrics.",
    "According to Mark Lewisohn's The Beatles Recording Sessions, McCartney recorded this song on July 2, 1969, a day after Lennon suffered injuries from a car accident in Scotland that left him in a hospital until July 6th. So Lennon did not perform on this song. George Harrison played bass guitar as Paul was playing piano.",
    "Recorded as one song with \"Carry That Weight,\" this is part of a suite of songs at the end of Abbey Road. It was the last album The Beatles recorded, although it was released before Let It Be.",
    "Elbow covered this for the 2017 UK John Lewis Christmas commercial. The festive ad, directed by Bjork collaborator Michel Gondry, tells the story of 'Moz The Monster' who is befriended by a young boy after he discovers him living under his bed. Elbow frontman Guy Garvey told HMV.com the story of their cover: \n\"John Lewis got in touch and said 'Beatles, Michel Gondry,' and we said 'Yes please!' It's such a beautiful song, I don't ever remember not knowing that song, it's such a part of my background. My mum said she was having a particularly hard time when that record came out, and she said 'it saved my life, it really did'. So to hear us covering it means an awful lot to my mum, you know? It really moved her.\nIt's just such a privilege, we really didn't bring anything to the table, the song is absolutely a masterpiece and I thought the advert was brilliant, I really, really liked it.\"\n",
    "Other artists that have recorded covers of the song include:\nGeorge Benson as part of an entire album covering Abbey Road, called The Other Side of Abbey Road.\nThe Bee Gees and Peter Frampton for the 1978 film Sgt. Pepper's Lonely Hearts Club Band.\nJennifer Hudson for the soundtrack to animated movie Sing."
  ],
  "lyrics": "Once there was a way\nTo get back homeward\n\nOnce there was a way\nTo get back home\n\nSleep, pretty darling\nDo not cry\nAnd I will sing a lullaby\n\nGolden slumbers\nFill your eyes\nSmiles await you when you rise\nSleep pretty darling\nDo not cry\nAnd I will sing a lullaby\n\nOnce there was a way\nTo get back homeward\n\nOnce there was a way\nTo get back home\n\nSleep, pretty darling\nDo not cry\nAnd I will sing a lullaby\n                                                  \n                                                  Writer/s: Paul McCartney, John Lennon \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}