{
  "Artist": "The Beatles",
  "Album": "CD2 - The Beatles",
  "Title": "Good Night",
  "URL": "https://www.songfacts.com/facts/the-beatles/good-night",
  "Confidence": 1.0,
  "youtube-id": "OiLr2Vk9xR4",
  "facts": [
    "This is the final track on The White Album, which was a double album released in the UK in November 1968. It's a tender ballad written by John Lennon and sung by Ringo Starr, whose voice suited the song's mood perfectly. It was completed with a lush score by Beatles producer George Martin, who also conducted the orchestra of 26 musicians. Along with the Mike Sammes Singers choral overdubs it was all consigned to the oxide particles in a late night session in Studio 1 at Abbey Road on July 22, 1968.",
    "Many have thought this was a Paul McCartney song due to its gentle nature, but it does show John could write for the two opposite ends of the spectrum from the rockers like \"Revolution\" to the gentle \"Julia.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n David - Wolverhampton, United Kingdom, for above 2\n                                                  \n                                                  ",
    "John Lennon wrote this lullaby for his son, Julian, who did not discover this was written for him until 12 years after it's release on The White Album.",
    "Ringo sang this accompanied by a 30-piece orchestra and a choir. He is the only Beatle to appear on the song. The Orchestra was scored by Beatles producer George Martin.",
    "Paul McCartney recalled in Many Years From Now by Barry Miles: \"I think John felt it might not be good for his image for him to sing it but it was fabulous to hear him do it, he sang it great. We heard him sing it in order to teach it to Ringo and he sang it very tenderly. John rarely showed his tender side, but my key memories of John are when he was tender, that's what has remained with me; those moments where he showed himself to be a very generous, loving person. I always cite that song as an example of the John beneath the surface that we only saw occasionally... I don't think John's version was ever recorded.\"",
    "This song demonstrates some similarities between John Lennon and the composer Richard Wagner. The transition from Lennon's chaotic \"Revolution 9\" to his light \"Good Night,\" sounds very much like the end of \"Die Götterdämmerung,\" where you hear dark and chaotic orchestra music that changes fashion and ends with a little conventional melody.",
    "With its long notes, depth and melancholy, this resembles Lennon's \"If I Fell.\" If you sing \"If I Fell\" very, very slowly, the melody to \"Good Night\" will appear. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, a music historian in Stockholm, for above 2\n                                                  \n                                                  ",
    "Coldplay played the song at the end of their concerts in 2005 while they waved goodbye and exited the stage. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bri - Chelmsford, MA\n                                                  \n                                                  "
  ],
  "lyrics": "Now it's time to say good night\nGood night sleep tight\nNow the sun turns out his light\nGood night sleep tight\nDream sweet dreams for me\nDream sweet dreams for you.\n\nClose your eyes and I'll close mine\nGood night sleep tight\nNow the moon begins to shine\nGood night sleep tight\nDream sweet dreams for me\nDream sweet dreams for you.\n\nClose your eyes and I'll close mine\nGood night sleep tight\nNow the sun turns out his light\nGood night sleep tight\nDream sweet dreams for me\nDream sweet dreams for you.\n\nGood night good night everybody\nEvberybody everywhere\nGood night.\n                                                  \n                                                  Writer/s: JOHN LENNON, PAUL MCCARTNEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Songtrust Ave\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}