{
  "Artist": "The Beatles",
  "Album": "Revolver",
  "Title": "Good Day Sunshine",
  "URL": "https://www.songfacts.com/facts/the-beatles/good-day-sunshine",
  "Confidence": 1.0,
  "youtube-id": "CXbCt4qrEiY",
  "facts": [
    "Paul McCartney wrote this on a sunny day at John Lennon's house. It was influenced by the Lovin' Spoonful, who had a happy hit with \"Do You Believe In Magic?\"\nThe actual Lovin' Spoonful hit which inspired this song was \"Daydream,\" a famously carefree, upbeat tune. McCartney confided in interviews that it was intended to evoke \"the same traditional, almost trad-jazz feel\" and that \"Good Day Sunshine\" was Paul's effort to write something in the same spirit.",
    "The song was recorded over two days, with the first day being the bass, piano, and drums picked best out of three takes, then the lead vocals (Paul, George, and John) dubbed over that. On day two, Ringo added more drums, producer George Martin added the piano solo on a tape recorder running a step slower so it would sound sped-up, and more harmonies and hand claps were added.",
    "An early use of stereo, the chorus bounces between the left and right channels at the fade.",
    "Covers for this song include Claudine Longet, who charted with it in 1967 on the Adult Contemporary chart, and the Scottish singer Lulu on her 1970 album Melody Fair. McCartney himself also rerecorded it for his 1984 film Give My Regards to Broad Street.",
    "Rolling Stone ranks Revolver at #3 on its 2003 list of \"The 500 Greatest Albums Of All Time,\" second only to the Beatles Sgt. Pepper's Lonely Hearts Club Band and The Beach Boys' Pet Sounds. \"Good Day Sunshine\" received a lot of praise individually from critics, even out of all that.",
    "This song is a popular pick for the wake-up music on space station missions. In November 2005, McCartney himself played it live to the crew of the ISS. Guess you might as well have a sunny, happy number to start your day when you're crammed into living space the size of a bus surrounded by infinite vacuum.",
    "Ringo can be heard to mutter something here on the final verse, right after Paul's \"she feels good\" line."
  ],
  "lyrics": "Good day sunshine\nGood day sunshine\nGood day sunshine\nI need to laugh, and when the sun is out\nI've got something I can laugh about\nI feel good, in a special way\nI'm in love and it's a sunny day\n\nGood day sunshine\nGood day sunshine\nGood day sunshine\nWe take a walk, the sun is shining down\nBurns my feet as they touch the ground\n\nGood day sunshine\nGood day sunshine\nGood day sunshine\nAnd then we lie, beneath a shady tree\nI love her and she's loving me\nShe feels good, she knows she's looking fine\nI'm so proud to know that she is mine\n\nGood day sunshine\nGood day sunshine\nGood day sunshine\nGood day sunshine\nGood day sunshine\nGood day sunshine\nGood day sunshine\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}