{
  "Artist": "The Beatles",
  "Album": "Sgt. Pepper's Lonely Hearts Club Band",
  "Title": "Good Morning Good Morning",
  "URL": "https://www.songfacts.com/facts/the-beatles/good-morning-good-morning",
  "Confidence": 1.0,
  "youtube-id": "LES8jMRYKJw",
  "facts": [
    "John Lennon watched a lot of TV. He wrote this after hearing \"Good Morning, Good Morning\" in an ad for Corn Flakes.",
    "The animal sounds were dubbed in from a sound effects disc. They were arranged in order of creatures capable of eating the one before, at Lennon's request.",
    "George Martin edited the chicken at the end to go right into the guitar of the Sgt. Pepper reprise. One of the innovations of the album was the songs blending together.",
    "Lennon: \"It's a throwaway, a piece of garbage.\"",
    "The lyrics, \"it's time for tea and Meet the Wife\" refer to the BBC sitcom Meet The Wife, starring Freddie Frinton and Thora Hird. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dan - Indianapolis, IN\n                                                  \n                                                  "
  ],
  "lyrics": "Nothing to do to save his life call his wife in\nNothing to say but what a day how's your boy been\nNothing to do it's up to you\nI've got nothing to say but it's okay\nGood morning, good morning\n\nGoing to work don't want to go feeling low down\nHeading for home you start to roam then you're in town\nEverybody knows there's nothing doing\nEverything is closed it's like a ruin\nEveryone you see is half asleep\nAnd you're on your own you're in the street\nGood morning, good morning\n\nAfter a while you start to smile now you feel cool\nThen you decide to take a walk by the old school\nNothing has changed it's still the same\nI've got nothing to say but it's okay\nGood morning, good morning\n\nPeople running round it's five o'clock\nEverywhere in town is getting dark\nEveryone you see is full of life\nIt's time for tea and meet the wife\nSomebody needs to know the time, glad that I'm here\nWatching the skirts you start to flirt now you're in gear\nGo to a show you hope she goes\nI've got nothing to say but it's okay\nGood morning, good morning\n                                                  \n                                                  Writer/s: JOHN LENNON, PAUL MCCARTNEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}