{
  "Artist": "The Beatles",
  "Album": "Revolver",
  "Title": "Got To Get You Into My Life",
  "URL": "https://www.songfacts.com/facts/the-beatles/got-to-get-you-into-my-life",
  "Confidence": 1.0,
  "youtube-id": "yJ8WI3Q9jm4",
  "facts": [
    "This beatific love song is actually about marijuana. Paul McCartney cleared this up in his 1998 book Many Years From Now when he explained that it was not about a particular person, but his desire to smoke pot. \"I'd been a rather straight working-class lad but when we started to get into pot it seemed to me to be quite uplifting,\" he said.\nThere are no obvious drug references in the song, so it appears to be about a guy who is blissfully in love:\nOoh, then I suddenly see you\nOoh, did I tell you I need you\nEvery single day of my life",
    "A British rock group called Cliff Bennett & The Rebel Rousers released this song as a single around the same time it appeared on The Beatles Revolver album. Bennett & The Rebel Rousers were an opening act for The Beatles on their European tour in early 1966; since there were no plans to release \"Got To Get You Into My Life\" as a single, Paul McCartney encouraged them to record it and produced the session.\nRevolver appeared on August 5, 1966 and the Cliff Bennett & The Rebel Rousers version of this song showed up on the UK chart for the first time on August 17, rising to #6 on September 21. It ended up being the biggest hit for the group, which made #9 in 1964 with \"One Way Love.\"",
    "Session musicians played trumpets and sax. It was the first time horns were used in a Beatles song.",
    "Earth, Wind & Fire recorded a funky new version for the 1978 movie Sgt. Pepper's Lonely Hearts Club Band. Beatles producer George Martin was in charge of the music, and the soundtrack was a success, but the movie, which starred Peter Frampton, The Bee Gees and Aerosmith, was a huge flop. Earth, Wind & Fire's version of this hit #9 in the US.",
    "The first group to chart with this song was Blood, Sweat & Tears, whose horn-heavy version made #62 in the summer of 1975. The Beatles version wasn't issued as a single until 1976, when Capitol Records issued it in America backed with \"Helter Skelter.\"\nThis version went to #7 in July that year, becoming the first Beatles song to chart in the US since 1970. Later in 1976, Capitol issued \"Ob-La-Di, Ob-La-Da,\" which made #49.",
    "John Lennon thought this was some of McCartney's best work.",
    "In the '60s, Joe Pesci was an aspiring singer known as Joe Ritchie. He recorded a version of this that can be found on Rhino's \"Golden Throat\" Series. His version merits the \"Stick to Acting\" award. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Barry Kesten - Bellmore, United States\n                                                  \n                                                  ",
    "This song rarely licensed for movies or TV. The only time the Beatles rendition was used in a film is the 2015 movie Minions, where it plays under the end credits. In 2009, a version by Matthew Sweet and Susanna Hoffs appeared in the Eddie Murphy movie Imagine That, and in 2013 Kurt Hummel and Chris Colfer sang it on the \"Love, Love, Love\" episode of the TV series Glee."
  ],
  "lyrics": "I was alone, I took a ride\nI didn't know what I would find there\nAnother road where maybe I\nCould see another kind of mind there\nOoh, then I suddenly see you\nOoh, did I tell you I need you\nEvery single day of my life\n\nYou didn't run, you didn't hide\nAnd had you gone, you knew in time\nWe'd meet again for I had told you\nOoh, you were meant to be near me\nOoh, and I want you to hear me\nSay we'll be together every day\nGot to get you into my life\n\nWhat can I do, what can I be\nWhen I'm with you I want to stay there\nIf I'm true I'll never leave\nAnd if I do I know the way there\nOoh, then I suddenly see you\nOoh, did I tell you I need you\nEvery single day of my life\nGot to get you into my life\n\nI was alone, I took a ride\nI didn't know what I would find there\nAnother road where maybe I\nCould see another kind of mind there\nOoh, then I suddenly see you\nOoh, did I tell you I need you\nEvery single day\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}