{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "Happiness is a Warm Gun",
  "URL": "https://www.songfacts.com/facts/the-beatles/happiness-is-a-warm-gun",
  "Confidence": 1.0,
  "youtube-id": "8rTb_ghUbtg",
  "facts": [
    "The title came from an article in The American Rifleman, a magazine published by the National Rifle Association. The story was titled \"Happiness Is A Warm Gun.\" In it, the author recalls the special time when he took his 7-year-old son shooting for the first time. It struck John Lennon as \"fantastic, insane… a warm gun means you've just shot something.\" Said Lennon, \"I thought it was so crazy that I made a song out of it.\"",
    "This complicated song, which involved various different time signatures, (the 6/8 middle section was made more convoluted by Ringo continuing to drum in 4/4), took 15 hours and over 100 takes to nail. The first half of one take was combined with the second half of another to form the complete song.",
    "Like the composer Wagner, Lennon felt that a song must have increasing excitement, climax and redemption. The song is built from pieces of several different little songs, with different melodies and rhythms, and one after another, the excitement is increasing. The climax is the falsetto, and finally the redemption is in the continuing call and answer.\nWhen The White Album was released in 1968, it was not commonly known that Lennon was a composer, as many people thought that he was only a lyric writer. After The Beatles broke up, their individual songwriting contributions were revealed in greater detail. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, who is a music historian in Stockholm\n                                                  \n                                                  ",
    "Lennon said of this song: \"It's sort of a history of rock 'n' roll.\" Much of the imagery in the lyrics is about his sexual passion for Yoko.",
    "Lennon considered this one of his favorites. It's also Paul McCartney's favorite song on The White Album.",
    "In the last section of the song, the backing vocals are \"Bang, Bang, Shoot, Shoot.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dan - Riverside, CT\n                                                  \n                                                  ",
    "A popular theory is that Lennon meant for this to be a drug metaphor for doing heroin:\n\"Needing a fix\"\n\"Jump the gun\" - meaning to cook it up\n\"Bang, Bang, SHOOT, SHOOT\"\n\"When I hold you in my arm, nobody can do me no harm\" - heroin addicts tell how when you're on it, nothing can do you no harm and Lennon's overall nature seem to point to this \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Matt - Edgewood, KY\n                                                  \n                                                  ",
    "This was banned by the BBC for sexual symbolism. They thought the gun was a phallic symbol.",
    "The original line \"When I hold you in my arms and feel my finger on your trigger...\" appears in unreleased, bootlegged versions of \"I'm So Tired\" as \"When I hold you in your arms, when you show me each one of your charms, I wonder should I get up, and go to the funny farm.\" This could mean the line was originally sexual but was put in as a metaphor for a gun later on. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Conrad - Los Angeles, CA\n                                                  \n                                                  ",
    "The final doo-wop chorus of this song has the exact same chord progression as \"This Boy,\" just in a different key.",
    "The phrase \"happiness is a warm gun\" is a play on a Peanuts comic strip from 1960 where Lucy hugs Snoopy and says, \"Happiness is a warm puppy.\" That phrase became a popular slogan, appearing on mugs, T-shirts and lots of other merch.",
    "Tori Amos covered this on her 2001 album Strange Little Girls. All the songs on the album were written by men - Amos took on different characters to interpret them from a woman's point of view. Yoko Ono had to approve this, and she did.",
    "The Breeders covered this on their 1990 album Pod. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Melissa - Madrid, IA\n                                                  \n                                                  ",
    "This is the song that inspired 2Pac to cast his gun as his girlfriend in \"Me and My Girlfriend\": \"She's the only woman I need!\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "She's not a girl who misses much\nDo do do do do do, oh yeah\nShe's well-acquainted with the touch of the velvet hand\nLike a lizard on a window pane\nThe man in the crowd with the multicolored mirrors\nOn his hobnail boots\nLying with his eyes while his hands are busy\nWorking overtime\nA soap impression of his wife which he ate\nAnd donated to the National Trust\n\nI need a fix 'cause I'm going down\nDown to the pits that I left uptown\nI need a fix 'cause I'm going down\n\nMother Superior jumped the gun\nMother Superior jumped the gun\nMother Superior jumped the gun\nMother Superior jumped the gun\nMother Superior jumped the gun\nMother Superior jumped the gun\n\nHappiness is a warm gun (bang, bang, shoot, shoot)\nHappiness is a warm gun, momma (bang, bang, shoot, shoot)\n\nWhen I hold you in my arms (ooh, oh, yeah)\nAnd I feel my finger on your trigger (ooh, oh, yeah)\nI know nobody can do me no harm (ooh, oh, yeah)\nBecause\n\n(Happiness) is a warm gun momma (bang, bang, shoot, shoot)\nHappiness is a warm gun, yes it is (bang, bang, shoot, shoot)\nHappiness is a warm, yes it is, gun (happiness, bang, bang, shoot, shoot)\nWell, don't you know that happiness is a warm gun momma?\n(Happiness is a warm gun, yeah)\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}