{
  "Artist": "The Beatles",
  "Album": "Help!",
  "Title": "Help!",
  "URL": "https://www.songfacts.com/facts/the-beatles/help",
  "Confidence": 1.0,
  "youtube-id": "2Q_ZzBGPdqE",
  "facts": [
    "This was used as the title song to Beatles' second movie. The original title to the song and the movie was \"Eight Arms To Hold You,\" and the first copies of the single said it was from the movie \"Eight Arms to Hold You.\"",
    "John Lennon has described this time of his life as his \"fat Elvis period.\" In a 1971 interview with Rolling Stone, Lennon said this is one of his favorite Beatles records, because, \"I meant it - it's real.\" He added: \"The lyric is as good now as it was then. It is no different, and it makes me feel secure to know that I was that aware of myself then. It was just me singing 'Help' and I meant it.\"\nPaul McCartney helped Lennon write the song, but did not realize it was actually Lennon calling for help until years later.",
    "Along with \"Yesterday,\" this is one of two Beatles US #1 hits with just one word in the title.",
    "The Beatles sped up the tempo to make it more commercial; Lennon intended it as a slow song.",
    "The song runs just 2:18, but packs in 267 words, making it one of the most lyrically dense hits of the era. It starts and ends on a vocal, and there are two vocal lines running throughout the song, as John Lennon sings lead while George Harrison and Paul McCartney do backgrounds, singing some of the same phrases either before or after Lennon. There are only a few seconds in the song where somebody isn't singing.",
    "In 1985, this became the first Beatles song ever used in a commercial when it was used in an ad for Ford cars. Ford paid $100,000 for it, but they didn't get the rights to the original recording - the version in the commercial was performed by a soundalike group.",
    "The Beatles banged out a music video for this song (four others were shot the same day) so they could distribute it to television stations in lieu of personal appearances. In typical Beatles fashion, it is an irreverent clip, with Ringo Starr using an umbrella to protect from fake snow.",
    "John Lennon played rhythm guitar on this track using a 12-string acoustic.",
    "The Help! movie was used by The Monkees to prepare for their TV series. The Beatles showed off their individual personalities in their movies, which The Monkees made sure to emulate. By not presenting all members of the band as identical, it made the Beatles even more popular, as many of their fans picked a favorite.",
    "John Lennon reached into his falsetto when he repeated the word \"please\" in the line, \"Won't you please, please help me?\" Strategic falsetto was one of the group's favorite techniques, dating back to their early hit \"From Me to You.\" Lennon also used it on \"Revolution.\"",
    "The lyrics appear to be addressed to another person, but they could also be seen as being addressed to a mind-altering substance. There are lots of clues in the lyrics but the major ones are, \"I've changed my mind\" and \"I've opened up the doors\" as in The Doors Of Perception, which is the title of a book by Aldous Huxley about his mind altering experiences with mescaline. The title is taken from a quote of William Blake's, \"If the doors of perception were cleansed everything would appear to man as it is, infinite.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ed - Perth, Australia\n                                                  \n                                                  ",
    "Originally, the album cover showed The Beatles spelling out the word \"Help\" using the semaphore system of communicating with flags, which was usually used by ships. The photographer, Robert Freeman, didn't like the pose because it looked unbalanced, so he had them hold the flags in a way that looked good, but spelled N-U-J-V. Only those who understood semaphore noticed.",
    "Artists who covered this song include Bananarama, Count Basie, Tommy Castro, The Charles River Valley Boys, The Crusaders, The Damned, Howie Day, DC Talk, Deep Purple, Extreme, Jad Fair, John Farnham, Jose Feliciano, The Four Tops, Henry Gross, John's Children, R. Stevie Moore, The Newbeats, Dolly Parton, David Porter, Isaac Scott, Peter Sellers, Michael Stanley, The Tremeloes, Tina Turner, U2 and Caetano Veloso. \nThe Carpenters, who named their first album Ticket To Ride and issued \"that song\" as their first single, included \"Help!\" on their second album, Close to You. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France, for above 2\n                                                  \n                                                  ",
    "Deep Purple recorded this on a demo that helped them get a record deal in 1968.",
    "In 2018, Google used a soundalike version in commercials as part of their \"Helping You Every Day\" campaign. In 2019, they started running a new version using the original Beatles recording of the song. At one point in the spot, someone takes a picture of the Help! album cover with an iPhone, which identifies it and provides a snippet of information."
  ],
  "lyrics": "Help, I need somebody\nHelp, not just anybody\nHelp, you know I need someone, help\n\nWhen I was younger, so much younger than today\nI never needed anybody's help in any way\nBut now these days are gone, I'm not so self assured\nNow I find I've changed my mind and opened up the doors\n\nHelp me if you can, I'm feeling down\nAnd I do appreciate you being round\nHelp me get my feet back on the ground\nWon't you please, please help me\n\nAnd now my life has changed in oh so many ways\nMy independence seems to vanish in the haze\nBut every now and then I feel so insecure\nI know that I just need you like I've never done before\n\nHelp me if you can, I'm feeling down\nAnd I do appreciate you being round\nHelp me get my feet back on the ground\nWon't you please, please help me\n\nWhen I was younger, so much younger than today\nI never needed anybody's help in any way\nBut now these days are gone, I'm not so self assured\nNow I find I've changed my mind and opened up the doors\n\nHelp me if you can, I'm feeling down\nAnd I do appreciate you being round\nHelp me get my feet back on the ground\nWon't you please, please help me, help me, help me, oh\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Downtown Music Publishing, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-70.jpg",
    "facts": "On the Help! album cover, the Beatles are really spelling out N-U-J-V, but aside from a few sea captains, nobody knows that. They're using semaphore, a system for signaling with flags.You can see why they didn't spell out H-E-L-P - there is a huge gap between the H and the E, which no visual artist would stand for. The solution: have them hold the flags in an aesthetically pleasing manner, no matter what it spells."
  }
}