{
  "Artist": "The Beatles",
  "Album": "CD2 - The Beatles",
  "Title": "Helter Skelter",
  "URL": "https://www.songfacts.com/facts/the-beatles/helter-skelter",
  "Confidence": 1.0,
  "youtube-id": "vWW2SzoAXMo",
  "facts": [
    "Paul McCartney wanted to write the \"loudest, nastiest, sweatiest rock number we could\" after reading a Pete Townshend interview describing a Who track (possibly \"I Can See For Miles\") as \"The most raucous rock 'n' roll, the dirtiest thing they'd ever done.\" This was the result. Some historians of popular music now believe that this song was a key influence on the development of heavy metal.\nMcCartney told Mojo magazine October 2008: \"Just reading those lines (of the Townshend interview) fired my imagination. I thought, Right, they've done what they think was the loudest and dirtiest; we'll do what we think. I went into the studio and told the guys, 'Look, I've got this song but Pete said this and I want to do it even dirtier.' It was a great brief for the engineers, for everyone- just as fuzzy and as dirty and as loud and as filthy as you can get it is where I want to go. I was happy to have Pete's quote to get me there.\"",
    "The first version was a 27-minute jam that was never released. During the July 18, 1968 sessions, The Beatles recorded this version, which was much slower and much more tame than the album version. Another recording from the same day was edited down to 4:37 for The Beatles Anthology, Volume III. For the album version, recorded September 9, 21 takes of approximately 5 minutes each were recorded, and the last one is featured on the official LP.",
    "In December 1968, Charles Manson heard this song, as well as others from The White Album, and interpreted them as a warning of an approaching race war. He saw the Beatles as the four angels mentioned in the New Testament book of Revelation and believed their songs were telling him and his followers to prepare themselves. Manson referred to this future war as \"Helter Skelter,\" and tried to ignite it by sending his followers to invade two homes and murder the inhabitants, making it look like the work of the Black Panthers.\nThe word \"Pig\" was written in blood at the crime scenes, and the phrase \"Healter Skelter\" (a misspelling of the Beatles song) was scrawled at the second home, the one belonging to The Labiancas. \nBecause of this connection, Los Angeles assistant District Attorney Vincent Bugliosi, who led the prosecution of Manson and the other killers, named his best-selling book about the murders Helter Skelter. Bugliosi's book was the basis for a film of the same title.\nIn an interview with Lennon in the January 1971 edition of Rolling Stone, the former Beatle was asked about his reaction to Manson's deluded interpretation of this song. Lennon replied: \"He's balmy, like any other Beatle-kind of fan who reads mysticism into it. We used to have a laugh about this, that or the other, in a light-hearted way, and some intellectual would read us, some symbolic youth generation wants to see something in it. We also took seriously some parts of the role, but I don't know what 'Helter Skelter' has to do with knifing somebody. I've never listened to the words, properly, it was just a noise.\"\nAs for Manson, he disputed Bugliosi's interpretation of the Helter Skelter theory he used to prosecute the case, telling Rolling Stone, \"that doesn't even make insane sense.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Mountlake Terrace, Washington, for above 2\n                                                  \n                                                  ",
    "Ringo played the drums so forcefully that his shout of \"I've got blisters on my fingers!\" accompanies the musical fadeout. Ringo explained what happened in The Miami Herald June 29, 2008: \"The track was actually very long, and we were just pounding. It was a jam, really, it turned into that. And at the end, the only way off the kit was, 'Look, my fingers are bleeding, and I just have to get up.' And I decided to shout it.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n William - Miami, FL\n                                                  \n                                                  ",
    "The song is named after a slide at a British amusement park. The first line is a joke about this: \"When I get to the bottom I go back to the top of the slide, where I stop and I turn and I go for a ride.\"",
    "The Beatles were usually quite cerebral in the studio, but the session for this one was particularly raucous. They were always willing to experiment with different sounds and styles, which led to an eclectic catalog. \"When I look back on what we had produced, there are no two songs that are alike,\" Paul McCartney told GQ in 2018. \"A lot of record artists would find a great formula and the next three singles are kind of the same song, but we were young guys and we would've got bored doing that, and the worst thing ever would've been just to sit around bored. So, we always changed whatever we were about to do and did something different. So, I had this 'Helter Skelter' thing, and we did that. And yeah, it is pretty raw, it is pretty screamy, but it was good to do.\"",
    "Don McLean mentions this in his song \"American Pie\" (\"Helter Skelter in a summer swelter\"), a rather clear reference to the Manson family killing spree. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Mountlake Terrace, WA. U.S.A\n                                                  \n                                                  ",
    "In 2006, McCartney played this on the Grammy Awards. It was the first time he performed on the Grammys. On his 2010 tour, McCartney included it on the setlist. McCartney's lead guitarist Rusty Anderson explained how it got in the set: \"I was working on Paul for 'Helter Skelter' since the first time we played the Super Bowl, before we even went on tour (in 2002 A.D.). I said 'Hey, y'know what would be a really rad song to play, Paul?' He said 'what?' I said 'Helter Skelter,' and he goes (imitates McCartney) 'Oh, yeah' (laughs). It took him a while to warm up to it. And we kept prodding him and prodding him and he put it in the set -- but we still hadn't rehearsed it. We said, 'Paul are we gonna rehearse 'Helter Skelter?' And finally we did it... and I remember playing it at rehearsal and some of the pre-show dancers started coming out and dancing and rocking to it and all of a sudden he started realizing how great it is.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n DeeTheWriter - Saint Petersburg, Russia Federation\n                                                  \n                                                  "
  ],
  "lyrics": "When I get to the bottom I go back to the top of the slide\nWhere I stop and I turn and I go for a ride\nTill I get to the bottom and I see you again\n\nDo, don't you want me to love you\nI'm coming down fast but I'm miles above you\nTell me, tell me, tell me, come on tell me the answer\nWell, you may be a lover but you ain't no dancer\n\nHelter skelter, helter skelter\nHelter skelter\n\nWill you, won't you want me to make you\nI'm coming down fast but don't let me break you\nTell me, tell me, tell me the answer\nYou may be a lover but you ain't no dancer\n\nLook out\nHelter skelter, helter skelter\nHelter skelter\nLook out, 'cause here she comes\n\nWhen I get to the bottom I go back to the top of the slide\nAnd I stop and I turn and I go for a ride\nAnd I get to the bottom and I see you again, yeah, yeah\n\nWell do you, don't you want me to make you\nI'm coming down fast but don't let me break you\nTell me, tell me, tell me your answer\nYou may be a lover but you ain't no dancer\n\nLook out\nHelter skelter, helter skelter\nHelter skelter\n\nLook out, helter skelter\nShe's coming down fast\nYes, she is\nYes, she is\nComing down fast\n\n(I've got blisters on my fingers)\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-169.jpg",
    "facts": "Helter Skelter is the name for this ride in South Wales.Recorded July 18th. 1968, Remake September 9th. 1968. The working lyric of the song was briefly \"Heather Leather.\"The song opens abruptly with a loud, repeated, distorted guitar chord. McCartney then screams the introductory lyric and the full band joins in as the refrain is introduced. The tone of the song is aggressive and frightening and the music seems ready to turn into meaningless noise at any moment. The lyrics of the song are a hallucinogenic evocation of using a helter skelter in a children's playground, ironically contrasting the aggression and volume of the music."
  }
}