{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Her Majesty",
  "URL": "https://www.songfacts.com/facts/the-beatles/her-majesty",
  "Confidence": 1.0,
  "youtube-id": "Mh1hKt5kQ_4",
  "facts": [
    "Originally intended to be an actual tribute to the Queen of England, this song was supposed to be placed in between \"Mean Mr. Mustard\" and \"Polythene Pam\" on the side two Abbey Road medley, but Paul McCartney had it removed because he didn't like it. Abbey Road studios engineer John Kurlander explains: \"We did all the remixes and cross-fades to overlap the songs, Paul was there, and we heard it together for the first time. He said 'I don't like 'Her Majesty,' throw it away,' so I cut it out - but I accidentally left in the last note. He said, 'It's only a rough mix, it doesn't matter,' in other words, don't bother abut making a clean edit because it's only a rough mix. I'd been told never to throw anything away, so after he left, I picked it up off the floor, put about twenty seconds of red leader tape before it and stuck it onto the end of the edit tape. The next day, down at Apple, Malcolm Davies cut a playback lacquer of the whole sequence and, even though I'd written on the box that 'Her Majesty' was unwanted, he too thought, 'Well, mustn't throw anything away, I'll put it on at the end.' I'm only assuming this, but when Paul got that lacquer he must have liked hearing 'Her Majesty' tacked on the end... We never remixed 'Her Majesty' again, that was the mix which ended up on the finished LP. This is why 'Her Majesty' doesn't have a final guitar chord - it lays unheard, at the beginning of 'Polythene Pam.' And the jarring electric guitar chord that begins 'Her Majesty' is actually from the end of the original 'Mean Mr. Mustard.'\"",
    "This is the shortest Beatles song. It is 23 seconds long.",
    "McCartney recorded this before the other Beatles arrived in the studio.",
    "There were no references to this song on the first pressings of the Abbey Road LP, not even on the record label. It's generally agreed that the unlisted song on the earlier pressings was the first ever hidden track to grace the world of rock."
  ],
  "lyrics": "Her Majesty's a pretty nice girl,\nBut she doesn't have a lot to say\nHer Majesty's a pretty nice girl\nBut she changes from day to day\n\nI want to tell her that I love her a lot\nBut I gotta get a bellyful of wine\nHer Majesty's a pretty nice girl\nSomeday I'm going to make her mine, oh yeah,\nSomeday I'm going to make her mine.\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}