{
  "Artist": "The Beatles",
  "Album": "Revolver",
  "Title": "Here, There And Everywhere",
  "URL": "https://www.songfacts.com/facts/the-beatles/here-there-and-everywhere",
  "Confidence": 1.0,
  "youtube-id": "CHLQs6u9wXw",
  "facts": [
    "Paul McCartney wrote this song while he was lounging at John Lennon's pool. It was at least partly inspired by The Beach Boys' song \"God Only Knows.\" McCartney was asked in 1990 about the influence of The Beach Boys on this song by Brian Wilson biographer David Leaf. Said Paul: \"It's actually just the introduction that's influenced. John and I used to be interested in what the old fashioned writers used to call the verse, which we nowadays would call the intro - this whole preamble to a song, and I wanted to have one of those on the front of 'Here, There and Everywhere.' John and I were quite into those from the old-fashioned songs that used to have them, and in putting that [sings \"To lead a better life\"] on the front of 'Here, There and Everywhere,' we were doing harmonies, and the inspiration for that was the Beach Boys. We had that in our minds during the introduction to 'Here, There and Everywhere.'I don't think anyone, unless I told them, would even notice, but we'd often do that, get something off an artist or artists that you really liked and have them in your mind while you were recording things, to give you the inspiration and give you the direction - nearly always, it ended up sounding more like us than them anyway.\"",
    "John Lennon and Paul McCartney both mentioned this as one of the most underrated Beatles songs. In 2005 interviews, McCartney said that of all the songs he has written, this is his favorite. He likes it best because of the way that it flows together, comparing it to the style of the Fred Astaire hit \"Cheek To Cheek,\" one of his favorite songs. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Kristina - small town, NE\n                                                  \n                                                  ",
    "McCartney was trying to sing this like Marianne Faithfull, a popular singer in the '60s who was Mick Jagger's girlfriend. He would often approach a song from the perspective of a singer he admired; on \"Lady Madonna,\" he evoked Fats Domino.",
    "McCartney drew lyrical inspiration from the additional press coverage he was getting since he started going out with actress Jane Asher. At the time, McCartney may have been the most eligible bachelor on the planet, and it was a big deal when he began dating Asher, who acted in various stage productions and appeared in the movie Alfie. They broke up in 1968.",
    "McCartney played this in the opening sequence of his 1984 movie Give My Regards to Broad Street. After this scene, the movie goes pretty much downhill, following McCartney as he tries to recover missing master tapes.",
    "The self-taught guitar prodigy George Benson covered this on this on this 1989 album Tenderly. Benson's arrangement features orchestral strings and a solo piano intro. Emmylou Harris also covered the song in 1976.",
    "The Beatles never performed this song live, and McCartney didn't perform it until his 1991 acoustic appearance on MTV's Unplugged. He later played it on his 2002 Back In The US tour, where he added an accordion to the arrangement.",
    "This was influenced by both the Great American Songbook and Brazilian music. \"That song was coming off a lot of things,\" McCartney told Mojo magazine in 2012. \"At the time there was Brazilian music coming in - Joao Gilberto recorded 'Fool on the Hill' (McCartney may be thinking of Sergio Mendes & Brasil 66's pop bossa version). There was cross-fertilisation going on. You'd hear it and think how lovely those Brazilian chords were, so you'd work it into something else. At the same time I found myself really loving all these old songs and trying to write something that was comparable in skill and structure.\"",
    "According to Paul McCartney, John Lennon only praised his songwriting once. Speaking in 2018 as part of a 60 Minutes profile interview for CBS, Macca disclosed it was \"Here, There And Everywhere\" that prompted the rare Lennon compliment. He recalled: \"John says just as it finishes, 'That's a really good song, lad. I love that song.' And I'm like, 'Yes! He likes it!'\""
  ],
  "lyrics": "To lead a better life\nI need my love to be here\n\nHere, making each day of the year\nChanging my life with a wave of her hand\nNobody can deny that there's something there\nThere, running my hands through her hair\nBoth of us thinking how good it can be\nSomeone is speaking, but she doesn't know he's there\n\nI want her everywhere\nAnd if she's beside me I know I need never care\nBut to love her is to need her everywhere\nKnowing that love is to share\nEach one believing that love never dies\nWatching their eyes and hoping I'm always there\n\nI want her everywhere\nAnd if she's beside me I know I need never care\nBut to love her is to need her everywhere\nKnowing that love is to share\nEach one believing that love never dies\nWatching their eyes and hoping I'm always there\n\nI will be there\nAnd everywhere\nHere, there and everywhere\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}