{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Here Comes The Sun",
  "URL": "https://www.songfacts.com/facts/the-beatles/here-comes-the-sun",
  "Confidence": 1.0,
  "youtube-id": "KQetemT1sWc",
  "facts": [
    "George Harrison wrote this in Eric Clapton's garden using one of Clapton's acoustic guitars. When the Beatles' manager Brian Epstein died in 1967, the band had to handle more of their accounting and business affairs, which Harrison hated. He wrote \"Here Comes The Sun\" after attending a round of business meetings. This song was inspired by the long winters in England which Harrison thought went on forever.\n\"It was just sunny and it was all just the release of that tension that had been building up on me,\" Harrison said in a 1969 BBC Radio interview. \"It was just a really nice sunny day, and I picked up the guitar, which was the first time I'd played the guitar for a couple of weeks because I'd been so busy. And the first thing that came out was that song. It just came. And I finished it later when I was on holiday in Sardinia.\"",
    "In the documentary The Material World, Eric Clapton talked about writing this song with Harrison: \"It was one of those beautiful spring mornings. I think it was April, we were just walking around the garden with our guitars. I don't do that, you know? This is what George brought to the situation. He was just a magical guy... we sat down at the bottom of the garden, looking out, and the sun was shining; it was a beautiful morning, and he began to sing the opening lines and I just watched this thing come to life.\"",
    "The music begins on the left channel and gradually moves to the right as Harrison's vocal begins.",
    "The instrumental break is similar to \"Badge,\" which Harrison helped Clapton write for his band Cream.",
    "John Lennon did not play on this. Around this time, he was making a habit of not playing on Harrison's compositions as the two were not on the best of terms. The two eventually settled their differences as George contributed quite a bit to Lennon's album Imagine two years later. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Harrison sang lead vocals, played acoustic guitar and used his newly acquired Moog synthesizer on this track. It was one of the first pop songs to feature a Moog.",
    "The Beatles had stopped touring by the time they recorded this song, so they never played it live. The first time Harrison played it live was at the 1971 Concert for Bangla Desh, which he organized to bring aid to that country. He played it at a handful of appearances in the '70s and '80s, but didn't perform it on a tour until 1991, when he joined Eric Clapton for 12 shows in Japan. This version can be heard on the album Live in Japan.\nAt the Concert for Bangla Desh, Harrison brought Badfinger lead singer Pete Ham to the front of the stage to sing it with him. Badfinger was signed to The Beatles' Apple Records and had a hit months earlier with \"No Matter What.\" Harrison had them play on his first post-Beatles solo album, All Things Must Pass, in 1970, and used them as backing musicians at the concert. The Badfinger story, though, had a tragic ending. As Apple Records disintegrated, the group left the label and ended up in legal wranglings that left them angry and broke. Ham committed suicide in 1975.",
    "In 1976, a cover by Steve Harley and Cockney Rebel was a #10 hit in the UK.",
    "Richie Havens covered this in 1971. The Beatles' version never charted, but his hit #16 in the US. Havens told DISCoveries magazine in 1994: \"Fortunately, I can sing things that changed my mind and gave me articulation, like the songs of The Beatles. What they did was, they presented the language we speak in a very straightforward way. The images were totally clear. The influence of clarity – that was the whole influence of the British Invasion.\"\nOther popular covers were recorded by Nina Simone and Peter Tosh.",
    "On November 20, 1976, Harrison performed this with Paul Simon on Saturday Night Live. On a previous show, producer Lorne Michaels offered The Beatles $3,000 (union minimum), to show up and perform. He said they could split it up any way they wanted, giving Ringo less if they felt like it. Lennon and McCartney were watching together in New York at the time and almost went. On the show when Harrison performed this, there is a skit where he is arguing with Michaels over the money. Michaels tries to explain that the $3000 was for the whole group, and he would have to accept less.",
    "When Harrison died in 2001, many artists performed this at their concerts as a tribute. It was played at the induction ceremonies of the Rock and Roll Hall of Fame as part of the all-star jam.",
    "George Harrison played a guitar solo that was placed at 1:02 into the song, but didn't make the final cut. Here's the clip where George Martin and Dhani Harrison listen to it.",
    "Harrison released a follow-up song called \"Here Comes The Moon\" on his self-titled 1979 album. That song is a tribute to the moon, the \"sun's little brother\" that acts like a mirror in the sky, reflecting our light.",
    "In 2006, this was voted by the members of the GeorgeHarrison.com forum as their favorite song of his.",
    "Take That's Gary Barlow covered this for a 2012 advert for Marks and Spencer. It was the first song he'd recorded as a solo artist since his sophomore album, Twelve Months, Eleven Days in 1999. He said: \"It's a real a privilege to cover such an iconic track. You can't better perfection but I hope we've given it a modern twist that will capture the mood of the nation and provide the perfect anthem for summer 2012.\" The song's exposure on the commercial resulted in the original Beatles recording charting in the UK singles top 75 for the first time.",
    "Paul McCartney was also feeling the pain from Beatles' business dealings around this time and wrote his own, far more pessimistic, song about it: \"You Never Give Me Your Money,\" which was also included on Abbey Road.",
    "Tom Petty, who was Harrison's good friend and played with him in the Traveling Wilburys, said of this song in Rolling Stone: \"No piece of music can make you feel better than this. It's such an optimistic song, with that little bit of ache in it that makes the happiness mean even more.\"",
    "At the 2016 Republican National Convention, Ivanka Trump, speaking before her father Donald took the stage, emerged with this song playing. The Harrison estate was not happy and voiced their displeasure on Twitter: \"The unauthorized use of #HereComestheSun at the #RNCinCLE is offensive & against the wishes of the George Harrison estate. If it had been Beware Of Darkness, then we MAY have approved it!\"",
    "Naya Rivera and Demi Lovato sang this on the 2013 Glee episode \"Tina in the Sky with Diamonds.\"",
    "Nina Simone's version was used on the TV series Scandal in the 2015 episode \"You Can't Take Command.\"",
    "When The Beatles' music was finally made available for download on iTunes in 2010, \"Here Comes The Sun\" was the top-selling song the first week.",
    "During the 2020 coronavirus pandemic, many found solace in this song. Some hospitals would play the song when a patient was discharged."
  ],
  "lyrics": "Here comes the sun (doo doo doo)\nHere comes the sun, and I say\nIt's all right\n\nLittle darling, it's been a long cold lonely winter\nLittle darling, it feels like years since it's been here\n\nHere comes the sun (doo doo doo)\nHere comes the sun, and I say\nIt's all right\n\nLittle darling, the smiles returning to the faces\nLittle darling, it seems like years since it's been here\n\nHere comes the sun\nHere comes the sun, and I say\nIt's all right\n\nSun, sun, sun, here it comes\nSun, sun, sun, here it comes\nSun, sun, sun, here it comes\nSun, sun, sun, here it comes\nSun, sun, sun, here it comes\n\nLittle darling, I feel that ice is slowly melting\nLittle darling, it seems like years since it's been clear\nHere comes the sun\nHere comes the sun, and I say\nIt's all right\n\nHere comes the sun (doo doo doo)\nHere comes the sun\nIt's all right\nIt's all right\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: CONCORD MUSIC PUBLISHING LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-197.jpg",
    "facts": "London's Chelsea Flower Show in May 2008 featured a display dedicated to the late George Harrison. The \"quiet Beatle\" was an avid gardener, so the tribute was a fitting one. Ringo Starr, producer George Martin, Harrison's widow, Olivia and Queen's Brian May were among the rock royalty on hand for the opening of \"From Life to Life, a Garden for George.\" The garden's centerpiece was a large star bearing the words, \"Sun, sun, sun, here it comes.\""
  }
}