{
  "Artist": "The Beatles",
  "Album": "CD2 - The Beatles",
  "Title": "Honey Pie",
  "URL": "https://www.songfacts.com/facts/the-beatles/honey-pie",
  "Confidence": 1.0,
  "youtube-id": "jfuYPzwUk6g",
  "facts": [
    "This song was a pastiche of the classic 1940's swing and sentimental ballads written by Cole Porter, Irving Berlin or Sammy Cahn. Paul McCartney explained in Barry Miles' biography of the Beatle, Many Years From Now: \"Both John and I had a great love for music hall I very much liked that old crooner style - the strange fruity voice that they used, so 'Honey Pie' was me writing one of them to an imaginary woman, across the ocean, on the silver screen, who was called Honey Pie. It's another of my fantasy songs. We put a sound on my voice to make it sound like a scratchy old record. So it's not a parody, it's a nod to the vaudeville tradition that I was raised on.\"",
    "John Lennon played lead guitar, George Harrison bass. During the White Album sessions, The Beatles often recorded in separate studios recording different parts. One would be doing vocals for a song while the other would do horns or guitar in a different studio. George Martin's assistant Chris Thomas ended up doing much of the work because Martin couldn't be in two places at once. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Christine - Golden, CO\n                                                  \n                                                  ",
    "Scratches were added to an opening line from an old 78 RPM record to give a dated feel.",
    "Beatles producer George Martin scored the brass and woodwind arrangement."
  ],
  "lyrics": "She was a working girl\nNorth of England way\nNow she's hit the big time\nIn the U.S.A.\nAnd if she could only hear me\nThis is what I'd say\n\nHoney pie, you are making me crazy\nI'm in love but I'm lazy\nSo won't you please come home\n\nOh honey pie, my position is tragic\nCome and show me the magic\nOf your Hollywood song\n\nYou became a legend of the silver screen\nAnd now the thought of meeting you\nMakes me weak in the knee\n\nOh honey pie, you are driving me frantic\nSail across the Atlantic\nTo be where you belong\n\nWill the wind that blew her boat\nAcross the sea\nKindly send her sailing back to me\n\nHoney pie, you are making me crazy\nI'm in love but I'm lazy\nSo won't you please come home\n                                                  \n                                                  Writer/s: JOHN LENNON, PAUL MCCARTNEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Songtrust Ave\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}