{
  "Artist": "The Beatles",
  "Album": "Revolver",
  "Title": "I'm Only Sleeping",
  "URL": "https://www.songfacts.com/facts/the-beatles/im-only-sleeping",
  "Confidence": 1.0,
  "youtube-id": "bfDrF9s27ec",
  "facts": [
    "John Lennon wrote this as a tribute to staying in bed, which he liked to do even when he wasn't sleeping.\nThe song is discussed in the DVD Composing the Beatles Songbook where they mention a theory that it's John's attack on \"straight society,\" but conclude that the song IS about sleeping. John loved laying around in bed, sleeping, reading, watching telly or lovemaking. Didn't matter. He loved being in bed.\nMaureen Cleave wrote of John Lennon: \"He can sleep almost indefinitely, is probably the laziest person in England.\" She clarifies that she means physically lazy, not intellectually lazy.",
    "The yawning effect is a guitar recorded backward. A few seconds before the yawn comes in, you can hear John Lennon say, \"Yawn Paul.\"",
    "Perhaps the greatest legacy to this song was the famous \"bed-in\" protests staged by John Lennon and Yoko Ono. They invented the term as a derivative of \"sit-in\" protests. Their first was in March of 1969, subsequent to their marriage, in which they invited the press into their motel room while they advocated for world peace. Others soon copied the motif. It does bring to mind the old quote (variously attributed) \"All man's miseries derive from not being able to sit in a quiet room alone.\" Hey, if you stay in bed, you're not out fighting wars and making the world an uncool place, and if you've got someone with you, you're promoting more love in the world, right?",
    "Musically, \"I'm Only Sleeping\" is known for its backwards guitar. It was conceived by George Harrison in a late-night session, inspired when a studio engineer accidentally flipped a tape and Harrison was amazed at the effect and decided to \"do it for real.\" So he wrote down a solo and then played it twice, once forwards and once backwards, with fuzz effects on one track.",
    "This song also marks the embracing of pure psychedelic music by The Beatles, as do the majority of tracks on the Revolver album. The lyric about \"keeping an eye on the world going by my window\" also gets called back later in Lennon's later solo hit \"Watching The Wheels,\" which is also about passively being entertained by the busy goings-on of the world.",
    "American audiences got to hear this first, as it was included on the Yesterday... And Today album in June 1966. When Revolver was issued in August, this song was left off American pressings. This was also the case with \"Doctor Robert\" and \"And Your Bird Can Sing.\""
  ],
  "lyrics": "When I wake up early in the morning\nLift my head, I'm still yawning\nWhen I'm in the middle of a dream\nStay in bed, float up stream (float up stream)\n\nPlease, don't wake me, no, don't shake me\nLeave me where I am, I'm only sleeping\n\nEverybody seems to think I'm lazy\nI don't mind, I think they're crazy\nRunning everywhere at such a speed\n'Til they find there's no need (there's no need)\n\nPlease, don't spoil my day, I'm miles away\nAnd after all I'm only sleeping\n\nKeeping an eye on the world going by my window\nTaking my time\n\nLying there and staring at the ceiling\nWaiting for a sleepy feeling\n\nPlease, don't spoil my day, I'm miles away\nAnd after all I'm only sleeping\n\nOoh yeah\n\nKeeping an eye on the world going by my window\nTaking my time\n\nWhen I wake up early in the morning\nLift my head, I'm still yawning\nWhen I'm in the middle of a dream\nStay in bed, float up stream (float up stream)\n\nPlease, don't wake me, no, don't shake me\nLeave me where I am, I'm only sleeping\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}