{
  "Artist": "The Beatles",
  "Album": "Beatles for Sale",
  "Title": "I'm a Loser",
  "URL": "https://www.songfacts.com/facts/the-beatles/im-a-loser",
  "Confidence": 1.0,
  "youtube-id": "ukWRRNqMAZ4",
  "facts": [
    "John Lennon wrote this and also sang lead. He considered it one of his best early songs",
    "Lennon: \"Me in my Dylan period... part of me suspects I'm a loser and part of me thinks I'm God almighty.\"",
    "John Lennon wrote this on a plane while The Beatles were touring with Jackie DeShannon. It was a songwriting departure from the lighter fare Lennon and McCartney previously wrote.",
    "John Lennon's lowest recorded note as a Beatle is a G, which he hits in this song. He also sings the G in the last \"going down\" of \"Happiness Is A Warm Gun.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France, for above 2\n                                                  \n                                                  "
  ],
  "lyrics": "I'm a loser\nI'm a loser\nAnd I'm not what I appear to be\n\nOf all the love I have won, and have lost\nThere is one love I should never have crossed\nShe was a girl in a million my friend\nI should have known she would win in the end\n\nI'm a loser\nAnd I lost someone who's near to me\nI'm a loser\nAnd I'm not what I appear to be\n\nAlthough I laugh and I act like a clown\nBeneath this mask I am wearing a frown\nMy tears are falling like rain from the sky\nIs it for her or myself that I cry?\n\nI'm a loser\nAnd I lost someone who's near to me\nI'm a loser\nAnd I'm not what I appear to be\n\nWhat have I done to deserve such a fate?\nI realize I have left it too late\nAnd so it's true pride comes before a fall\nI'm telling you so that you won't lose all\n\nI'm a loser\nAnd I lost someone who's near to me\nI'm a loser\nAnd I'm not what I appear to be\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}