{
  "Artist": "The Beatles",
  "Album": "A Hard Day's Night",
  "Title": "I'm Happy Just To Dance With You",
  "URL": "https://www.songfacts.com/facts/the-beatles/im-happy-just-to-dance-with-you",
  "Confidence": 1.0,
  "youtube-id": "vNHC_1orRnE",
  "facts": [
    "John Lennon and Paul McCartney wrote this as a showcase song for George Harrison, who sang lead. George had already written only one Beatles song by this point: \"Don't Bother Me.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Typical of the early Beatles, this is a very innocent song - the singer is taking it slow, as he's OK just dancing with the girl of his dreams. There is an old-time Irving Berlin/Cole Porter feel to the song, focusing on the de-lightful feeling of being smitten.",
    "The Beatles performed this in their movie A Hard Day's Night, giving Harrison some quality screen time.",
    "John Lennon wrote most of this song. Typical of his style, the first short notes are followed with tree longer notes. The Irvin Berlin influence comes when the melody rises in the five notes in \"kiss or hold your hand...\" In the cadence, Lennon jokes: he repeats the mentioned five notes, but just sinks it with a third. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, a music historian in Stockholm\n                                                  \n                                                  ",
    "The Beatles recorded this on Sunday, March 1, 1964 in four takes. Recording on a Sunday was very rare at the time. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ben - Cheverly, MD\n                                                  \n                                                  "
  ],
  "lyrics": "Before this dance is through\nI think I'll love you, too\nI'm so happy when you dance with me\n\nI don't wanna kiss or hold your hand\nIf it's funny try and understand\nThere is really nothing else I'd rather do\n'Cause I'm happy just to dance with you\n\nI don't need to hug or hold you tight\nI just wanna dance with you all night\nIn this world there's nothing I would rather do\n'Cause I'm happy just to dance with you\n\nJust to dance with you\nIs everything I need\nBefore this dance is through\nI think I'll love you, too\nI'm so happy when you dance with me\n\nIf somebody tries to take my place\nLet's pretend we just can't see his face\nIn this world there's nothing I would rather do\n'Cause I'm happy just to dance with you\n\nJust to dance with you\nIs everything I need\nBefore this dance is through\nI think I'll love you, too\nI'm so happy when you dance with me\n\nIf somebody tries to take my place\nLet's pretend we just can't see his face\nIn this world there's nothing I would rather do\nI discovered I'm in love with you\n'Cause I'm happy just to dance with you\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}