{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "I'm Looking Through You",
  "URL": "https://www.songfacts.com/facts/the-beatles/im-looking-through-you",
  "Confidence": 1.0,
  "youtube-id": "-Qg5lGNchYM",
  "facts": [
    "Paul McCartney wrote this when his girlfriend, an actress named Jane Asher, left on a theater tour instead of staying home like he had hoped she would.\nAnother Rubber Soul track, \"You Won't See Me,\" is also about Asher. Despite McCartney's musical barbs, she has steadfastly refused to speak about Paul.",
    "On the US stereo version, there are two false guitar intros. This version was released on Capitol Records.",
    "Ringo played the Hammond organ on this track.",
    "The version on the album is a second version the Beatles recorded. The one that appears on Anthology 2 was originally going to be the one put on Rubber Soul until a decision was made to do a remake. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Back in the Beatles' early days, working at Abbey Road was expensive so rather than recording the song again, any small mistakes were frequently ignored. This explains why at around 1:20 on this track, if you listen carefully you can hear Paul McCartney dropping his tambourine.",
    "The Muppets performed this on an early episode of The Muppet Show in 1977. The Halloween skit (Vincent Price was the guest) featured slightly transparent Muppet ghosts."
  ],
  "lyrics": "I'm looking through you, where did you go \nI thought I knew you, what did I know\nYou don't look different, but you have changed \nI'm looking through you, you're not the same \n\nYour lips are moving, I cannot hear\nYour voice is soothing, but the words aren't clear\nYou don't sound different, I've learned the game\nI'm looking through you, you're not the same\n\nWhy, tell me why, did you not treat me right? \nLove has a nasty habit of disappearing overnight \n\nYou're thinking of me the same old way\nYou were above me, but not today\nThe only difference is you're down there\nI'm looking through you and you're nowhere\n\nWhy, tell me why, did you not treat me right? \nLove has a nasty habit of disappearing overnight \n\nI'm looking through you, where did you go \nI thought I knew you, what did I know \nYou don't look different, but you have changed\nI'm looking through you, you're not the same\n\n(Yeah, ah baby, you've changed)\n(I'm a-lookin' through you, yeah)\n(I'm lookin' through you)\n(You've changed, you've changed, you've changed)\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}