{
  "Artist": "The Beatles",
  "Album": "Help!",
  "Title": "I've Just Seen a Face",
  "URL": "https://www.songfacts.com/facts/the-beatles/ive-just-seen-a-face",
  "Confidence": 1.0,
  "youtube-id": "4Vm7lQ3EheY",
  "facts": [
    "Primarily written by Paul McCartney, the working title of this song was \"Auntie Gin's Theme\" because Paul McCartney's Aunt Gin liked it.",
    "This is one of the few times when Paul McCartney wrote a straight-up Country song, albeit at a much faster tempo. It has a sound similar to bluegrass. The Beatles would return to a sound similar to this with a few numbers from the White Album. Fans have even theorized, as \"Back In The U.S.S.R.\" was a shout-out to The Beach Boys and \"If I Needed Someone\" was a shout-out to The Byrds, that this song would have made a nice shout-out to Simon & Garfunkel.",
    "David Lee Roth performed this song on his 1988 Skyscraper tour.",
    "Ringo gets to play the maracas on this number. Maracas are those gourd-shaped percussion instruments with a handle, native to Latin America.",
    "One of five Beatles songs McCartney performed on his \"Wings Over America\" tour in 1976. It was one of the few songs from the Beatles' catalog to be performed by McCartney's subsequent band Wings in stage shows.",
    "In the US, \"I've Just Seen a Face\" was held back to be released on the Rubber Soul album, since the label wanted to give that album more acoustic numbers in keeping with the folk-rock fad popular at the time. In the UK, it was released on Help!!.",
    "It's not often that a bass player writes a song with no bass guitar, but that was the case here. This is one of the few Beatles songs without a bass guitar."
  ],
  "lyrics": "I've just seen a face\nI can't forget the time or place\nWhere we just met\nShe's just the girl for me\nAnd I want all the world to see\nWe've met, mm-mm-mm-m'mm-mm\n\nHad it been another day\nI might have looked the other way\nAnd I'd have never been aware\nBut as it is I'll dream of her\nTonight, di-di-di-di'n'di\n\nFallin', yes, I am fallin'\nAnd she keeps callin'\nMe back again\n\nI have never known\nThe like of this, I've been alone\nAnd I have missed things\nAnd kept out of sight\nBut other girls were never quite\nLike this, di-di-di-di'n'di\n\nFallin', yes, I am fallin'\nAnd she keeps callin'\nMe back again\n\n(Yeah)\n(Bup-a-lup-bup)\n\nFallin', yes, I am fallin'\nAnd she keeps callin'\nMe back again\n\nI've just seen a face\nI can't forget the time or place\nWhere we just met\nShe's just the girl for me\nAnd I want all the world to see\nWe've met, mm-mm-mm-di-di-di\n\nFallin', yes, I am fallin'\nAnd she keeps callin'\nMe back again\n\nFallin', yes, I am fallin'\nAnd she keeps callin'\nMe back again\n\nOh, fallin', yes, I am fallin'\nAnd she keeps callin'\nMe back again\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}