{
  "Artist": "The Beatles",
  "Album": "Let It Be",
  "Title": "I've Got A Feeling",
  "URL": "https://www.songfacts.com/facts/the-beatles/ive-got-a-feeling",
  "Confidence": 1.0,
  "youtube-id": "MmDZbjI8nHw",
  "facts": [
    "This is a mix of two unfinished songs, Paul McCartney's \"I've Got a Feeling\" and John Lennon's \"Everybody Had a Hard Year.\" In later years, The Beatles would sometimes cobble together songs from bits they hadn't completed. \"A Day In The Life\" is a good example.",
    "The Beatles recorded this live on the Apple rooftop, which was used in their movie, Let It Be. They played on the roof as a way to end the movie, which was footage of The Beatles working out songs in the studio.\nAlan Parsons, who was an engineer on the sessions, told Songfacts: \"When the 'rooftop day' came and we recorded them on the roof, it made an enormous difference to the enthusiasm that they had for the songs.\"",
    "Pearl Jam recorded this very early in their career; it was part of a three-song promotional sampler sent out in May 1991 when the band was just starting out. Let It Be was the first album Jeff Ament of Pearl Jam ever bought, and it was his idea to record the song. Eddie Vedder took some lyrical liberties, mentioning their Temple of the Dog project (\"Making Temple was a good time\"), their appearance in the movie Singles (\"Everybody had one line\") and the death of Seattle musician Andrew Wood (\"Everybody misses Andy\"). The sampler of this song went to the mailing lists of Soundgarden and Mother Love Bone, which was the band Ament, Wood and Stone Gossard were part of."
  ],
  "lyrics": "I've got a feeling, a feeling deep inside\nOh yeah, oh yeah.\nI've got a feeling, a feeling I can't hide\nOh no, oh no, oh no.\nYeah, I've got a feeling.\n\nOh please believe me, I'd hate to miss the train\nOh yeah, oh yeah.\nAnd if you leave me I won't be late again\nOh no, oh no, oh no.\nYeah, I've got a feeling, yeah.\n\nAll these years I've been wandering around,\nWondering how come nobody told me\nAll that I was looking for was somebody\nWho looked like you.\n\nI've got a feeling, that keeps me on my toes\nOh yeah, oh yeah.\n\nI've got a feeling, I think that everybody knows\nOh yeah, oh yeah, oh yeah.\nYeah, yeah, I've got a feeling, yeah.\nYeah\n\nEv'rybody had a hard year\nEv'rybody had a good time\nEv'rybody had a wet dream,\nEv'rybody saw the sunshine\nOh yeah, oh yeah.\n\nEv'rybody had a good year,\nEv'rybody let their hair down,\nEv'rybody pulled their socks up,\nEv'rybody put their foot down.\nOh yeah, oh yeah.\n\nYeah I've got a feeling\nA feeling deep inside\nOh yeah, oh yeah.\n\nI've got a feeling, a feeling I can't hide\nOh no\nOh no no no\n\nYeah yeah yeah yeah\nI've got a feeling\nI've got a feeling\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}