{
  "Artist": "The Beatles",
  "Album": "Magical Mystery Tour",
  "Title": "I Am The Walrus",
  "URL": "https://www.songfacts.com/facts/the-beatles/i-am-the-walrus",
  "Confidence": 1.0,
  "youtube-id": "Tjhb5gkw4No",
  "facts": [
    "John Lennon wrote this song. As stated in the DVD Composing the Beatles Songbook, John was throwing together nonsense lyrics to mess with the heads of scholars trying to dissect The Beatles songs. They also mention that it's John's answer to Bob Dylan's \"getting away with murder\" style of songwriting. Lennon told Playboy years later that \"I can write that crap too,\" which is rarely mentioned in relation to this song.",
    "Lennon explained the origins of this song in his 1980 Playboy interview: \"The first line was written on one acid trip one weekend. The second line was written on the next acid trip the next weekend, and it was filled in after I met Yoko. Part of it was putting down Hare Krishna. All these people were going on about Hare Krishna, Allen Ginsberg in particular. The reference to 'Element'ry penguin' is the elementary, naive attitude of going around chanting, 'Hare Krishna,' or putting all your faith in any one idol. I was writing obscurely, a la Dylan, in those days.\"",
    "Lennon got the idea for the oblique lyrics when he received a letter from a student who explained that his English teacher was having the class analyze Beatles songs. Lennon answered the letter; his reply was sold as memorabilia at a 1992 auction. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Emery - San Jose, CA\n                                                  \n                                                  ",
    "The voices at the end of the song came from a BBC broadcast of the Shakespeare play King Lear, which John Lennon heard when he turned on the radio while they were working on the song. He decided to mix bits of the broadcast into the song, resulting in some radio static and disjointed bits of dialogue.\nThe section of King Lear used came from Act Four, Scene 6, with Oswald saying: \"Slave, thou hast slain me. Villain, take my purse,\" which comes in at the 3:52 mark. After Oswald dies, we hear this dialogue:\nEdgar: \"I know thee well: a serviceable villain, As duteous to the vices of thy mistress As badness would desire.\"\nGloucester: \"What, is he dead?\"\nEdgar: \"Sit you down, father. Rest you.\"",
    "The idea for the Walrus came from the poem The Walrus and The Carpenter, which is from the sequel to Alice in Wonderland called Through the Looking-Glass. In his 1980 Playboy interview, Lennon said: \"It never dawned on me that Lewis Carroll was commenting on the capitalist and social system. I never went into that bit about what he really meant, like people are doing with the Beatles' work. Later, I went back and looked at it and realized that the walrus was the bad guy in the story and the carpenter was the good guy. I thought, Oh, s--t, I picked the wrong guy. I should have said, 'I am the carpenter.' But that wouldn't have been the same, would it?\"",
    "When Lennon decided to write confusing lyrics, he asked his friend Pete Shotton for a nursery rhyme they used to sing. Shotton gave them this rhyme, which Lennon incorporated into the song:\nYellow matter custard, green slop pie\nAll mixed together with a dead dog's eye\nSlap it on a butty, ten foot thick\nThen wash it all down with a cup of cold sick",
    "The song's opening line, \"I am he as you are he as you are me and we are all together\" is based on the song \"Marching To Pretoria,\" which contains the lyric, \"I'm with you and you're with me and we are all together.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France, for above 3\n                                                  \n                                                  ",
    "The choir at the end sings, \"Oompah, oompah, stick it in your jumper\" and \"Everybody's got one, everybody's got one.\"",
    "This song helped fuel the rumor that Paul McCartney was dead. It's quite a stretch, but theorists found these clues in the lyrics, none of which are substantiated:\n\"Waiting for the van to come\" means the three remaining Beatles are waiting for a police van to come. \"Pretty little policemen in a row\" means policemen did show up.\n\"Goo goo ga joob\" were the final words that Humpty Dumpty said before he fell off the wall and died.\nDuring the fade, while the choir sings, a voice says \"Bury Me\" which is what Paul might have said after he died.\nDuring the fade, we hear someone reciting the death scene from Shakespeare's play \"King Lear.\"\nIn addition, a rumor circulated that Walrus was Greek for \"corpse\" (it isn't) in Greek, so that is what people thought of Paul being the Walrus. Also, in the video, the walrus was the only dark costume.",
    "The BBC banned this for the lines \"pornographic priestess\" and \"let your knickers down.\"",
    "This was released as the B-side to \"Hello Goodbye,\" which Paul McCartney wrote. This angered Lennon because he felt this was much better.",
    "In The Beatles song \"Glass Onion,\" Lennon sang, \"The Walrus was Paul.\" He got a kick out of how people tried to interpret his lyrics and figure out who the Walrus was.",
    "Lennon got the line \"Goo Goo Ga Joob\" from the book Finnegan's Wake by James Joyce. \"Semolina Pilchard\" was Detective Sergeant Norman Pilcher, head of the Scotland Yard Drugs Unit. He led the arrests of both John Lennon and Brian Jones before being investigated himself for blackmail and bribery in the '70s. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Matt - London, England\n                                                  \n                                                  ",
    "Eric Burdon (of Animals and War fame) stated in his biography that he is the Egg Man. It seems he told John Lennon of a sexual experience he was involved in where an egg played a major part. After that, John called him Egg Man.",
    "ELO's song \"Hello My Old Friend\" has an identical form to this - almost the same tune and orchestration but different words. No wonder Jeff Lynne is sometimes referred to as the sixth Beatle.",
    "In The Beatles Lyrics, journalist Hunter Davies explains that he was with John Lennon when the song first came to him. They were swimming in a pool when a police siren sounded outside. It triggered a rhythm in Lennon's head, and he later added to that rhythm the words, \"Mist-er Cit-ee police-man sitting pretty.\"\nLennon related this same story to Jonathan Cott in 1968, saying, \"I had this idea of doing a song that was a police siren, but it didn't work in the end... You couldn't really sing the police siren.\"",
    "In an episode of The Simpsons, \"The Bart Of War,\" airing May 18, 2003, Bart and Milhouse break into a secret room in the Flanders' household to discover that Ned is a Beatles fanatic. Bart takes a sip from a can of 40-year-old Beatles-themed novelty soda and quotes this song: \"Yellow matter custard dripping from a dead dog's eye,\" while Milhouse takes a trip and sees various Beatles inspired hallucinations. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ashley - Moncton, Canada\n                                                  \n                                                  ",
    "Styx covered this song in 2004 and made a music video for it with a cameo from Billy Bob Thornton. They performed it at Eric Clapton's Crossroads benefit that year, and incorporated it into their set lists. Their version appears on their One with Everything DVD. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Caitlyn - Farmington Hills, MI\n                                                  \n                                                  ",
    "After John Lennon went solo, he wrote a song called \"God\" where he sang, \"I was the walrus, but now I am John.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Webspin - Daytona, FL\n                                                  \n                                                  ",
    "Artists to cover this song include Guided By Voices, Jackyl, Phil Lesh, Love/Hate, Men Without Hats, Oasis, Oingo Boingo, Spooky Tooth and Styx. The Dead Milkmen recorded a completely different song with the same title in 1987.",
    "Frank Zappa and the Mothers Of Invention performed the song as part of their late '70s - early '80s live repertoire, giving it their own comic treatment. It was a favorite of the fans. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dan - Milwaukee, WI\n                                                  \n                                                  ",
    "Bono sings this song in the movie Across the Universe, a film centered around the music of The Beatles. In the film, he plays Dr. Robert, also a reference to another Beatles song. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jordan - Brooklyn, NY\n                                                  \n                                                  ",
    "This was the first song the Beatles recorded after Brian Epstein's death. Engineer Geoff Emerick recalled, \"the look of emptiness on their faces when they were playing.\"",
    "John Lennon's \"I'm Crying...\" lyric came from the Smokey Robinson & the Miracles song \"Ooh Baby Baby,\" where Robinson sings that phrase in the refrain.",
    "In the Anthology version of this song, they experiment with four octaves in the intro. Also, just before Lennon says, \"Sitting in an English garden waiting for the sun,\" Ringo does two hits on snare and floor tom before hitting crash. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Riley - Elmhurst, IL\n                                                  \n                                                  ",
    "In the 2001 Stephen King novel Dreamcatcher, a psychiatrist named Henry Devlin sings this as he tries to destroy an alien parasite and its eggs."
  ],
  "lyrics": "I am he as you are he as you are me\nAnd we are all together\nSee how they run like pigs from a gun\nSee how they fly\nI'm crying\n\nSitting on a corn flake\nWaiting for the van to come\nCorporation T-shirt, stupid bloody Tuesday\nMan you've been a naughty boy\nYou let your face grow long\n\nI am the egg man\nThey are the egg men\nI am the walrus\nGoo goo g'joob\n\nMr. City policeman sitting\nPretty little policemen in a row\nSee how they fly like Lucy in the sky\nSee how they run\nI'm crying\nI'm crying, I'm crying, I'm crying\n\nYellow matter custard\nDripping from a dead dog's eye\nCrabalocker fishwife, pornographic priestess\nBoy, you've been a naughty girl\nYou let your knickers down\n\nI am the egg man\nThey are the egg men\nI am the walrus\nGoo goo g'joob\n\nSitting in an English garden\nWaiting for the sun\nIf the sun don't come you get a tan\nFrom standing in the English rain\n\nI am the egg man (How do you do sir?)\nThey are the egg men (The man maintains a fortune)\nI am the walrus\nGoo goo g'joob, goo goo goo g'joob\n\nExpert, texpert choking smokers\nDon't you think the joker laughs at you (Ho ho ho, hee hee hee, hah hah hah)\nSee how they smile like pigs in a sty\nSee how they snide\nI'm crying\n\nSemolina Pilchard\nClimbing up the Eiffel tower\nElementary penguin singing Hare Krishna\nMan, you should have seen them kicking Edgar Allen Poe\n\nI am the egg man\nThey are the egg men\nI am the walrus\nGoo goo g'joob, goo goo goo g'joob\nGoo goo g'joob, goo goo goo g'joob, goo goo\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-138.jpg",
    "facts": "\"Sitting in an English garden, waiting for the rain.\" On March 26, 2008, this topiary of The Beatles went up on the traffic island at Liverpool's South Parkway rail station."
  }
}