{
  "Artist": "The Beatles",
  "Album": "Beatles for Sale",
  "Title": "I Don't Want to Spoil the Party",
  "URL": "https://www.songfacts.com/facts/the-beatles/i-dont-want-to-spoil-the-party",
  "Confidence": 1.0,
  "youtube-id": "tXvpZwPE_3M",
  "facts": [
    "The melancholy tone of this song was quite a contrast to most of their songs at this point. Written by John Lennon, it was influenced by Lesley Gore's \"It's My Party.\" Lennon later explained that it was a personal song dealing with his frustrations in dealing with fame. Subsequent Lennon songs \"Help!\" and \"I'm a Loser\" had a similar theme.",
    "In America, this song was left off Beatles For Sale because of its depressing tone. It was used in the States as the B-side of the single \"Eight Days a Week,\" and got just enough airplay to crack the Top 40. In 1965 it appeared on the US album Beatles VI.",
    "In the stereo version, you can hear Lennon and McCartney singing \"Woo\" just before the solo, which is buried in the mono mix. George Harrison's guitar is also louder in the stereo mix. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France, for all above\n                                                  \n                                                  ",
    "Country singer Rosanne Cash's cover became a #1 Country hit in June 1989, making it the most successful Lennon-McCartney cover on the American Country chart."
  ],
  "lyrics": "I don't wanna spoil the party so I'll go\nI would hate my disappointment to show\nThere's nothing for me here so I will disappear\nIf she turns up while I'm gone please let me know\n\nI've had a drink or two and I don't care\nThere's no fun in what I do if she's not there\nI wonder what went wrong, I've waited far too long\nI think I'll take a walk and look for her\n\nThough tonight she's made me sad\nI still love her\nIf I find her I'll be glad\nI still love her\n\nI don't wanna spoil the party so I'll go\nI would hate my disappointment to show\nThere's nothing for me here so I will disappear\nIf she turns up while I'm gone please let me know\n\nThough tonight she's made me sad\nI still love her\nIf I find her I'll be glad\nI still love her\n\nThough I've had a drink or two and I don't care\nThere's no fun in what I do if she's not there\nI wonder what went wrong, I've waited far too long\nBut I think I'll take a walk and look for her\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}