{
  "Artist": "The Beatles",
  "Album": "Let It Be",
  "Title": "I Me Mine",
  "URL": "https://www.songfacts.com/facts/the-beatles/i-me-mine",
  "Confidence": 1.0,
  "youtube-id": "bt9REtHKdII",
  "facts": [
    "George Harrison wrote this song and sang lead. He said it is \"About the ego, the eternal problem.\"",
    "This uses a 3/4 time signature like a waltz, rather than the standard 4/4. With a rather mournful sound, Harrison called it a \"heavy waltz.\"",
    "This song owes its release to the Beatles movie Let It Be. Filmed in 1969 and originally called \"Get Back,\" the plan was to get footage of the group recording the album and use it as a TV special or movie. During sessions at Twickenham Studios in London, Harrison, McCartney and Starr played an early version of this song as John Lennon and his future wife Yoko Ono waltzed to it. The movie was shelved, and Let It Be moved forward as an album, but without \"I Me Mine.\"\nLater in 1969, The Beatles manager, Allen Klein, made a deal with United Artists to release the film. With the project revived, a new version of \"I Me Mine\" was needed for the film and the soundtrack - the footage of John and Yoko dancing together was deemed crucial to the film. On January 3, 1970, the Beatles - minus Lennon - assembled at Abbey Road studios and recorded a polished version of the song with George Martin producing. After further delays, The Beatles broke up and Phil Spector was brought in to produce the album from the tapes.",
    "The Beatles recorded this without John Lennon. The session took place just four days after the band learned that Let It Be was picked up as a movie and this song was needed for the soundtrack. By this time, the group had the #1 album in America with Abbey Road, but were fractured and moving on to solo projects - they wanted to get their remaining obligations settled quickly. With Lennon unavailable, George Harrison played acoustic guitar, Ringo Starr handled drums and Paul McCartney played electric bass and overdubbed organ and electric piano. Harrison also played the electric guitar lead which he overdubbed. What was so unusual about this session was the efficiency. In their later years, The Beatles spent a lot of time working up songs in the studio, but this one was completed in just one day.",
    "The first version The Beatles recorded ran just 1:34, and had only one chorus. The album's producer, Phil Specter, copied and pasted parts of that recording to make the song 2:25.",
    "When the album was re-released in 2003 as Let It Be... Naked, the songs were remixed to eliminate most of Phil Spector's lush production. His edit to make this longer was one of the few things he did that was left alone.",
    "Harrison's 1980 autobiography is titled \"I Me Mine.\" The book was reissued in 2002."
  ],
  "lyrics": "All through' the day\nI me mine, I me mine, I me mine\nAll through' the night\nI me mine, I me mine, I me mine\nNow they're frightened of leaving it\nEv'ryone's weaving it\nComing on strong all the time\nAll through' the day I me mine\n\nI-I-me-me mine, I-I-me-me mine\nI-I-me-me mine, I-I-me-me mine\n\nAll I can hear\nI me mine, I me mine, I me mine\nEven those tears\nI me mine, I me mine, I me mine\nNo-one's frightened of playing it\nEv'ryone's saying it\nFlowing more freely than wine\nAll through' the day I me mine\n\nI-I-me-me mine, I-I-me-me mine\nI-I-me-me mine, I-I-me-me mine\n\nAll I can hear\nI me mine, I me mine, I me mine\nEven those tears\nI me mine, I me mine, I me mine\nNo-one's frightened of playing it\nEv'ryone's saying it\nFlowing more freely than wine\nAll through' your life I me mine\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: CONCORD MUSIC PUBLISHING LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}