{
  "Artist": "The Beatles",
  "Album": "Help!",
  "Title": "I Need You",
  "URL": "https://www.songfacts.com/facts/the-beatles/i-need-you",
  "Confidence": 1.0,
  "youtube-id": "FcEY7tCfSrg",
  "facts": [
    "George Harrison wrote this for his girlfriend Pattie Boyd. They eventually got married.",
    "Pattie Boyd has inspired a lot of songs. Harrison also wrote \"Something\" about her, and Eric Clapton wrote \"Layla\" and \"Wonderful Tonight\" for her. She and Harrison officially divorced in 1977. She and Clapton were married from 1979-1988.",
    "The strange guitar sound is Harrison playing with a tone pedal.",
    "Since this was the only song of his in the movie Help!, Harrison made a point of saying \"I Need You by George Harrison,\" twice during the end credits. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "This is the second song written by Harrison that the band recorded. \"Don't Bother Me\" was the first. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "Former Journey lead singer Steve Perry covered this on his 2018 album Traces, which marked his return to music after a decades-long hiatus. It's the only cover song he included on the set."
  ],
  "lyrics": "You don't realize how much I need you\nLove you all the time\nAnd never leave you\nPlease come on back to me\nI'm lonely as can be\nI need you\n\nSaid you had a thing or two to tell me\nHow was I to know\nYou would upset me?\nI didn't realize\nAs I looked in your eyes\nYou told me\nOh yes, you told me you don't want my lovin' anymore\nThat's when it hurt me and feeling like this\nI just can't go on anymore\n\nPlease remember how I feel about you\nI could never really live without you\nSo, come on back and see\nJust what you mean to me\nI need you\nBut when you told me, you don't want my lovin' anymore\nThat's when it hurt me and feeling like this\nI just can't go on anymore\n\nPlease remember how I feel about you\nI could never really live without you\nSo, come on back and see\nJust what you mean to me\nI need you\n\nI need you\nI need you\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, DistroKid\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}