{
  "Artist": "The Beatles",
  "Album": "Please Please Me",
  "Title": "I Saw Her Standing There",
  "URL": "https://www.songfacts.com/facts/the-beatles/i-saw-her-standing-there",
  "Confidence": 1.0,
  "youtube-id": "mwBdWVTR-o8",
  "facts": [
    "This is the song that fomented the songwriting partnership between John Lennon and Paul McCartney, widely considered the greatest songwriting duo in pop music history. They started writing it in McCartney's living room after they skipped school one day, with Paul writing the majority of this song in September of 1962.\nThe song runs just 2:50 but tells a cohesive story, with McCartney singing about spotting a girl at a dance who wins his heart. It has a happy ending: They dance through the night and fall in love.",
    "McCartney's original line was, \"She was just 17, she'd never been a beauty queen,\" but he and Lennon decided it worked better as \"She was just 17, you know what I mean.\"\n\"It makes more sense, even though you don't know what I mean,\" McCartney told GQ in 2018.",
    "The Beatles often played this at the Cavern Club, where they often played between 1961-1963. In fact, it was because of the crowd reaction to their live shows that George Martin decided to have them simply record their live show in the studio for their first album. That's why he kept Paul's \"1, 2, 3, 4\" count at the beginning, which was taken from the ninth take and edited on to the first. The title was originally \"Seventeen\" until it was changed to \"I Saw Her Standing There\" for the album.",
    "The Beatles performed this on their first two Ed Sullivan Show appearances, which took place a week apart in February 1964. Getting on the show was a really big deal because it had a huge audience. About 73 million people watched the first show, which made The Beatles household names.",
    "This wasn't released as a single in the UK, and in the US, it was released as the flip side of \"I Want To Hold Your Hand,\" which was their first hit in the America. The Beatles were famous in the UK about a year before they caught on in America.",
    "This was one of 10 songs The Beatles recorded in one day (February 11, 1963) for their UK debut album, Please Please Me. It was the first song on the track list.",
    "This became the first Beatles song performed on the TV series American Idol when Jordin Sparks won in 2007 and sang it on the finale with runner-up Blake Lewis. The first line of the song - \"She was just 17\" - was fitting, as that was Sparks' age.",
    "Chuck Berry was a big influence on The Beatles, and the bass line of this song borrows from Berry's track \"I'm Talking About You.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "This was the last song John Lennon performed for a paid audience. He played it at Madison Square Garden on November 28, 1974 when he took the stage at an Elton John concert. Elton released this version as the B-side of \"Philadelphia Freedom\" the following year. This was the only live duet ever recorded between Elton John and John Lennon, who were good friends.",
    "The pop singer Tiffany covered this song on her 1987 debut album, which was released when she was just 15. Her version of the song, with the gender flipped to \"I Saw Him Standing There,\" was released as a single at the peak of her powers, following two #1 singles, \"I Think We're Alone Now\" and \"Could've Been.\"\nTiffany's rendition rose to #8 in the UK and #7 in the US. Among female artists, this is the highest chart position for any Beatles cover in either territory.\n\"The Beatles are so sacred to a lot of people and you're really playing with fire if you go out there and it's not well received,\" Tiffany told Songfacts. \"But I think that we did a great version on it. The mentality was just exposing my age group to The Beatles in a different way. That happened naturally with a lot of my friends later on, but not when you're 14, 15 and 16. \nWith 'I Think We're Alone Now' and 'I Saw Him Standing There,' we were taking that risk of having kids listen to a song that their parents already knew, and you just don't know how that's going to end up. But, through the production and through the fun videos and I think just the songs themselves, it worked, because the kids could relate to it.\"",
    "Both John Lennon and Paul McCartney wrote songs on their own in the later Beatles years and in their solo careers, but they learned a lot working with each other on songs like this one. \"Those early days were really cool, just sussing each other out, and realizing that we were good,\" McCartney told Observer Music Monthly, October 2007. \"You just realize from what he was feeding back. Often it was your song or his song, it didn't always just start from nothing. Someone would always have a little germ of an idea.\"",
    "Tom Cruise and Dustin Hoffman sing this song during a very powerful scene in the 1988 Oscar-winning film Rain Man. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ariel - Rehovot, Israel\n                                                  \n                                                  ",
    "The Who, Daniel Johnston, Santo & Johnny, and The Tubes all covered this song. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Airk - Skagway, AK\n                                                  \n                                                  ",
    "With Dave Grohl playing drums, Paul McCartney played this at the Grammy Awards in 2009.",
    "At the 2001 World Series between the New York Yankees and Arizona Diamondbacks, McCartney went to one of the games at Yankee Stadium and was shown between innings singing along as this played in the stadium. It was McCartney's second visit to Yankee Stadium; he saw The Yankees win that day, although they eventually lost the World Series."
  ],
  "lyrics": "(One, two, three, four)\n\nWell, she was just seventeen\nYou know what I mean\nAnd the way she looked\nWas way beyond compare\nSo how could I dance with another\nOoh, when I saw her standing there?\n\nWell, she looked at me\nAnd I, I could see\nThat before too long\nI'd fall in love with her\nShe wouldn't dance with another\nOoh, when I saw her standing there\n\nWell, my heart went \"boom\"\nWhen I crossed that room\nAnd I held her hand in mine\n\nOh we danced through the night\nAnd we held each other tight\nAnd before too long\nI fell in love with her\nNow I'll never dance with another\nOoh, since I saw her standing there\n\nWell, my heart went, \"Boom\"\nWhen I crossed that room\nAnd I held her hand in mine\n\nOh, we danced through the night\nAnd we held each other tight\nAnd before too long\nI fell in love with her\nNow I'll never dance with another\nOh, since I saw her standing there\nOh, since I saw her standing there\nYeah, well since I saw her standing there\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Round Hill Music Big Loud Songs, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}