{
  "Artist": "The Beatles",
  "Album": "A Hard Day's Night",
  "Title": "I Should Have Known Better",
  "URL": "https://www.songfacts.com/facts/the-beatles/i-should-have-known-better",
  "Confidence": 1.0,
  "youtube-id": "rp63A_-0XUU",
  "facts": [
    "Composed by John Lennon, at first he \"hammers the melody on the same note.\" (The Italian composer Monteverdi discovered the effect of hammering on the same note. He called the style \"stile concitato\"). Then comes the middle part in long notes. The middle part has a change of keynote, which is unusual with such a change in a middle part. And then the rise in falsetto. Typical of Lennon's songs, there is also a rise of excitement. When you think that the mood will cool a little - when you come to the middle part - the excitement instead increases. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, a music historian in Stockholm\n                                                  \n                                                  ",
    "The Beatles performed this in their first movie, A Hard Day's Night. It was used in a scene where The Beatles sing it to a group of girls, one of which was played by an actress named Pattie Boyd. This was the first time George Harrison met her - he fell for her and married her a few years later. They divorced in 1977, and Pattie married Harrison's friend Eric Clapton in 1979. That marriage also ended in divorce, but along the way, Pattie inspired some of the most famous songs of all time, including The Beatles' \"Something\" and Clapton's \"Layla.\"",
    "This was done in three takes on Tuesday, February 25, 1964. But it didn't end there - they completely remade it the next day. The take you hear on record is Take 22. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ben - Cheverly, MD\n                                                  \n                                                  ",
    "John Lennon's vocal was double-tracked to make it stand out.",
    "This was released as the B-side of \"A Hard Day's Night.\"",
    "Lennon played the harmonica solo.",
    "McCartney played a 12-string electric guitar on this track. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "At first, Lennon was proud of the composition, and said in 1964 that the song was one of the three best songs in the film A Hard Days Night. Later on he lost his self-confidence as a lyricist, and would often slag off his own songs as meaningless. He said in 1980 that \"I Should Have Known Better\" is, \"just a song, it doesn't mean a damn thing.\""
  ],
  "lyrics": "I should have known better with a girl like you\nThat I would love everything that you do\nAnd I do, hey, hey, hey, and I do\n\nWhoa, oh, I never realized what a kiss could be\nThis could only happen to me\nCan't you see, can't you see\n\nThat when I tell you that I love you, oh\nYou're gonna say you love me, too, oh\nAnd when I ask you to be mine\nYou're gonna say you love me, too\n\nSo oh, I should realized a lot of things before\nIf this is love you've got to give me more\nGive me more, hey hey hey, give me more\n\nWhoa, oh, I never realized what a kiss could be\nThis could only happen to me\nCan't you see, can't you see\n\nThat when I tell you that I love you, oh\nYou're gonna say you love me, too, oh\nAnd when I ask you to be mine\nYou're gonna say you love me, too\nYou love me, too, you love me, too, you love me, too\n                                                  \n                                                  Writer/s: John Winston Lennon, Paul James Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}