{
  "Artist": "The Beatles",
  "Album": "With the Beatles",
  "Title": "I Wanna Be Your Man",
  "URL": "https://www.songfacts.com/facts/the-beatles/i-wanna-be-your-man",
  "Confidence": 1.0,
  "youtube-id": "mnct7Qf3SUQ",
  "facts": [
    "John Lennon and Paul McCartney were working on this when they ran into the Rolling Stones manager Andrew Loog Oldham on September 10, 1963 in London. Oldham did some work promoting The Beatles earlier in 1963, and invited John and Paul to the Studio 51 jazz club where The Stones were rehearsing. They had been working on \"I Wanna Be Your Man,\" and finished it at the rehearsal when they found out The Stones were looking for a song to use as their second UK single. They gave the song to The Stones but also recorded it themselves on their With The Beatles album. Mick Jagger and Keith Richards were amazed at this display of songwriting prowess and soon began writing their own songs.",
    "Ringo sang lead, as the song was developed for him. It was his showpiece song during their live performances from 1963-1966.",
    "The Rolling Stones version was released first; it was issued on November 1, 1963. The Beatles version was included on their With The Beatles album, which came out on November 22, 1963.",
    "This was not the only song recorded by both The Beatles and The Rolling Stones. \"Money (That's What I Want)\" was recorded by both groups as well. It appears on the album With the Beatles as well as the Stones' More Hot Rocks (Big Hits and Fazed Cookies). \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Joel - Chicago, IL\n                                                  \n                                                  ",
    "Paul McCartney was the main author of this song, but it was finished up by both Lennon and McCartney during a jam session with The Rolling Stones. Lennon himself practically scoffed at the song, saying in an interview with David Sheff, \"It was a throwaway. The only two versions of the song were Ringo and the Rolling Stones. That shows how much importance we put on it: We weren't going to give them anything great, right?\"\nWhile the \"rivalry\" between The Beatles and The Rolling Stones was played up at the time for publicity purposes, Keith Richards eventually denied that any such rivalry was present.",
    "That's \"The Fifth Beatle\" George Martin on the Hammond organ. Martin dismissed the honorary title as \"nonsense,\" but his contributions to the music world were nevertheless enough to get his UK status raised to that of \"knight bachelor\" in 1996.\nMeanwhile, producer Andrew Loog Oldham lives on without knighthood. It was Oldham, by the way, who first came up with the Stones' early \"anti-Beatles\" image, as a rougher, edgier counterpart to the \"adorable moptops\" Beatles image.",
    "The Beatles performed this song in their 1964 film A Hard Day's Night. The song was also used in a 2004 episode of the TV show Crossing Jordan in a version performed by Sam Phillips. She didn't change the gender and did a darker take on the song."
  ],
  "lyrics": "I wanna be your lover, baby\nI wanna be your man\nI wanna be your lover, baby\nI wanna be your man\nLove you like no other, baby\nLike no other can\nLove you like no other, baby\nLike no other can\n\nI wanna be your man, I wanna be your man\nI wanna be your man, I wanna be your man\n\nTell me that you love me, baby\nLet me understand\nTell me that you love me, baby\nI wanna be your man\nI wanna be your lover, baby\nI wanna be your man\nI wanna be your lover, baby\nI wanna be your man\n\nI wanna be your man, I wanna be your man\nI wanna be your man, I wanna be your man (whoa)\n\nI wanna be your lover, baby\nI wanna be your man\nI wanna be your lover, baby\nI wanna be your man\nLove you like no other, baby\nLike no other can\nLove you like no other, baby\nLike no other can\n\nI wanna be your man, I wanna be your man\nI wanna be your man, I wanna be your man\nI wanna be your man, I wanna be your man\nI wanna be your man, I wanna be your man\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Round Hill Music Big Loud Songs, BMG Rights Management, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}