{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "I Will",
  "URL": "https://www.songfacts.com/facts/the-beatles/i-will",
  "Confidence": 1.0,
  "youtube-id": "IJ6bAHOvPH0",
  "facts": [
    "In the televised documentary The Beatles Anthology, Paul, George and Ringo are shown relaxing on a blanket outside. Ringo asks Paul what he wrote in India and Paul answers, \"I Will.\" Then George begins playing the song on his ukulele while he and Paul harmonize with it.\nMcCartney had the tune for a long time. While in India he made an unsuccessful attempt, together with psychedelic singer-songwriter Donovan, to pen a lyric to go with it, months before coming up with the elusive lyric on his own. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Recorded at the end of The White Album sessions, the song has some unusual instrumentation. McCartney played acoustic guitar and vocalized the bass (you can hear him going \"bom, bom\" in parts). John Lennon and Ringo Starr both added percussion using various instruments; George Harrison didn't play on it at all.",
    "Sixty-seven takes were recorded. The 65th was used.",
    "In 1995, this was recorded by the 18-year-old singer/songwriter/guitarist Ben Taylor, the son of Carly Simon and James Taylor. Ben Taylor's version was featured in the movie Bye Bye Love, starring Paul Reiser, and is also featured as part of the movie's soundtrack album. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Annabelle - Eugene, OR\n                                                  \n                                                  ",
    "Maureen McGovern covered this song for her 1992 album Baby I'm Yours.",
    "In the mind of Charles Manson, this song was a message from the Beatles that they were looking for him:\nFor if at last I find you\nYour song will fill the air\n \nManson took to mean that he should release an album. This along with many others were part of his deranged Helter Skelter plan. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Breanna - Henderson, NV\n                                                  \n                                                  ",
    "This was the first song Billie Eilish learned how to play. She learned it on ukulele."
  ],
  "lyrics": "Who knows how long I've loved you\nYou know I love you still\nWill I wait a lonely lifetime\nIf you want me to, I will\n\nFor if I ever saw you\nI didn't catch your name\nBut it never really mattered\nI will always feel the same\n\nLove you forever and forever\nLove you with all my heart\nLove you whenever we're together\nLove you when we're apart\n\nAnd when at last I find you\nYour song will fill the air\nSing it loud so I can hear you\nMake it easy to be near you\nFor the things you do endear you to me\nYou know I will\nI will\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Integrity Music\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}