{
  "Artist": "The Beatles",
  "Album": "A Hard Day's Night",
  "Title": "If I Fell",
  "URL": "https://www.songfacts.com/facts/the-beatles/if-i-fell",
  "Confidence": 1.0,
  "youtube-id": "vq78BDwCujs",
  "facts": [
    "John Lennon wrote this song, which may have been influenced by the ambivalence he felt during his first marriage. Lennon called this song \"my first attempt at a ballad... it's semi autobiographical, but not consciously.\"",
    "Lennon and McCartney sang together into the same microphone when recording this song. John sang the lead on the intro, then Paul sang in a higher lead while John sang harmony. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The structure of the song is rather intriguing. It opens with an intro that contains no musical elements found in the rest of the song, and the body of this song has no real verse/chorus structure, just two verses that each turn halfway through on an unexpected chord.\nThe song is very expressive, with large intervals between the notes in a quasi-modal way. Typical of Lennon are the emphasis on three recurrent long notes (\"...give my heart...\"). It has similarities with John Dunstable's motet \"Quam pulchra es\" from the fifteenth century. The introduction is also unusual, with four modulations - even tighter than most music from late romantic music. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, who is a music historian in Stockholm\n                                                  \n                                                  ",
    "At the end of the second time that they sing, \"Would be sad if our new love was in vain,\" McCartney's voice cracks on \"vain,\" but on newer releases of the song this mistake is covered over. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "There were a few demos of this song recorded in January 1964 before The Beatles came to America. The proper recording came on Thursday, February 27, 1964. The take you hear on the album is Take 15. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ben - Cheverly, MD\n                                                  \n                                                  ",
    "The Beatles performed this in the movie A Hard Day's Night. It was used in a scene where they perform to a group of school kids in a theater. The kids were all borrowed from nearby schools, and had no idea they would see The Beatles. On of the kids was 13-year-old Phil Collins, who didn't make the final cut, but was given outtakes with him in it years later when he contributed commentary for the DVD release of the movie.",
    "This was used as the B-side of \"And I Love Her.\"",
    "During their 1964 tour, Lennon had some fun with McCartney, adding the word \"over\" when Paul introduced the song. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "If I fell in love with you\nWould you promise to be true\nAnd help me understand\n'Cause I've been in love before\nAnd I found that love was more\nThan just holding hands\n\nIf I give my heart to you\nI must be sure\nFrom the very start\nThat you would love me more than her\n\nIf I trust in you oh please\nDon't run and hide\nIf I love you too oh please\nDon't hurt my pride like her\n\n'Cause I couldn't stand the pain\nAnd I would be sad if our new love was in vain\n\nSo I hope you see that I\nWould love to love you\nAnd that she will cry\nWhen she learns we are two\n'Cause I couldn't stand the pain\nAnd I would be sad if our new love was in vain\n\nSo I hope you see that I\nWould love to love you\nAnd that she will cry\nWhen she learns we are two\nIf I fell in love with you\n                                                  \n                                                  Writer/s: John Winston Lennon, Paul James McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}