{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "If I Needed Someone",
  "URL": "https://www.songfacts.com/facts/the-beatles/if-i-needed-someone",
  "Confidence": 1.0,
  "youtube-id": "A8dLntONeIA",
  "facts": [
    "This was written by George Harrison, who got the idea from a few of The Byrds' songs including \"The Bells of Rhymney\" and \"She Don't Care About Time.\" It was not Ravi Shankar that introduced George to the wonderment of sitar, but Byrd traveler David Crosby shortly after Shawn Phillips had shown him the basic steps. In 1965 The Beatles toured the US and visited Ravi at World Pacific Studios where The Byrds had permanent residency. It was also here that Roger McGuinn's Rickenbacker jingle jangle influenced Harrison's \"If I Needed Someone.\" In turn, The Byrds were influenced by Harrison's 12-string guitar work. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Shiloh Noone, author of Seekers Guide To The Rhythm Of Yesteryear\n                                                  \n                                                  ",
    "Former Byrds guitarist Roger McGuinn recalled to Christianity Today magazine: \"George Harrison wrote that song after hearing the Byrds' recording of \"Bells of Rhymney.\" He gave a copy of his new recording to Derek Taylor, the Beatles' former press officer, who flew to Los Angeles and brought it to my house. He said George wanted me to know that he had written the song based on the rising and falling notes of my electric Rickenbacker 12-string guitar introduction. It was a great honor to have in some small way influenced our heroes the Beatles.\""
  ],
  "lyrics": "If I needed someone to love\nYou're the one that I'd be thinking of\nIf I needed someone\n\nIf I had some more time to spend\nThen I guess I'd be with you my friend\nIf I needed someone\nHad you come some other day\nThen it might not have been like this\nBut you see now I'm too much in love\n\nCarve your number on my wall\nAnd maybe you will get a call from me\nIf I needed someone\nAh, ah, ah, ah\n\nIf I had some more time to spend\nThen I guess I'd be with you my friend\nIf I needed someone\nHad you come some other day\nThen it might not have been like this\nBut you see now I'm too much in love\n\nCarve your number on my wall\nAnd maybe you will get a call from me\nIf I needed someone\nAh, ah\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}