{
  "Artist": "The Beatles",
  "Album": "With the Beatles",
  "Title": "It Won't Be Long",
  "URL": "https://www.songfacts.com/facts/the-beatles/it-wont-be-long",
  "Confidence": 1.0,
  "youtube-id": "UVKU6SevefY",
  "facts": [
    "In a 1980 interview with Playboy, John Lennon said that after some London critic remarked that \"It Won't Be Long\" contained \"Aeolian cadences,\" their popularity increased because they attracted the brainy set. Lennon confesses that to this day, he has no idea what an \"Aeolian cadence\" is. The Aeolian is also known as the natural minor scale, beginning on A.",
    "This song has been covered by House of Heroes on a Beatles' cover album, and also by Franz Ferdinand, The Quick, Richard Thompson, and the Beatles tribute supergroup Yellow Matter Custard - who are named after a line from \"I Am The Walrus.\"",
    "This song repeats the distinctive \"yeah, yeah\" chorus first popularized in \"She Loves You.\" In \"It Won't Be Long,\" the \"yeah\" shows up 56 times.",
    "The wordplay here between \"belong\" and \"be long\" was explained by Paul McCartney: \"I was doing literature at school, so I was interested in plays on words and onomatopoeia. John didn't do literature but he was quite well read, so he was interested in that kind of thing. Like the double meaning of 'please' in a line like 'Please, lend a little ear to my pleas' that we used in Please Please Me. We'd spot the double meaning. I think everyone did, by the way, it was not just the genius of us! In 'It won't be long till I belong to you' it was that same trip. We both liked to try and get a bit of double meaning in, so that was the high spot of writing that particular song. John mainly sang it so I expect that it was his original idea but we both sat down and wrote it together.\"\nAnother Beatles song to use \"be long\" repeatedly is \"Blue Jay Way.\"",
    "This was the first song Neil Young performed for an audience. He played it at his high school cafeteria.",
    "John Lennon's vocal was double-tracked, something The Beatles did on some of their early recordings to make it pop."
  ],
  "lyrics": "It won't be long yeah (yeah), yeah (yeah), yeah (yeah)\nIt won't be long yeah (yeah), yeah (yeah), yeah (yeah)\nIt won't be long yeah (yeah), 'til I belong to you\n\nEvery night when everybody has fun\nHere am I sitting all on my own\n\nIt won't be long yeah (yeah), yeah (yeah), yeah (yeah)\nIt won't be long yeah (yeah), yeah (yeah), yeah (yeah)\nIt won't be long yeah (yeah), 'til I belong to you\n\nSince you left me, I'm so alone\nNow you're coming, you're coming on home\nI'll be good like I know I should\nYou're coming home, you're coming home\n\nEvery night the tears come down from my eyes\nEvery day I've done nothing but cry\n\nIt won't be long yeah (yeah), yeah (yeah), yeah (yeah)\nIt won't be long yeah (yeah), yeah (yeah), yeah (yeah)\nIt won't be long yeah (yeah), 'til I belong to you\n\nSince you left me, I'm so alone\nNow you're coming, you're coming on home\nI'll be good like I know I should\nYou're coming home, you're coming home\n\nSo every day we'll be happy, I know\nNow I know that you won't leave me no more\n\nIt won't be long yeah (yeah), yeah (yeah), yeah (yeah)\nIt won't be long (yeah), yeah (yeah), yeah (yeah)\nIt won't be long yeah (yeah), 'til I belong to you\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Broma 16, Kobalt Music Publishing Ltd., Takwene LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}