{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "Julia",
  "URL": "https://www.songfacts.com/facts/the-beatles/julia",
  "Confidence": 1.0,
  "youtube-id": "bgylB7SSrkU",
  "facts": [
    "John Lennon dedicated this song to Yoko and to his mother Julia, who was struck and killed by a car driven by an off-duty police officer on July 15, 1958, when John was 17. Lennon was raised mostly by Julia's sister Mimi, but starting to see more of his mother at the time of her death.\nOne of five daughters, nicknamed Judy by the family, Julia met Alf Lennon at the age of 14 while she was working as a cinema usher. Ten years later they married. Julia gave birth to John after 30 hours of labor, and Alf went AWOL when he jumped ship - neither the Navy nor Julia knew of his whereabouts. He later returned but Julia refused to reconcile. She was involved in a couple other relationships; John went to live with his aunt Mimi because Julia could not provide a sound home for the boy.\nWhen John was in is early teens he visited Julia often, and she taught him to play the banjo. John would frequently stay over at Julia's house, and in 1958 Julia was hit and killed by the off duty police officer as she walked home from Mimi's house. John named his first son Julian after her.",
    "Lennon recorded this by himself. He did it completely live with an acoustic guitar and occasional overdubs on the vocals. It is the only song he did completely on his own during his time with The Beatles. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Phillip - Louisville, KY\n                                                  \n                                                  ",
    "Psychedelic singer Donovan Leitch taught Lennon the fingerpicking guitar style he used on this track. Donovan was with The Beatles in India at the Maharishi's camp in Rishikesh, India in February 1968. When Lennon was in Rishikesh, one of the biggest revelations he had was truly opening up (to himself) regarding the feelings he had for his mother, Julia. In leaning the finger-picking method, it did allow John to dig deeper into his emotions. To quote Donovan: \"Learning a new style meant composing in a different way. In his deep meditation sessions, John had opened up feelings for his mother. He found release for these emotions in 'Julia,' the tune he had learned with the new finger style. I remember when I played 'Julia' on my guitar I was struck by how much the images in the song were like the images in my songs. They were very unLennon-like.\"\nDonovan was a great conduit for capturing the wonder and innocence of childhood, as he had released an album of children's songs shortly before the trip to India. In his Songfacts interview, he added: \"He [Lennon] was trying to write a song about a childhood he never had, and that was very touching to me. He said, 'You are the guy who writes the children's songs. Can you try and help me with this one?' So I may have added a line there.\"",
    "The first 18 notes of this song are the same (in different metres, only changing the chords) but it's unlikely that this was done deliberately. If anything was deliberate about those notes, it would be that the number 18 resolves to a 9, which Lennon did slip into some of his tunes, but in this case, it was probably just a happy accident.",
    "In Japanese, the name Yoko means \"ocean child,\" which Lennon included as a line in the song.",
    "Sean Lennon sang this at the special Come Together: A Night For John Lennon's Words And Music, which was held October 2, 2001 at Madison Square Garden.",
    "Paul Shaffer and the Late Show Orchestra would play this every time Julia Roberts was a guest on The Late Show with David Letterman.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Phillip - Louisville, KY\n                                                  \n                                                  ",
    "In The Anime series Cowboy Bebop, the main character's \"girlfriend\" is named Julia. The creator named her after this song - most of the episodes are named after songs. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Nahtan - Dillsburg, PA\n                                                  \n                                                  ",
    "Yoko Ono told Mojo magazine in a 2018 interview that this is her favorite White Album track. She explained: \"It's about John's mother and the fact that he wrote about her is a very sweet thing.\""
  ],
  "lyrics": "Half of what I say is meaningless\nBut I say it just to reach you, Julia\n\nJulia, Julia, ocean child, calls me\nSo I sing a song of love, Julia\nJulia, seashell eyes, windy smile, calls me\nSo I sing a song of love, Julia\n\nHer hair of floating sky is shimmering, glimmering\nIn the sun\n\nJulia, Julia, morning moon, touch me\nSo I sing a song of love, Julia\n\nWhen I cannot sing my heart\nI can only speak my mind, Julia\n\nJulia, sleeping sand, silent cloud, touch me\nSo I sing a song of love, Julia\n\nHum, hum, hum, calls me\nSo I sing a song of love, Julia, Julia, Julia\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}