{
  "Artist": "The Beatles",
  "Album": "Let It Be",
  "Title": "Let It Be",
  "URL": "https://www.songfacts.com/facts/the-beatles/let-it-be",
  "Confidence": 1.0,
  "youtube-id": "QDYfEBY9NM4",
  "facts": [
    "Paul McCartney wrote this song. It was inspired by his mother, Mary, who died when he was 14. Many people thought \"Mother Mary\" was a biblical reference when they heard it.",
    "Since Let It Be was The Beatles' last album, it made an appropriate statement about leaving problems behind and moving on in life. The album was supposed to convey an entirely different message. It was going to be called \"Get Back,\" and they were going to record it in front of an audience on live TV, with another TV special showing them practicing the songs in the studio. It was going to be The Beatles getting back to their roots and playing unadorned live music instead of struggling in the studio like they did for The White Album. When they started putting the album together, it became clear the project wouldn't work, and George Harrison left the sessions. When he returned, they abandoned the live idea and decided to use the TV footage as their last movie. While the film was being edited, The Beatles recorded and released Abbey Road, then broke up. Eventually, Phil Spector was given the tapes and asked to produce the album, which was released months after The Beatles broke up. By then, it was clear \"Let It Be\" would be a better name than \"Get Back.\"",
    "According to McCartney, this is a very positive song, owing to its inspiration. One night when he was paranoid and anxious, he had a dream where he saw his mother, who had been dead for ten years or so - she came to him in his time of trouble, speaking words of wisdom that brought him much peace when he needed it. It was this sweet dream that got him to begin writing the song.\nHe told the story to James Corden when he appeared on his Carpool Karaoke segment. \"She was reassuring me, saying, 'It's going to be OK, just let it be.' I felt so great. She gave me the positive words. I woke up and thought, 'What was that? She said 'Let It Be.' That's good.' So I wrote the song 'Let It Be' out of positivity.\"\nMany have been moved by the song on a deeply personal level, including Corden, who broke down when they sang it together. \"I remember my granddad, who was a musician, sitting me down and telling me, 'I'm going to play you the best song you've ever heard,' and he played me that,\" he said. \"If my granddad was here right now he'd get an absolute kick out of this.\" McCartney replied, \"He is.\"",
    "John Lennon hated this song because of it's apparent Christian overtones. He made the comment before recording it, \"And now we'd like to do Hark The Angels Come.\" Lennon saw to it that \"Maggie Mae,\" a song about a Liverpool prostitute, followed it on the album. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Mountlake Terrace, WA. for above 2\n                                                  \n                                                  ",
    "It was John Lennon who wanted Phil Spector to produce the album. Spector worked on Lennon's \"Instant Karma\" and was known for his bombastic \"Wall Of Sound\" style. McCartney hated Spector's production, and in 2003 he pushed to have the album remixed and released without Spector's influence. The result was Let It Be... Naked, which eliminated most of Spector's work and is much closer to what The Beatles intended for the album. \"Maggie Mae\" and \"Dig It\" were removed, and an entirely different guitar solo was used for this song.",
    "You'll hear different guitar parts on different versions on this song, as there were several overdubs of the solo. On April 30, 1969, George Harrison overdubbed a new guitar solo over the best take from the January 31, 1969 session. Harrison overdubbed another one on January 4, 1970, but there's a possibility that it was actually McCartney on that overdub. The first overdub solo was used for the original single release, and the second overdub solo was used for the original album release. The Let It Be... Naked version is the one from the movie.",
    "The Beatles weren't the first to release this song - Aretha Franklin was. The Queen of Soul recorded it in December 1969, and it was released on her album This Girl's In Love With You in January 1970, two months before The Beatles released their version (she also covered The Beatles \"Eleanor Rigby\" on that album).\nAretha recorded it with the Muscle Shoals Rhythm Section, who were a group of musicians that owned their own studio in Alabama, but would travel to New York to record with Aretha. David Hood, who was their bass player, told us that Paul McCartney sent demos of the song to Atlantic Records (Franklin's label) and to the Muscle Shoals musicians. Said Hood, \"I kick myself for not grabbing that demo. Because I think they probably dropped it in the garbage. Our version was different. We changed it a little bit from his demo, where their version is different from that demo and from Aretha's version, as well. Just slightly, but little things.\"",
    "In April 1987, this was released as a charity single in aid of The Sun newspaper's Zeebrugge ferry disaster fund. Featuring Paul McCartney, Mark Knopfler, Kate Bush, Boy George and many others, it was called \"Ferry Aid\" and spent three weeks at #1 in the UK. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Vishal - Delhi, India\n                                                  \n                                                  ",
    "Billy Preston added organ and electric piano to this track. Preston was such a significant contributor to the Let It Be album that John Lennon floated the idea of making him a full band member. Preston's contributions were more than musical: He came in after George Harrison got frustrated with the sessions and quit the band. After his bandmates agreed to his terms (including abandoning a live performance they had planned), Harrison returned to the sessions after 12 days and arranged for Preston to join them. Having Preston there kept tensions at bay and greased the creative gears, allowing them to complete the album that was looking precarious when he arrived.",
    "This was the first Beatles song released in The Soviet Union. The single made it there in 1972.",
    "In 2001, McCartney helped organize the \"Concert For New York,\" to benefit victims of The World Trade Center disaster. He closed the show with this, inviting the other acts and some New York cops and firefighters on stage to sing with him.",
    "The album had the largest initial sales in US record history up to that time: 3.7 million advance orders. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "This song was played at Linda McCartney's funeral.",
    "On July 18, 2008, Paul McCartney joined Billy Joel onstage at Shea Stadium in New York and played this as the final song of the final concert at Shea. As a member of The Beatles, McCartney played the first stadium rock concert when they performed at Shea on August 15, 1965.",
    "According to Ian Macdonald's book Revolution in the Head, McCartney wrote \"Let It Be\" and \"The Long and Winding Road\" on the same day. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n mick - london, United Kingdom\n                                                  \n                                                  ",
    "Until 1994 and the recordings for \"Free As A Bird,\" the session for this song on January 4, 1970 was the last Beatles recording session. Lennon wasn't present that day, as he was on holiday.",
    "A cover by American R&B artist Jennifer Hudson featuring the Roots, who are the house band on NBC's Late Night with Jimmy Fallon, debuted at #98 on the Hot 100 in February 2010. She recorded it for the Hope For Haiti Now charity telecast after the earthquake that devastated the country. It was the third time the song had entered the US singles chart as Joan Baez's version peaked at #49 in 1971.",
    "A month after Jennifer Hudson's version reached the Hot 100, Kris Allen took the song to the chart for a fourth time when his cover debuted at #63. Allen's cut charted after he performed the song on American Idol, with proceeds from its digital sales benefiting Haiti earthquake relief efforts through the Idol Gives Back Foundation.",
    "John Legend and Alicia keys performed this song on the tribute special The Beatles: The Night That Changed America, which aired in 2014 exactly 50 years after the group made their famous appearance on Ed Sullivan Show. Legend introduced it as \"a song that has comforted generations with its beauty and its message.\"",
    "Sesame Street used this with the title changed to \"Letter B.\" The lyrics were changed to list words that begin with B."
  ],
  "lyrics": "When I find myself in times of trouble, Mother Mary comes to me\nSpeaking words of wisdom, let it be\nAnd in my hour of darkness she is standing right in front of me\nSpeaking words of wisdom, let it be\n\nLet it be, let it be, let it be, let it be\nWhisper words of wisdom, let it be\n\nAnd when the broken-hearted people living in the world agree\nThere will be an answer, let it be\nFor though they may be parted, there is still a chance that they will see\nThere will be an answer, let it be\n\nLet it be, let it be, let it be, let it be\nYeah, there will be an answer, let it be\nLet it be, let it be, let it be, let it be\nWhisper words of wisdom, let it be\n\nLet it be, let it be, let it be, yeah, let it be\nWhisper words of wisdom, let it be\n\nAnd when the night is cloudy there is still a light that shines on me\nShine until tomorrow, let it be\nI wake up to the sound of music, Mother Mary comes to me\nSpeaking words of wisdom, let it be\n\nLet it be, let it be, let it be, yeah, let it be\nThere will be an answer, let it be\nLet it be, let it be, let it be, yeah, let it be\nThere will be an answer, let it be\nLet it be, let it be, let it be, yeah, let it be\nWhisper words of wisdom, let it be\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}