{
  "Artist": "The Beatles",
  "Album": "Sgt. Pepper's Lonely Hearts Club Band",
  "Title": "Lovely Rita",
  "URL": "https://www.songfacts.com/facts/the-beatles/lovely-rita",
  "Confidence": 1.0,
  "youtube-id": null,
  "facts": [
    "Paul McCartney wrote this as if he fell for a meter maid while she was taking his plate number. Said Paul: \"I was bopping about on the piano in Liverpool when someone told me that in America, they call parking-meter women meter maids. I thought that was great, and it got to 'Rita Meter Maid' and then \"Lovely Rita Meter Maid' and I was thinking vaguely that it should be a hate song: 'You took my car away and I'm so blue today' and you wouldn't be liking her; but then I thought it would be better to love her and if she was very freaky too, like a military man, with a bag on her shoulder. A foot stomper, but nice. The song was imagining if somebody was there taking down my number and I suddenly fell for her, and the kind of person I'd be, to fall for a meter maid, would be a shy office clerk and I'd say, 'May I inquire discreetly when you are free to take some tea with me.' Tea, not pot. It's like saying 'Come and cut the grass' and then realizing that could be pot, or the old teapot could be something about pot. But I don't mind pot and I leave the words in. They're not consciously introduced just to say pot and be clever.\" (from Beatles In Their Own Words)",
    "McCartney and Beatles producer George Martin both played pianos. Martin played the honky-tonk style in the middle.",
    "Combs and paper were used to create odd background noises.",
    "McCartney's vocal was sped-up a bit - one of the many studio tricks employed on the Sgt. Pepper album.",
    "Brian Wilson of the Beach Boys told Q magazine that this is his favorite Paul McCartney song. He recalled: \"I had a sneak preview of Sgt. Pepper when Paul came to visit me in 1967 and Lovely Rita made me laugh my head of. I love the way it comes floating in. The bassline is great and the lyrics are kind of funny too.\""
  ],
  "lyrics": "Lovely Rita meter maid\nNothing can come between us\nWhen it gets dark I tow your heart away\n\nStanding by a parking meter\nWhen I caught a glimpse of Rita\nFilling in a ticket in her little white book\nIn a cap she looked much older\nAnd the bag across her shoulder\nMade her look a little like a military man\n\nLovely Rita meter maid\nMay I inquire discreetly\nWhen are you free to take some tea with me\nTook her out and tried to win her\nHad a laugh and over dinner\nTold her I would really like to see her again\n\nGot the bill and Rita paid it\nTook her home I nearly made it\nSitting on the sofa with a sister or two\n\nOh, lovely Rita meter maid\nWhere would I be without you\nGive us a wink and make me think of you\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-127.jpg",
    "facts": "Thanks to Ron for this photo:When I caught a glimpse of RitaFilling in a ticket in her little white bookIn a cap she looked much olderAnd the bag across her shoulderMade her look a little like a military manThough there are no meters along downtown Brazilian streets, this young lady is the Brazilian equivalent to a meter maid. In order to park legally on the street downtown, one must purchase a parking pass from a lady like this for about a dollar. If she sees a parked car without one of these paper passes displayed above the dashboard in the front window, she will ticket your car. Then you must find her (or one of her sister meter maids) within 3 days to pay about three dollars. It gets even more expensive after three days. These women are members of a special squad of the Brazilian military police, but are referred to as \"Periquito\" or little parrot. This goes back to the days when they were outfitted entirely in bright green clothing to be noticable when ticketing from the streetside of a parked car. Their protestations about that style was heeded and these more conservative uniforms adopted a few years back. They do look very military and must keep their hair tight on the top of their heads. But this is afterall Brazil, where women can be arrested for not looking sexy, so the Periquitoes are encouraged to wear make-up and smile when writing tickets. Just as this one did when I paid her my three dollars."
  }
}