{
  "Artist": "The Beatles",
  "Album": "Revolver",
  "Title": "Love You To",
  "URL": "https://www.songfacts.com/facts/the-beatles/love-you-to",
  "Confidence": 1.0,
  "youtube-id": "Mki1p2Fbr28",
  "facts": [
    "George Harrison wrote this, and aside from some assistance by Ringo Starr on tambourine, is likely the only Beatle to play on the track. It was a step on his journey toward Eastern philosophy and Indian music, which was fully realized a year later on Harrison's Sgt. Pepper track \"Within You Without You,\" the first Beatles song to use only Indian instruments.",
    "This was the first Beatles song completely based on Indian music, and the first one George Harrison wrote on sitar. An earlier song, \"Norwegian Wood (This Bird Has Flown),\" also used a sitar, but was only partly influenced by Indian music. Harrison was learning the sitar from Ravi Shankar, who inspired him to learn more about Indian music and Eastern religion.",
    "The lyric is about the pressures Harrison was facing and how he felt like he was being used:\nThere's people standing round\nWho'll screw you in the ground\nThe words are at odds with the aesthetic of Indian music, but Harrison had yet to immerse himself in Eastern religion. His later songs in this vein take a much more philosophical approach.",
    "On this track, Harrison played the sitar, but he brought in musicians from a collective in London called the Asian Music Circle to play other Indian instruments, including a tabla, which is an Indian drum played with the hands, as well as a tambura. Anil Bhagwat played the tabla, but its not known who played the other instruments. Harrison also added acoustic and electric guitar to the track.",
    "In 1968, this was included in The Beatles movie Yellow Submarine."
  ],
  "lyrics": "Each day just goes so fast\nI turn around, it's past\nYou don't get time to hang a sign on me\n\nLove me while you can\nOr I'll get a plan\n\nA lifetime is so short\nA new one can't be bought\nBut what you've got means such a lot to me\n\nMake love all day long\nMake love singing songs\n\nMake love all day long\nMake love singing songs\n\nThere's people standing round\nWho screw you in the ground\nThey'll fill you in with all the things you see\n\nI'll make love to you\nIf you want me to\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}