{
  "Artist": "The Beatles",
  "Album": "Please Please Me",
  "Title": "Love Me Do",
  "URL": "https://www.songfacts.com/facts/the-beatles/love-me-do",
  "Confidence": 1.0,
  "youtube-id": "KPon7i1-T1U",
  "facts": [
    "John Lennon and Paul McCartney wrote this in 1958, when John was 17 and Paul was 16. They made time for songwriting by skipping school. They had written songs before, but \"Love Me Do\" was the first one they liked enough to record.",
    "McCartney wrote this about his girlfriend at the time, Iris Caldwell.",
    "This was The Beatles' first single. It was released in the UK on October 5, 1963 by Parlophone Records and climbed to #17 on January 2, 1963. The band got a lot bigger with their next UK singles, \"Please Please Me,\" which went to #2 on February 27, and \"From Me to You,\" which went to #1 on May 8.\nDespite their UK success, the group had a lot of trouble getting attention in America. Parlophone's US counterpart, Capitol Records, wouldn't release \"Love Me Do,\" figuring it would flop. It ended up getting American distribution on the smaller Tollie label, but not until April 27, 1964 during the height of Beatlemania. It rose to #1 on May 30, giving the group their fourth US #1 hit.",
    "By 1962, The Beatles were playing regular gigs at a club in Hamburg, Germany. They played cover songs -mostly blues tunes by American artists - so it was a big deal when they introduced an original, \"Love Me Do,\" into their set, as they didn't know how it would hold up against songs by Little Richard and Ray Charles. The song was well-received and gave The Beatles a lot of confidence, which led to them writing and performing more original songs.",
    "When they played this for an audition with Parlophone Records, the producer they auditioned for was George Martin, who became a key figure in Beatles history as he helped shape their sound. He started tinkering with the song right away, adding the harmonica part. Fortunately, John Lennon knew how to play the harmonica and was able to come up with something.",
    "The Beatles recorded versions of this song with three different drummers. At their first Parlophone audition in June 1962, Pete Best was still their drummer. When they recorded it on September 4, Ringo Starr was their drummer, but when George Martin decided it would be the single, he had them record it again a week later. \nAt this session, he used a session drummer named Andy White and stuck Ringo with the tambourine. The version with Ringo drumming was released as the UK single, but the version released on the album had Andy White's drumming. Ringo didn't pitch a fit when he got bumped at the session, but was very upset and felt real insecure, especially since The Beatles had just fired a drummer. The US single is the one with White on drums.",
    "When this was released in the UK, it was not a big hit. The Beatles' manager, Brian Epstein, was so confident in the group that he gave the single a big marketing push by buying a bunch of copies of it (some say 10,000) for his record store, which helped get it on the charts and ensured more exposure for the band.",
    "The Beatles were very close to releasing another song as their first single. At their September 4 recording session, George Martin decided their first single should be a song called \"How Do You Do It?\" which was written by someone else. The Beatles were not pleased and did some lackluster takes of the song before they were allowed to record \"Love Me Do.\" Eventually, Martin changed his mind and went with \"Love Me Do.\" \"How Do You Do It?\" became a hit for Gerry & the Pacemakers in 1964.",
    "Before they recorded this, Lennon always sang the lead vocal, but when his harmonica part was added, McCartney had to sing it because Lennon's mouth was full of harmonica. Paul claims that you can hear the fear in his voice at the audition.",
    "John stole the harmonica used in this song from a music shop in Arnhem, a Dutch town near to the German border, while the Beatles were on their way to Hamburg in 1960. This according to Allan Williams, who was their manager at the time. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Leo - Hilversum, Netherlands\n                                                  \n                                                  ",
    "Lennon's lips went numb from playing the harmonica at session. He was trying to sound like Delbert McClinton.",
    "Paul McCartney once called this, \"Our greatest philosophical song.\"",
    "This was recorded in mono on one-track tape. No stereo version exists.",
    "This song has been covered by The Brady Bunch, The Chipmunks, Dick Hyman, Flaco Jimenez, Madooo, The Persuasions, Sandie Shaw, Ringo Starr and Bobby Vee. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "When John's Aunt Mimi heard this song, she said to him \"Well, if you think you're going to make a fortune with that, you've got another thing coming.\"",
    "According to Q magazine, Parlophone employees weren't impressed when George Martin presented this song to them. One staffer inquired whether English comedian Spike Milligan was behind the record."
  ],
  "lyrics": "Love, love me do\nYou know I love you\nI'll always be true\nSo please, love me do\nWhoa, love me do\n\nLove, love me do\nYou know I love you\nI'll always be true\nSo please, love me do\nWhoa, love me do\n\nSomeone to love\nSomebody new\nSomeone to love\nSomeone like you\n\nLove, love me do\nYou know I love you\nI'll always be true\nSo please, love me do\nWhoa, love me do\n\nLove, love me do\nYou know I love you\nI'll always be true\nSo please, love me do\nWhoa, love me do\nYeah, love me do\nWhoa, oh, love me do\n                                                  \n                                                  Writer/s: John Winston Lennon, Paul James McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Downtown Music Publishing, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}