{
  "Artist": "The Beatles",
  "Album": "Sgt. Pepper's Lonely Hearts Club Band",
  "Title": "Lucy In The Sky With Diamonds",
  "URL": "https://www.songfacts.com/facts/the-beatles/lucy-in-the-sky-with-diamonds",
  "Confidence": 1.0,
  "youtube-id": "mgNYK96lQOg",
  "facts": [
    "The \"Lucy\" who inspired this song was Lucy O'Donnell (later Lucy Vodden), who was a classmate of John's son Julian Lennon when he was enrolled at the private Heath House School, in Weybridge, Surrey. It was in a 1975 interview that Lennon said, \"Julian came in one day with a picture about a school friend of his named Lucy. He had sketched in some stars in the sky and called it Lucy In The Sky With Diamonds.\"\nThe identity of the real Lucy was confirmed by Julian in 2009 when she died of complications from Lupus. Lennon re-connected with her after she appeared on a BBC broadcast where she stated: \"I remember Julian and I both doing pictures on a double-sided easel, throwing paint at each other, much to the horror of the classroom attendant… Julian had painted a picture and on that particular day his father turned up with the chauffeur to pick him up from school.\"\nConfusion over who was the real Lucy was fueled by a June 15, 2005 Daily Mail article that claimed the \"Lucy\" was Lucy Richardson, who grew up to become a successful movie art director on films such as 2000's Chocolat and 2004's The Life And Death Of Peter Sellers. Richardson died in June 2005 at the age of 47 of breast cancer.",
    "Many people thought this was about drugs, since the letters \"LSD\" are prominent in the title, and John Lennon, who wrote it, was known to drop acid. In 1971 Lennon told Rolling Stone that he swore that he had no idea that the song's initials spelt L.S.D. He added: \"I didn't even see it on the label. I didn't look at the initials. I don't look - I mean I never play things backwards. I listened to it as I made it. It's like there will be things on this one, if you fiddle about with it. I don't know what they are. Every time after that though I would look at the titles to see what it said, and usually they never said anything.\"\nLennon affirmed this on the Dick Cavett Show, telling the host, \"My son came home with a drawing of a strange-looking woman flying around. He said, 'It's Lucy in the sky with diamonds.' I thought, 'That's beautiful.' I immediately wrote the song about it.\"\nIt's not just fans that didn't believe him: Paul McCartney said it was \"pretty obvious\" that this song was inspired by LSD.",
    "In our interview with Donovan, who was good friends with John Lennon and joined The Beatles on their 1968 retreat to India, he made the point that Lennon often thought in terms of artwork, and like Donovan did on this song \"Wear Your Love Like Heaven,\" Lennon painted images in his head that became the lyrics for this song. \"When we put the painter's brush down and we picked up the guitar, a lot of the songwriters started 'painting' songs,\" he said. \"You'd just have to think of John's 'Picture yourself on a boat on a river' - you're actually in a movie or you're in a painting. 'Tangerine trees and marmalade skies' - he's painting.",
    "The images Lennon used in the song were inspired by the imagery in  Through The Looking-Glass, the sequel to the book Alice In Wonderland. \"It was Alice in the boat,\" Lennon explained in a Playboy interview. \"She is buying an egg and it turns into Humpty Dumpty. The woman serving in the shop turns into a sheep and the next minute they are rowing in a rowing boat somewhere and I was visualizing that.\"",
    "George Harrison played a tambura on this track. It's an Indian instrument similar to a sitar that makes a droning noise. He had been studying with Indian musician Ravi Shankar, who is the father of Norah Jones.",
    "This was banned by the BBC (British Broadcasting Company) for what they thought were drug references.",
    "Elton John released a cover version of this song in 1974 that hit #1 in the US the first week of 1975. Elton is the only artist to top the tally with a Beatles cover, although Peter & Gordon took \"A World Without Love,\" which was written by Lennon and McCartney, to #1 in 1964.\nJohn Lennon sang and played guitar on Elton's \"Lucy in the Sky With Diamonds,\" but reportedly forgot some of the chords and needed Davey Johnston, Elton John's guitarist, to help him out. Lennon made a surprise appearance in Elton's Thanksgiving concert in New York and performed three songs, which proved to be his last public performance.",
    "Actor William Shatner, who played Captain Kirk on Star Trek, covered this in his dramatic, spoken-word style. In at least one poll, this version was voted the worst Beatles cover of all time.",
    "In 1974, Johanson and Gray named the 3 million-year-old Australopithecus fossil skeleton they discovered (the oldest ever found) Lucy, after this song because it was playing on the radio when Johanson and his team were celebrating the discovery back at camp. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Martuuuu - Capital Federal, Argentina\n                                                  \n                                                  ",
    "Lennon said \"The girl with kaleidoscope eyes\" turned out to be Yoko: \"There was also the image of the female who would someday come save me... a 'girl with kaleidoscope eyes' who would come out of the sky. It turned out to be Yoko, though I hadn't met Yoko yet. So maybe it should be 'Yoko in the Sky with Diamonds.'\"",
    "During the media controversy over this song in June of 1967, Paul McCartney admitted to a reporter that the band did experiment with LSD. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "In 2004, McCartney addressed the issue of drugs in an interview with the Daily Mirror newspaper: \"'Day Tripper,' that's one about acid. 'Lucy In The Sky,' that's pretty obvious. There are others that make subtle hints about drugs, but it's easy to overestimate the influence of drugs on The Beatles' music. Just about everyone was doing drugs in one form or another, and we were no different, but the writing was too important for us to mess it up by getting off our heads all the time.\"",
    "A group called John Fred and his Playboy Band had a #1 hit in 1968 with \"Judy In Disguise (with Glasses),\" a song that is a parody of \"Lucy in the Sky With Diamonds.\"",
    "In the Anthology one of the Beatles referred to being on LSD as like seeing through a kaleidoscope. Although Lennon denied this is about drugs, it does refer to \"The girl with kaleidoscope eyes.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n delirium trigger - new brunswick, NY\n                                                  \n                                                  ",
    "This song is very distinctive musically: It's in three different keys and uses two different beats. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "Lennon admitted to British journalist Ray Connolly in an interview around the time of the break-up of the Beatles that he didn't think he sang this song very well. \"I was so nervous I couldn't sing,\" he said, \"but I like the lyrics.\"",
    "In 2004 the Harvard-Smithsonian Center for Astrophysics announced the discovery of the universe's largest known diamond, white dwarf star BPM 37093. Astronomers gave the star the catchier name of \"Lucy\" from this song.",
    "The Flaming Lips covered this as part of their track-for-track tribute to the Sgt. Pepper album, With a Little Help from My Fwends. Their version of this song features Miley Cyrus. Frontman Wayne Coyne told NME: \"On my birthday, Miley Cyrus tweeted me 'Happy Birthday.' I texted back 'Let's do something together.' So we swapped numbers and soon found ourselves in the same studio. I've been around people in the same position to her and they are not fun. She's badass, and she does things with enthusiasm and love.\""
  ],
  "lyrics": "Picture yourself in a boat on a river\nWith tangerine trees and marmalade skies\nSomebody calls you, you answer quite slowly\nA girl with kaleidoscope eyes\n\nCellophane flowers of yellow and green\nTowering over your head\nLook for the girl with the sun in her eyes\nAnd she's gone\n\nLucy in the sky with diamonds\nLucy in the sky with diamonds\nLucy in the sky with diamonds\nAh\n\nFollow her down to a bridge by a fountain\nWhere rocking horse people eat marshmallow pies\nEveryone smiles as you drift past the flowers\nThat grow so incredibly high\n\nNewspaper taxis appear on the shore\nWaiting to take you away\nClimb in the back with your head in the clouds\nAnd you're gone\n\nLucy in the sky with diamonds\nLucy in the sky with diamonds\nLucy in the sky with diamonds\nAh\n\nPicture yourself on a train in a station\nWith plasticine porters with looking glass ties\nSuddenly someone is there at the turnstile\nThe girl with the kaleidoscope eyes\n\nLucy in the sky with diamonds\nLucy in the sky with diamonds\nLucy in the sky with diamonds\nAh\nLucy in the sky with diamonds\nLucy in the sky with diamonds\nLucy in the sky with diamonds\nAh\nLucy in the sky with diamonds\nLucy in the sky with diamonds\nLucy in the sky with diamonds\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}