{
  "Artist": "The Beatles",
  "Album": "Let It Be",
  "Title": "Maggie Mae",
  "URL": "https://www.songfacts.com/facts/the-beatles/maggie-mae",
  "Confidence": 1.0,
  "youtube-id": "eDYrDhcPLY0",
  "facts": [
    "This is a traditional song about Liverpool prostitutes (\"Maggie\" is British slang for prostitute). Many British groups have recorded it.",
    "The Beatles used to play this when they were still known as The Quarrymen, including at the church fair when John Lennon met Paul McCartney.",
    "This was one of the songs they would use to warm up at recording sessions.",
    "The Beatles recorded this between takes of \"Two Of Us.\" The album was supposed to be a return to The Beatles early days when they played live, so this was left on. The album was delayed until after The Beatles broke up, so Phil Spector was brought in to produce it from the tapes.",
    "This was left off the album when it was released in 2003 without Phil Spector's orchestrations.",
    "This was the first song on a Beatles album since Help that was not written by any members of the band. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Lime Street is a famous street in Liverpool where prostitutes were known to work. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Loretta - Liverpool, England\n                                                  \n                                                  ",
    "When The Beatles released their Let It Be... Naked album in 2003, this song and \"Dig It\" were omitted. The album was a re-release of Let It Be with stripped-down production more in line with Paul McCartney's vision. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "Oh dirty Maggie Mae they have taken her away\nAnd she never walk down Lime Street any more\nOh the judge he guilty found her\nFor robbing a homeward bounder\nThat dirty no good robbin' Maggie Mae\nTo the port of Liverpool\nThey returned me to\nTwo pounds ten a week, that was my pay\n                                                  \n                                                  Writer/s: JOHN LENNON, PAUL MCCARTNEY, GEORGE HARRISON, RICHARD STARKEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, BMG Rights Management, STARTLING MUSIC LTD            C/O BRUCE V. GRAKAL, CONCORD MUSIC PUBLISHING LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}