{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "Martha My Dear",
  "URL": "https://www.songfacts.com/facts/the-beatles/martha-my-dear",
  "Confidence": 1.0,
  "youtube-id": "RXawa90YU2s",
  "facts": [
    "Paul McCartney had a sheepdog named Martha. According to the book A Hard Day's Write, the song is actually about McCartney's \"muse\" - the voice in his head that tells him what words and music to write. He did have a dog named Martha but named her after his muse. Paul Simon wrote about his muse in \"Cecilia\" and Bob Dylan wrote about his in \"Love Minus Zero/No Limit.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ed - Perth, Australia\n                                                  \n                                                  ",
    "Fourteen session musicians were used to play strings and horns.",
    "Lennon played guitar on this while Harrison supplied bass. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "One of Martha's offspring can the seen on the cover of McCartney's 1993 album Paul Is Live.",
    "Seth Swirsky, who wrote the songs \"Tell It To My Heart\" and \"Love Is a Beautiful Thing,\" produced the Beatles documentary Beatles Stories, where he interviewed over 100 people who crossed paths with the Fab 4. When we asked Seth who his favorite songwriter was, he replied: \"My favorite of all time is Paul McCartney. He could do so many things, and he could do things that are hard to quantify. Some people might say, 'Well, I like Hall and Oates as songwriters,' let's just say. But they do that 8th note thing where they're just banging on the piano, like 'Kiss On My List,' so you could kind of copy their sound a little bit, or copy their style of writing. Very hard to copy McCartney, because you just don't come out with 'Martha My Dear,' where it changes keys in the middle of it.\"",
    "A young Stuart Goddard, whose mother used to clean Paul McCartney's apartment in St. John's Wood, would sometimes take the sheepdog Martha for walks. Goddard would grow up to be Adam Ant."
  ],
  "lyrics": "Martha, my dear\nThough I spend my days in conversation, please\nRemember me\nMartha, my love\nDon't forget me\nMartha, my dear\n\nHold your head up, you silly girl\nLook what you've done\nWhen you find yourself in the thick of it\nHelp yourself to a bit of what is all around you\nSilly girl\n\nTake a good look around you\nTake a good look you're bound to see\nThat you and me were meant to be\nWith each other\nSilly girl\n\nHold you're hand out, you silly girl\nSee what you've done\nWhen you find yourself in the thick of it\nHelp yourself to a bit of what is all around you\nSilly girl\n\nMartha, my dear\nYou have always been my inspiration\nPlease, be good to me\nMartha, my love\nDon't forget me\nMartha, my dear.\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}