{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Maxwell's Silver Hammer",
  "URL": "https://www.songfacts.com/facts/the-beatles/maxwells-silver-hammer",
  "Confidence": 1.0,
  "youtube-id": "mJag19WoAe0",
  "facts": [
    "Paul McCartney wrote this song, which is about a medical student (Maxwell Edison) who kills people. The lyric is whimsical dark comedy culled from McCartney's imagination. Growing up, his family loved to make up outrageous stories and tell tall tales, and this seeped into McCartney's songwriting, as he often made up characters for his songs. John Lennon, on the other hand, would usually base his songs on real people and events.",
    "Paul McCartney said of this song: \"It epitomizes the downfalls in life. Just when everything is going smoothly, Bang! Bang! Down comes Maxwell's Silver Hammer and ruins everything.\"",
    "McCartney played a Moog synthesizer, but there is a much more unusual instrument on this song as well: an anvil. It's a blacksmith's tool that showed up in a lot of those wonderfully violent Looney Tunes cartoons when a heavy object was needed for comic effect. Ringo is the one who banged on the anvil, which was rented from a company that supplied stage props.",
    "John Lennon didn't play on this song - he was not at the sessions for this because he was recovering from a car accident. Lennon abased the track in later interviews, saying he hated the song and that McCartney used way too much studio time recording it.",
    "McCartney has never implied a specific inspiration for this song, but fans speculated that he was expressing his frustrations with certain people in the band's inner circle, perhaps hoping that a figurative hammer would crash down on Yoko Ono or their manager, Allen Klein.",
    "The recording sessions went on for three days (July 9-11, 1969) as McCartney tried to get it just right. This strained his already tense relationship with the Beatles, who broke up soon after recording Abbey Road. In a 2008 interview with Rolling Stone magazine, Ringo Starr said, \"The worst session ever was 'Maxwell's Silver Hammer.' It was the worst track we ever had to record. It went on for f--king weeks. I thought it was mad.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n VinnyVegas - Durham, NC\n                                                  \n                                                  ",
    "The Beatles performed this in their movie Let It Be.",
    "The cover of the album fueled rumors that Paul McCartney was dead. The cover shows all four Beatles walking in a crosswalk of Abbey Road. John is leading, followed by Ringo, Paul, and finally George. According to the rumor, what they were wearing signified a funeral procession. John was dressed in white as if he was God, Ringo was dressed in a black suit as if he was a Preacher, and George was wearing grungy clothing, as if he was the grave digger. Paul was dressed in a dark-gray suit, was carrying a cigarette, and has his eyes closed. Also, he is the only one walking barefoot. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Patrick - Conyers, GA\n                                                  \n                                                  ",
    "This originally opened with a brief instrumental intro that was edited out. It used the same chords as the ending of the song. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Barry Kesten - Bellmore, United States\n                                                  \n                                                  ",
    "McCartney's handwritten lyrics for this song were sold at auction for $192,000. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "Only The Beatles could have created a lighthearted song about a murderer. Punk rockers were impressed. Rat Scabies of The Damned said in the Songfacts Podcast: \"The Beatles made that transition from having the same haircut and suit to dropping acid and writing songs that are about sex and violence. 'Maxwell's Silver Hammer' is about a psychotic murderer. The Beatles could sing about anything and people would love it. You listen to the lyrics on that song, and it's written from the killer's perspective.\""
  ],
  "lyrics": "Joan was quizzical, studied pataphysical\nScience in the home\nLate nights all alone with a test tube\nOh, oh, oh, oh\n\nMaxwell Edison, majoring in medicine\nCalls her on the phone\n\"Can I take you out to the pictures\nJoa, oa, oa, oan?\"\n\nBut as she's getting ready to go\nA knock comes on the door\n\nBang! Bang! Maxwell's silver hammer\nCame down upon her head\nBang! Bang! Maxwell's silver hammer\nMade sure that she was dead\n\nBack in school again Maxwell plays the fool again\nTeacher gets annoyed\nWishing to avoid and unpleasant\nSce, e, e, ene\n\nShe tells Max to stay when the class has gone away\nSo he waits behind\nWriting fifty times \"I must not be\nSo, o, o, o\"\n\nBut when she turns her back on the boy\nHe creeps up from behind\n\nBang! Bang! Maxwell's silver hammer\nCame down upon her head\nBang! Bang! Maxwell's silver hammer\nMade sure that she was dead\n\nP. C. Thirty-one said, \"We caught a dirty one\"\nMaxwell stands alone\nPainting testimonial pictures\nOh, oh, oh, oh\n\nRose and Valerie, screaming from the gallery\nSay he must go free\n(Maxwell must go free)\nThe judge does not agree and he tells them\nSo, o, o, o\n\nBut as the words are leaving his lips\nA noise comes from behind\n\nBang! Bang! Maxwell's silver hammer\nCame down upon his head\nBang! Bang! Maxwell's silver hammer\nMade sure that he was dead\n\nWhoa, oh, oh, oh\nSilver hammer man\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, BMG Rights Management\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}