{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Mean Mr Mustard",
  "URL": "https://www.songfacts.com/facts/the-beatles/mean-mr-mustard",
  "Confidence": 1.0,
  "youtube-id": "oMarHac3VpQ",
  "facts": [
    "John Lennon wrote most of this when he was in India at the Maharishi's meditation camp with the other Beatles in 1967. He didn't think much of the song, calling it and \"Polythene Pam\" \"finished bits of crap that I wrote in India.\"",
    "Lennon got the idea for this song from a newspaper article he read about a miser who hid his cash everywhere so nobody could find it. The article appeared in the Daily Mirror on June 7, 1967, with the headline, \"Scotsman's Meanness 'Was Cruel.'\"\n\"Mr. Mustard\" was John Mustard, who was described in the story as \"an exceptionally mean man.\" His wife was divorcing him because, among other things, she couldn't stand being in the dark all the time - he insisted on keeping the lights off most of the time to save money.\nIt wasn't the first time John Lennon was inspired by a newspaper story: some of the lyrics in \"A Day In The Life\" came from articles he read in the Daily Mail.",
    "The Beatles recorded this as one song with \"Sun King.\" It's part of a suite of songs at the end of Abbey Road. ",
    "The Beatles considered using this on The White Album, but decided not to."
  ],
  "lyrics": "Mean Mister Mustard sleeps in the park\nShaves in the dark trying to save paper\nSleeps in a hole in the road\nSaving up to buy some clothes\nKeeps a ten-bob note up his nose\nSuch a mean old man\nSuch a mean old man\n\nHis sister Pam works in a shop\nShe never stops, she's a go-getter\nTakes him out to look at the queen\nOnly place that he's ever been\nAlways shouts out something obscene\nSuch a dirty old man\nDirty old man\n                                                  \n                                                  Writer/s: JOHN LENNON, PAUL MCCARTNEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-201.jpg",
    "facts": "This story in the Daily Mirror from June 7, 1967 gave John Lennon the idea for \"Mean Mr. Mustard.\" According to the article, John Mustard really did shave in the dark, although he probably didn't sleeps in a hole in the road."
  }
}