{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "Michelle",
  "URL": "https://www.songfacts.com/facts/the-beatles/michelle",
  "Confidence": 1.0,
  "youtube-id": "_AWhTCIQdk4",
  "facts": [
    "John Lennon invited McCartney over to college parties when he was still in high school, and French culture was a trend. Paul would try to fit in by sitting in a corner and pretending to be French. He would play little tunes in French, but he only knew a few French words so he would groan or make words up. John told him that he should make it into a real song for Rubber Soul, so he asked his friend Ivan Vaughan, whose wife was a French teacher, for a French name and some words to rhyme with it. Vaughan came up with \"Michelle, ma belle.\" McCartney came up with the next line, \"These are words that go together well,\" and Vaughan taught him the French translation, \"Sont des mots qui vont tres bien ensemble,\" which he used in the song as well. When he played it for Lennon, John suggested the \"I love you\" part in the middle. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Klasic Rok - Battle Ground, WA\n                                                  \n                                                  ",
    "This is not based on any particular woman. They chose the name because it sounded good.",
    "None of The Beatles spoke French. They picked up some German when they went there in 1962, but no French.",
    "This won a Grammy in 1966 for Song of the Year, one of just four Grammys The Beatles won while they were still active.",
    "In France, this went to #1.",
    "McCartney mailed a check to Ivan Vaughn's wife, Jan, for helping with the French lyrics. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The French verse is often misheard as \"Sunday monkey won't play piano song.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Patrick - Tallapoosa, GA\n                                                  \n                                                  ",
    "Paul McCartney said in Observer Music Monthly October 2007: \"We used to go to these art school parties because John was at art school and me and George were at the school next door, which is now a performing arts school. John was that little bit older than us, which at that age is impressive. He was a year-and-a-half older than me and you really look up to people like that. But it's funny because I don't think I had that same feeling with Ringo, who I think was a few months older than John. John was a pretty impressive cat - being a year-and-a-half older and going to art school, all that was a pretty cool combination for us. So we'd tag along to these parties, and it was at the time of people like Juliette Greco, the French bohemian thing. They'd all wear black turtleneck sweaters, it's kind of where we got all that from, and we fancied Juliette like mad. Have you ever seen her? Dark hair, real chanteuse, really happening. So I used to pretend to be French, and I had this song that turned out later to be 'Michelle.' It was just an instrumental, but years later John said: 'You remember that thing you wrote about the French?' I said: 'Yeah.' He said: 'That wasn't a bad song, that. You should do that, y'know.'\"",
    "The singer-songwriter Michelle Branch was named after this song. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n George - Calumet City, IL\n                                                  \n                                                  ",
    "Encouraged by the successful foray into French on this song, Beatles ami Donovan sang a verse of his 1968 hit \"Jennifer Juniper\" in French.",
    "When Paul McCartney received the Library of Congress Gershwin Prize for Popular Song award at a White House ceremony in 2010, he did something he later said he'd been itching to do for a while: sing \"Michelle\" to the First Lady. President Obama credited McCartney with helping \"to lay the soundtrack for an entire generation.\" For his part, Sir Paul managed to work in a line hinting at his view of American presidential politics. \"After the last eight years, \" he joked, \"it's great to have a president who knows what a library is.\" McCartney is the third recipient of the award - Paul Simon and Stevie Wonder are previous honorees - which recognizes songwriters \"whose careers reflect a lifetime achievement in promoting song as a vehicle of artistic expression and cultural understanding.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "Michelle, ma belle\nThese are words that go together well\nMy Michelle\nMichelle, ma belle\nSont les mots qui vont tres bien ensemble\nTres bien ensemble\nI love you, I love you, I love you\nThat's all I want to say\nUntil I find a way\nI will say the only words I know that you'll understand\n\nMichelle, ma belle\nSont les mots qui vont tres bien ensemble\nTres bien ensemble\nI need to, I need to, I need to\nI need to make you see\nOh, what you mean to me\nUntil I do, I'm hoping you will know what I mean\nI love you...\n\nI want you, I want you, I want you\nI think you know by now\nI'll get to you somehow\nUntil I do, I'm telling you so you'll understand\nMichelle, ma belle\nSont les mots qui vont tres bien ensemble\nTres bien ensemble\nAnd I will say the only words I know that you'll understand\nMy Michelle\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}