{
  "Artist": "The Beatles",
  "Album": "Please Please Me",
  "Title": "Misery",
  "URL": "https://www.songfacts.com/facts/the-beatles/misery",
  "Confidence": 1.0,
  "youtube-id": "VqNT0fjlzmE",
  "facts": [
    "John Lennon and Paul McCartney wrote this for Helen Shapiro, a 16-year-old singer who toured with The Beatles in 1963. Her management rejected the song, but another singer on that tour, Kenny Lynch, did record it, becoming the first person to cover a Lennon/McCartney song. The Beatles recorded it themselves when they needed material for their Please Please Me album, which was quickly released in the UK to capitalize on the success of their first two singles: \"Please Please Me\" and \"Love Me Do.\"\nKenny Lynch had a successful career as a recording artist in the UK, with seven Top 40 hits, including the #10 charting cover of The Drifters' \"Up on The Roof.\" Later Lynch became better known as a TV presenter and songwriter (he co-wrote Small Faces' #3 hit \"Sha La La La Lee\"). Lynch established another link with McCartney when he appeared on the sleeve of Wings' Band on the Run album.",
    "The Beatles were in such a rush to cram material on the new Please Please Me album that they picked up several covers. One was written by Brill Building legends Gerry Goffin and Carole King, titled \"Chains\"; another was The Shirelles' hit \"Boys.\" \"Misery\" was one of the eight original songs on the album.",
    "Turning down a Lennon/McCartney song seems a little ridiculous, but Helen Shapiro, whom they wrote this song for, was a top-selling female vocalist in the UK, and was putting together a country-western album and her manager contacted The Beatles to ask if they could write a song for her. They offered him \"Misery,\" but he turned it down as it didn't fit her sound. The Beatles weren't a huge deal at the time, so the manager didn't see the potential in the song.",
    "This song also appears on the sought-after EP single The Beatles (No. 1), which features this song, \"I Saw Her Standing There,\" \"Anna (Go to Him),\" and \"Chains.\"",
    "The American release of the Please Please Me album was Introducing... The Beatles. Compare and contrast the two album covers for an idea of how they were marketed; the UK cover has a playful shot of the Fab Four peeking over a balcony, while the US cover has a far more conventional pose standing and sitting in suits that make them almost seem like a '50s doo-wop group. Can't go scaring those conservative Americans by making your group seem to \"challenging,\" now."
  ],
  "lyrics": "The world is treating me bad, misery\nI'm the kind of guy\nWho never used to cry\nThe world is treatin' me bad, misery\n\nI've lost her now for sure\nI won't see her no more\nIt's gonna be a drag, misery\n\nI'll remember all the little things we've done\nCan't she see she'll always be the only one, only one\n\nSend her back to me\n'Cause everyone can see\nWithout her I will be in misery\n\nI'll remember all the little things we've done\nShe'll remember and she'll miss her only one, lonely one\n\nSend her back to me\n'Cause everyone can see\nWithout her I will be in misery (oh oh oh)\nIn misery (ooh ooh ooh)\nMy misery (la la la la la la)\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Round Hill Music Big Loud Songs, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}