{
  "Artist": "The Beatles",
  "Album": "CD2 - The Beatles",
  "Title": "Mother Nature's Son",
  "URL": "https://www.songfacts.com/facts/the-beatles/mother-natures-son",
  "Confidence": 1.0,
  "youtube-id": "OfFS4Lu83EY",
  "facts": [
    "Paul McCartney wrote this in India after the Maharishi gave a speech about nature. The 4 Beatles were attending the camp to learn transcendental meditation, but were not impressed with the results. John Lennon's demo \"Child of Nature,\" which he later re-worked into \"Jealous Guy,\" was similarly inspired by Maharishi's lecture.",
    "McCartney recorded this by himself after the other Beatles had left the studio.",
    "Paul McCartney told Mojo magazine October 2008 that Nat King Cole's 1948 standard \"Nature Boy\" influenced this gentle pastoral, \"because that's a song I love.\" He added: \"At that time I considered myself a guy leaning towards the countryside. But I would have to tip a wink to Nature Boy. Though, when you think about it, the only thing they have in common is the word 'nature'- the rest of the link is pretty tenuous.\"",
    "John Denver recorded this in 1972. He was going to name his album after this song, but changed it when he came up with the song \"Rocky Mountain High.\"",
    "The song's bongo-style percussion sound was achieved by miking up the drums in the Abbey Road corridor."
  ],
  "lyrics": "Born a poor young country boy\nMother Nature's son\nAll day long I'm sitting singing songs for everyone.\n\nSit beside a mountain stream\nSee her waters rise\nListen to the pretty sound of music as she flies.\n\nFind me in my field of grass\nMother Nature's son\nSwaying daises sing a lazy song beneath the sun.\n\nMother Nature's son.\n                                                  \n                                                  Writer/s: JOHN LENNON, JOHN WINSTON LENNON, PAUL MCCARTNEY, PAUL JAMES MCCARTNEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}