{
  "Artist": "The Beatles",
  "Album": "Beatles for Sale",
  "Title": "Mr. Moonlight",
  "URL": "https://www.songfacts.com/facts/the-beatles/mr-moonlight",
  "Confidence": 1.0,
  "youtube-id": "4nWcgyUVZu4",
  "facts": [
    "The original version of this was released by a blues group called Dr. Feelgood and The Interns in 1962. It was written by Roy Lee Johnson, who was a guitarist with The Interns. This original version the song was a B-side to the single \"Dr. Feelgood\" (no relation to the Motley Crue album and song of the same name), by the aforementioned group. As if that didn't muddy the waters enough, there's also a TV series Moonlight with an episode titled \"Dr. Feelgood,\" which appears to be a complete coincidence.\nThe song is best known for its Beatles cover, but even among hardcore Beatles fans, this song doesn't have as much enthusiastic support. It was part of their standard stage set for many years, in part because it gave John a chance to show off his blistering vocals on stage.",
    "George Harrison played the African Drum, and Paul McCartney played the Hammond organ solo on this track. The sound of a Hammond organ sounds quite dated now, but they were a big rage back in the mid-20th century. The electric organs were manufactured from the 1930s to the 1970s, by which time they were a staple of every shopping mall, where the organ store would often feature bored showroom employees plonking out show tunes. The organs were widely popular for being a cheap alternative to pipe organs, and thus easily affordable for churches."
  ],
  "lyrics": "Mister Moonlight\n\nYou came to me one summer night\nAnd from your beam you made my dream\nAnd from the world you sent my girl\nAnd from above you sent us love\nAnd now she is mine, I think you're fine\n'Cause we love you, Mister Moonlight\n\nMister Moonlight, come again please\nHere I am on my knees begging if you please\nAnd the night you don't come my way\nI pray and pray more each day\n'Cause we love you, Mister Moonlight\n\nAnd the night you don't come my way\nOh, I pray and pray more each day\n'Cause we love you, Mister Moonlight\n\nMister Moonlight, come again please\nHere I am on my knees begging if you please\nAnd the night you don't come my way\nOh, I pray and pray more each day\n'Cause we love you, Mister Moonlight\nMister Moonlight, Mister Moonlight, Mister Moonlight\n                                                  \n                                                  Writer/s: Roy Johnson \n\n                                                   Publisher: CONCORD MUSIC PUBLISHING LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}