{
  "Artist": "The Beatles",
  "Album": "Beatles for Sale",
  "Title": "No Reply",
  "URL": "https://www.songfacts.com/facts/the-beatles/no-reply",
  "Confidence": 1.0,
  "youtube-id": "YgFo9STa70E",
  "facts": [
    "This was one of John Lennon's first songs to tell a complete story. The boy knocks on his girl's door, knows she is home because he sees her in the window, but she does not answer. Lennon wrote the song when he was inspired by the song \"Silhouettes.\" He said, \"I had that image of walking down the street and seeing her silhouetted in the window and not answering the phone.\" Music publisher Dick James told Lennon that it was the first \"complete\" song that John had ever written: It had a beginning and an end.",
    "This starts with a vocal, which was rare for the time.",
    "This was yet another early Beatles song originally written for another artist. \"No Reply\" was written for Tommy Quickly, another Liverpudlian who was also signed to Beatles manager Brian Epstein. Quickly never recorded and released the song, so the Beatles used it themselves. Quickly's story rapidly deteriorated; he had a number of singles that failed to chart, then one minor hit, \"Wild Side of Life,\" before fading back into obscurity. This Mersey Beat article seems to indicate that he just wasn't cut out for the spotlight.",
    "Lennon was asked about this song shortly before he died in 1980. He replied: \"I had that image of walking down the street and seeing her silhouetted in the window and not answering the phone, although I never called a girl in my life because phones weren't part of the English child's life.\"",
    "That's record producer George Martin tickling the ivories. Meanwhile, on the demo version, Ringo was absent from the recording session; he was laid up with tonsillitis and pharyngitis. Jimmie Nicol might have done the drum work here, since he was also drafted to replace Ringo on their upcoming tour. Ringo was back at his station by the time this album version was recorded.",
    "This song's demo recording was lost due to a filing error, then found again by 1993 and re-released on Anthology 1.",
    "In the June/July issue of AARP magazine, Rosanne Cash published a two-page article titled \"My Favorite Beatles Song.\" In it, she talked about \"No Reply,\" a song that she's been listening to since she was 10 years old. Cash explained that the song mirrored her own relationship with her parents, including country music icon Johnny Cash.\nCash wrote, \"The subtext of my own life was the same as the one in 'No Reply;' I knocked on my parents' door and no one answered. My mother and father were not at home. Just like the song: 'When I came to your door - No reply.'\"\nShe added: \"Lennon's howl that he 'nearly died' is the denoument of the emotional arc,\" Cash goes on. \"He says it twice in the second verse. It has the stark intensity of Hank Williams' line, 'I'm so lonesome I could cry.' Or my dad singing 'I walk the line': plaintive to the point of transcending the meaning. The life that shows up in the voice is made of choices.\"\nShe finishes her piece by saying, \"I've returned to 'No Reply' in every stage of my life... I love the girl who cheated. I love the boy who had his heart broken. I love myself as I was on both sides of the door. The sequence of events is switched, however: I nearly died, then I saw the light. But I'm still reaching for 'No Reply.'\""
  ],
  "lyrics": "This happened once before\nWhen I came to your door\nNo reply\nThey said it wasn't you\nBut I saw you peep through\nYour window\nI saw the light\nI saw the light\nI know that you saw me\n'Cause I looked up to see\nYour face\n\nI tried to telephone\nThey said you were not home\nThat's a lie\n'Cause I know where you've been\nAnd I saw you walk in\nYour door\nI nearly died\nI nearly died\n'Cause you walked hand in hand\nWith another man\nIn my place\n\nIf I were you, I'd realize that I\nLove you more than any other guy\nAnd I'll forgive the lies that I\nHeard before, when you gave me no reply\n\nI tried to telephone\nThey said you were not home\nThat's a lie\n'Cause I know where you've been\nAnd I saw you walk in\nYour door\nI nearly died\nI nearly died\n'Cause you walked hand in hand\nWith another man\nIn my place\n\nNo reply\nNo reply\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}