{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "Norwegian Wood (This Bird Has Flown)",
  "URL": "https://www.songfacts.com/facts/the-beatles/norwegian-wood-this-bird-has-flown",
  "Confidence": 1.0,
  "youtube-id": "3qNLwH0MTxQ",
  "facts": [
    "This was the first pop song to use a sitar - George Harrison played it. Harrison was new to the sitar and took many takes to get it right. He bought the instrument, which he described as \"crummy,\" and taught himself to play. It was David Crosby of The Byrds who introduced Harrison to the sitar shortly after the folk musician Shawn Phillips had shown him the basic steps. A few months later, Harrison studied the instrument with the Indian musician Ravi Shankar, who helped Harrison explore Eastern music and religion.\nIn an interview with Rolling Stone in 1971, John Lennon explained why they decided to use the sitar on this song. He recalled: \"I think it was at the studio. George had just got the sitar and I said 'Could you play this piece?' We went through many different sort of versions of the song, it was never right and I was getting very angry about it, it wasn't coming out like I said. They said, 'Well just do it how you want to do it' and I said, 'Well I just want to do it like this.' They let me go and I did the guitar very loudly into the mike and sang it at the same time and then George had the sitar and I asked him could he play the piece that I'd written, you know, dee diddley dee diddley dee, that bit, and he was not sure whether he could play it yet because he hadn't done much on the sitar but he was willing to have a go, as is his wont, and he learned the bit and dubbed it on after. I think we did it in sections.\"",
    "There are not many lyrics in this song, but they tell the story of a man who gets invited to a girl's house. When she won't let him into her bed, he sleeps in the tub. When she leaves the next morning, he sets the place on fire. It was one of the first songs Lennon wrote that told a complete story.",
    "Norwegian Wood is a fake wood that was used to make cheap furniture. John Lennon claimed he had no idea where the title came from, but Paul McCartney said he came up with it, inspired by the Norwegian Wood in the Asher household, where he was staying. McCartney was dating Jane Asher, and was good friends with her brother, Peter Asher from the duo Peter & Gordon.",
    "John Lennon said of this song: \"I was trying to write about an affair without letting my wife know I was having one. I was sort of writing from my experiences - girl's flats, things like that. I was very careful and paranoid because I didn't want my wife, Cyn, to know that there really was something going on outside of the household. I'd always had some kind of affairs going on, so I was trying to be sophisticated in writing about an affair, but in such a smoke-screen way that you couldn't tell. But I can't remember any specific woman it had to do with.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The Beatles recorded this on October 12, 1965, the first day of the Rubber Soul sessions. The first take of the song, which is included on the Anthology 2 CD and includes George's sitar much more prominently, was originally going to be put on Rubber Soul until a remake was made a week or two later. The notes in the Anthology 2 album verify this. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Ringo played the finger cymbals on this track.",
    "Bob Dylan wrote a parody of sorts to this song called \"Fourth Time Around,\" which appears on his 1966 album Blonde On Blonde. His song uses a similar melody; it also tells a story about a strange encounter with a girl.",
    "It was Paul McCartney who came up with the album title Rubber Soul. Lennon told Rolling Stone that he supposed it was a pun meaning English Soul. He added: \"There is no great mysterious meaning behind all of this, it was just four boys working out what to call a new album.\"",
    "Some of the many artists to cover this song include José Feliciano, Herbie Hancock and Buddy Rich. The mellow rap group P.M. Dawn also did a version on their 1993 The Bliss Album, and Cornershop covered it on their 1997 album When I Was Born for the 7th Time - the one with their #1 UK hit \"Brimful Of Asha.\""
  ],
  "lyrics": "I once had a girl\nOr should I say she once had me\nShe showed me her room\nIsn't it good Norwegian wood?\n\nShe asked me to stay\nAnd she told me to sit anywhere\nSo I looked around\nAnd I noticed there wasn't a chair\n\nI sat on a rug biding my time\nDrinking her wine\nWe talked until two and then she said\n\"It's time for bed\"\n\nShe told me she worked\nIn the morning and started to laugh\nI told her I didn't\nAnd crawled off to sleep in the bath\n\nAnd when I awoke I was alone\nThis bird had flown\nSo I lit a fire\nIsn't it good Norwegian wood?\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}