{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "Nowhere Man",
  "URL": "https://www.songfacts.com/facts/the-beatles/nowhere-man",
  "Confidence": 1.0,
  "youtube-id": "R4ZE4arxJwc",
  "facts": [
    "John Lennon came up with this after struggling to write a song for the album. Said Lennon: \"I thought of myself sitting there, doing nothing and getting nowhere.\"",
    "This was used in the animated Beatles movie Yellow Submarine. They sing it to Jeremy Hillary Boob, PhD, who describes himself as an \"eminent physicist, polyglot classicist, prize-winning botanist, hard-biting satirist, talented pianist, good dentist too.\" The Beatles decide to take him Somewhere, and he eventually helps them to defeat the Blue Meanies. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "This starts with a three-part harmony sung by Lennon, Harrison, and McCartney.",
    "This is probably the first Beatles song that has nothing to do with love.",
    "Typical of many John Lennon compositions are the \"falling\" melodies, which can be heard in \"Nowhere Man.\" Folk music often has falling melodies, indicating melancholy. In Baroque music, a falling melody means sadness. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, a music historian in Stockholm\n                                                  \n                                                  ",
    "There is a very audible feedback 38 seconds into the song after the word \"missin'.\"",
    "Natalie Merchant performed this at the 2001 special, Come Together: A Night For John Lennon's Words And Music. She did a mellow version, as the show was also a tribute to victims of the terrorist attacks on America.",
    "In a 1971 interview with Rolling Stone, Lennon recalled the background to this song: \"I remember I was just going through this paranoia trying to write something and nothing would come out so I just lay down and tried to not write and then this came out, the whole thing came out in one gulp.\"",
    "In 2003, John Lennon's original handwritten lyrics to this song were auctioned at Christie's of New York for $455,500. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "One of the many songwriters influenced by The Beatles is Graham Gouldman of 10cc, who toured with Ringo's All-Starr Band in 2018. According to Gouldman, this song is an example of how they would create a two-part harmony, but leave out third part, which is implied. \"That's screaming out for the third harmony, but they never did it,\" he told Songfacts. \"And in your head, you sing along, if you're musical, the third harmony.\""
  ],
  "lyrics": "He's a real nowhere man\nSitting in his nowhere land\nMaking all his nowhere plans for nobody\n\nDoesn't have a point of view\nKnows not where he's going to\nIsn't he a bit like you and me?\nNowhere man please listen\nYou don't know what you're missing\nNowhere man, the world is at your command\n\nHe's as blind as he can be\nJust sees what he wants to see\nNowhere man, can you see me at all\nNowhere man don't worry\nTake your time, don't hurry\nLeave it all 'til somebody else\nLends you a hand\nAh, la, la, la, la\n\nDoesn't have a point of view\nKnows not where he's going to\nIsn't he a bit like you and me?\nNowhere man please listen\nYou don't know what you're missing\nNowhere man, The world is at your command\nAh, la, la, la, la\n\nHe's a real nowhere man\nSitting in his nowhere land\nMaking all his nowhere plans for nobody\nMaking all his nowhere plans for nobody\nMaking all his nowhere plans for nobody\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}