{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "Ob-La-Di, Ob-La-Da",
  "URL": "https://www.songfacts.com/facts/the-beatles/ob-la-di-ob-la-da",
  "Confidence": 1.0,
  "youtube-id": "_Paqe2-BCYM",
  "facts": [
    "The title comes from a reggae band called Jimmy Scott and his Obla Di Obla Da Band. Says McCartney, \"A fella who used to hang around the clubs used to say in a Jamaican accent, \"Ob-la-di, ob-la-da, life goes on,\" and he got annoyed when I did a song of it, 'cause he wanted a cut. I said, 'Come on, Jimmy, it's just an expression.\" \nWhen Jimmy Scott needed money for bail (he was jailed for missing alimony payments), McCartney had his friend Alistair Taylor put up the money in exchange for Scott dropping rights to the name. Taylor had to get the money from a friend, since no one in the Beatles camp carried much cash. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Chiara - West Vancouver, Canada\n                                                  \n                                                  ",
    "Reggae caught fire in America in the early '70s with the rise of Bob Marley and the #1 Johnny Nash hit \"I Can See Clearly Now,\" but there was little trace of it on pop radio in the '60s. \"Ob-La-Di, Ob-La-Da\" was one of the first popular songs to incorporate a reggae beat.",
    "Paul McCartney wrote this and The Beatles spent a great deal of time recording and overdubbing it. John, George, and Ringo became very annoyed. Harrison hinted at his frustration on \"Savoy Truffle,\" which was recorded three months later. In the song he wrote:\nBut what is sweet now, turns so sour\nWe all know Ob-La-Di, Ob-La-Da\nBut can you show me, where you are?",
    "John Lennon hated this song. He didn't like a lot of McCartney's later songs with The Beatles, feeling they were trite and meaningless. Ringo and George disliked this too and all three of them vetoed Paul's wish that this be released as a single.",
    "This was a #1 hit in England for Marmalade in 1968. With their cover, Marmalade became the first Scottish group to top the UK charts (leaving little doubt about their origin, they performed the song on Top Of The Pops wearing kilts). It also could be considered the first UK #1 to be done in a reggae style.\nMarmalade's bassist Graham Knight recalls in 1000 UK #1 Hits by Jon Kutner and Spencer Leigh, \"The Beatles' music publisher, Dick James, played us the acetate of The Beatles' Ob-La-Di Ob-La-Da and we thought it was great. He said, 'You can have it, I won't give it to anyone else,' but of course he passed it to another 27 acts. We rush-recorded it in the middle of the night during a week of cabaret in the northeast. Our manager, who was in America at the time, kept sending us telegrams not to do it. He didn't think we should record a Beatles song. We expected it to do well, but we didn't think it would go to #1. We got no feedback from The Beatles at all. There had been so many covers by that time that I shouldn't think they'd have been very interested.\"",
    "According to the New York Times, the Desmond in the opening lyric is a reference to Jamaican music pioneer Desmond Dekker.",
    "The guitars were over-modulated on purpose to get the desired effect.",
    "This wasn't released as a single while The Beatles were extant, but in 1976 Capitol Records released \"Got To Get You Into My Life\" as a single in America, and it did very well, reaching #7. With proof that there was still demand for Beatles material, the label issued \"Ob-La-Di, Ob-La-Da\" later that year and it made #49.",
    "Paul mistakenly sang \"Desmond stays at home and does his pretty face.\" It was intended to be \"Molly,\" but Paul decided to leave it in to create confusion.",
    "John Lennon played the piano part on this song.",
    "As recounted by Beatles biographer Mark Lewisohn, after doing a huge number of takes (around 60), Paul continued trying to record this as a slow song. John was in the other room listening while doing drugs. After getting high, he was very frustrated to hear Paul record it slow so many times. He subsequently burst into the recording room, pushed Paul aside and got on the piano playing the song very fast and upbeat. The fast and happy recording on the infamous White Album is the result.",
    "This was used as the theme song to the TV series Life Goes On which ran from 1989-1993. The version used on the show was sung by Patti LuPone and the rest of the cast.",
    "The melody of this song was lifted by The Offspring for their 1999 hit \"Why Don't You Get a Job?\"",
    "In December 1968, a version by The Bedrocks hit #20 in the UK.",
    "The Beatles never performed this live, as they stopped touring in 1966, but Paul McCartney did play it live - eventually. He included it in his setlist for the first time on his 2010 \"Up And Coming\" tour.",
    "The author Paul Saltzman, who was studying Transcendental Meditation in Rishikesh, India with The Beatles in February 1968, published a photo book on his time with the band called The Beatles In India, where Saltzman recalled watching McCartney and Lennon collaborating on the song. Wrote Saltzman: \"I looked over and under Paul's toe, under his sandal was a little torn piece of paper. And I look over and in his handwriting it's 'Ob-La-Di Ob-La-Da, bra/La-La how the life goes on.' And I'm sitting beside Ringo (Starr) - maybe five feet away from Paul - and they start singing it and really working with it. Only those words -- only John and Paul. Ringo was just quietly listening.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n DeeTheWriter - Saint Petersburg, Russia Federation, for above 2\n                                                  \n                                                  "
  ],
  "lyrics": "Desmond has a barrow in the marketplace\nMolly is the singer in a band\nDesmond says to Molly, girl, I like your face\nAnd Molly says this as she takes him by the hand\n\nOb la di, ob-la-da, life goes on, bra\nLa-la, how the life goes on\nOb-la di, ob-la-da, life goes on, bra\nLa-la, how the life goes on\n\nDesmond takes a trolley to the jeweller's store\nBuys a twenty carat golden ring\nTakes it back to Molly waiting at the door\nAnd as he gives it to her she begins to sing\n\nOb la di, ob-la-da, life goes on, bra\nLa-la, how the life goes on\nOb-la di, ob-la-da, life goes on, bra\nLa-la, how the life goes on\n\nIn a couple of years they have built\nA home sweet home\nWith a couple of kids running in the yard\nOf Desmond and Molly Jones\n\nHappy ever after in the market place\nDesmond lets the children lend a hand\nMolly stays at home and does her pretty face\nAnd in the evening she still sings it with the band\n\nOb la di, ob-la-da, life goes on, bra\nLa-la, how the life goes on\nOb-la di, ob-la-da, life goes on, bra\nLa-la, how the life goes on\n\nIn a couple of years they have built\nA home sweet home\nWith a couple of kids running in the yard\nOf Desmond and Molly Jones\n\nHappy ever after in the market place\nMolly lets the children lend a hand\nDesmond stays at home and does his pretty face\nAnd in the evening she's a singer with the band\n\nOb la di, ob-la-da, life goes on, bra\nLa-la, how the life goes on\nOb-la di, ob-la-da, life goes on, bra\nLa-la, how the life goes on\n\nAnd if you want some fun, sing ob-la-di, bla-da\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}