{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Octopus's Garden",
  "URL": "https://www.songfacts.com/facts/the-beatles/octopuss-garden",
  "Confidence": 1.0,
  "youtube-id": "Dmx5sLusykY",
  "facts": [
    "Along with \"Don't Pass Me By,\" this was one of two songs Ringo Starr wrote for The Beatles. It came about when Ringo left The White Album sessions in 1968 and went on a boating trip with his family in Sardina. The boat's captain offered him an octopus lunch, but he turned it down. It was then that the captain began to tell him everything he knew about octopuses, and how they travel along the sea bed looking for shiny objects and stones with which to build gardens. Ringo thought about how tranquil it would be to live down there amongst your friends in the calm waters - the opposite of the chaos and internecine conflict he was going through with The Beatles. With this idea, he wrote the song about living in the octopus's garden.\nRingo did return to his post for The White Album, discovering his drum kit covered with flowers to welcome him back (George Harrison's idea). The Beatles completed that album and later included \"Octopus's Garden\" on Abbey Road.",
    "This is one of the most kid-friendly Beatles songs. Ringo sang lead, as he did on some of the lighter Beatles songs, including \"Yellow Submarine\" and \"Act Naturally.\" His voice is very appealing to children, as demonstrated in his later voiceover work on Thomas the Tank Engine.",
    "George Harrison helped Ringo write this during the Let It Be sessions. They are seen working on it in the movie Let It Be - George rewrote the chord sequence.",
    "Ringo made the underwater sounds by blowing bubbles through a glass of water."
  ],
  "lyrics": "I'd like to be under the sea\nIn an octopus' garden in the shade\nHe'd let us in, knows where we've been\nIn his octopus' garden in the shade\n\nI'd ask my friends to come and see\nAn octopus' garden with me\nI'd like to be under the sea\nIn an octopus' garden in the shade\n\nWe would be warm below the storm\nIn our little hideaway beneath the waves\nResting our head on the sea bed\nIn an octopus' garden near a cave\n\nWe would sing and dance around\nBecause we know we can't be found\nI'd like to be under the sea\nIn an octopus' garden in the shade\n\nWe would shout and swim about\nThe coral that lies beneath the waves\n(Lies beneath the ocean waves)\nOh what joy for every girl and boy\nKnowing they're happy and they're safe\n(Happy and they're safe)\n\nWe would be so happy you and me\nNo one there to tell us what to do\nI'd like to be under the sea\nIn an octopus' garden with you\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  ",
  "place": {
    "name": "Sardinia, Italy",
    "facts": [
      "Sardinia is the lesser-known island off the coast of Italy, Sicily being the greater known. However, it was off the coast of the lesser and not the greater where Ringo Starr was inspired to begin penning the lyrics to his second and most popular contribution to any Beatles album: \"Octopus’s Garden\" (his first, \"Don’t Pass Me By,\" appeared on the Double LP commonly known as",
      ").",
      "The Beatles had a reputation for insinuating double meanings in their lyrics; Starr was no different. These meanings run the gamut from extremely tame to extremely wild. It has been speculated that \"Octopus’s Garden\" is an abstract reference to a vagina:",
      "Additionally, the line",
      "have led people to believe the song is a children’s tune.",
      "The story goes…",
      "Ringo, having been invited on a cruise by his friend Peter Sellers, sat down to eat while floating off the coast of the island, and rather than getting the fish and chips he’d ordered, the yacht’s chef prepared and served squid, instead. Peter, ever the comedian, launched into a tongue-in-cheek lecture about how octopi hover along the ocean floor, picking up rocks, coral, and other shiny objects to collect inside their \"gardens.\"",
      "With George Harrison’s help, Ringo completed composition of the song back at Abbey Road Studios and the final recorded version ended up on the Beatles last LP,",
      ". Prior to writing both \"Octopus’s Garden\" and \"Don’t Pass Me By,\" Ringo had contributed lead vocals to at least one cut on seven of the Beatles preceding eleven albums (not",
      "or",
      "). He sings:",
      "\"Yellow Submarine\" –",
      "\"With a Little Help from my Friends\" –",
      "\"I Wanna Be Your Man\" –",
      "\"Boys\" –",
      "\"Matchbox\" – 45 rpm single (no album)",
      "\"Honey Don’t\" –",
      "\"Act Naturally\" –",
      "\"What Goes On\" –",
      "\"Good Night\" –",
      "The reason why Ringo sang so few songs for the Fab Four is his unique voice. His vocal personality is one of the most identifiable in popular music history. In fact, his voice was so specific that Lennon and McCartney wrote songs with him in mind for lead vocals. The melody lines were tailored for Starr’s limited baritone range.",
      "While Harrison had developed the reputation within the band, and the public, as the quiet one – McCartney was the cute one and Lennon was the funny one – Starr’s personality came out in odd and interesting ways. He had a crazy idiosyncrasy of saying common idioms wrong or backwards. These minuscule mistakes became known as Ringoisms and often inspired his other bandmates’ song writing.",
      "McCartney commented, “Ringo would do these little malapropisms. He would say things slightly wrong, like people do, but his were always wonderful; very lyrical… they were sort of magic.” When Starr was at his best, he could contribute additional lyrics to the other Beatles’ compositions, as well. For instance, the line in \"Eleanor Rigby,\"",
      "” is attributed to him.",
      "In addition to his moonlighting as a singer and songwriter, Starr, as most people are aware, played drums for the biggest band in history, having scored the gig after replacing Pete Best (the first Beatles’ drummer). Originally, fans booed the change and demanded Best return. However, after just a couple years, Starr had endeared himself to fans so much that they wrote thousands of pieces of fan mail to him, demanding that he sing some songs for himself.",
      "Was it the enthusiasm of the fans that first prompted Lennon and McCartney to give Ringo a chance behind the microphone? We’ll never know. But one thing’s for certain: Starr’s handful of songs have become classics in their own right over the past 50 years. Covers for many of his songs have popped up, including Jim Henson’s Muppets who, on",
      ", performed their own version of \"Octopus’s Garden.\" Whatever Starr’s true (or double) meaning for the song, one thing can be assured: it’s a jovial frolic of a tune to be enjoyed by young and old throughout the ages.",
      "So, after all that, what",
      "Ringo Starr think about his squid? “It was okay. A bit rubbery and tasted like chicken.”",
      "~"
    ]
  }
}