{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Oh! Darling",
  "URL": "https://www.songfacts.com/facts/the-beatles/oh-darling",
  "Confidence": 1.0,
  "youtube-id": "erMgpfiOMSU",
  "facts": [
    "Paul McCartney wrote this song. He came to the studio early every day for a week to sing it because his voice was too clear - he wanted it to sound strained, like he had been performing it all week.\nMcCartney had deployed the retro shredded-voice form several times before, including on \"I'm Down,\" \"Long Tall Sally,\" and \"Helter Skelter.\" Perhaps a bit of artistic rivalry was afoot here - hard rock vocals in The Beatles had been the domain of John Lennon, and Paul seemed almost to be pushing himself to compete.",
    "Lennon resented that Paul didn't let him sing lead vocals. He felt it was more his style, but since McCartney wrote it, it was his decision. In a 1980 Playboy interview, Lennon even shot down McCartney's vocal efforts, specifically stating that he could have done it better.",
    "The Beatles performed this in their movie Let It Be. While rehearsing the song for the film, John announced that Yoko's divorce with her former husband had finally gone through and he improvised a verse about that. This can be heard on The Beatles Anthology 3. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "One of the reasons McCartney could arrive at the studio so early was because he only lived two blocks away from Abbey Road. Incidentally, this also factors into why he was barefoot on the album cover for Abbey Road. He'd just worn sandals and happened to slip them off. Next thing you know, hundreds of \"Paul is dead\" rumors.",
    "\"Oh! Darling\" draws its influence equally from New-Orleans-style R&B popularized by Fats Domino, and the \"swamp\" style of blues popular in Louisiana at the time. The rest of the group added the doo-wop harmony after the fact.",
    "The Beatles were on the outs when this song was recorded. Alan Parsons, who was an engineer at the sessions, said in a Songfacts interview: \"George would come in and work on something on his own, and then Paul would come and do \"Oh! Darling.\" He would come in every day at 2 p.m. and sing 'Oh! Darling' a couple of times, and say, 'No, that's not it,' and then come in the next day and do it again. You wouldn't see more than one Beatle at a time that day.\"",
    "On the 2019 50th anniversary edition of the Abbey Road album, Capitol Records included an outtake of this song produced by Giles Martin, and also a new remix."
  ],
  "lyrics": "Oh! Darling, please believe me\nI'll never do you no harm\nBelieve me when I tell you\nI'll never do you no harm\n\nOh! Darling, if you leave me\nI'll never make it alone\nBelieve me when I beg you\nDon't ever leave me alone\n\nWhen you told me you didn't need me anymore\nWell you know I nearly broke down and cried\nWhen you told me you didn't need me anymore\nWell you know I nearly broke down and died\n\nOh! Darling, if you leave me\nI'll never make it alone\nBelieve me when I tell you\nI'll never do you no harm, believe me darlin'\n\nWhen you told me you didn't need me anymore\nWell you know I nearly broke down and cried\nWhen you told me you didn't need me anymore\nWell you know I nearly fell down and died\n\nOh! Darling, please believe me\nI'll never let you down (Oh believe me darlin')\nBelieve me when I tell you\nI'll never do you no harm\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Tratore\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}