{
  "Artist": "The Beatles",
  "Album": "Let It Be",
  "Title": "One After 909",
  "URL": "https://www.songfacts.com/facts/the-beatles/one-after-909",
  "Confidence": 1.0,
  "youtube-id": "aLekgnaCrdY",
  "facts": [
    "According to disc 2 of the 2003 release Let It Be... Naked, \"One After 909\" is about a lady who tells her boyfriend she is leaving on the train that leaves after train number 909. He begs her not to go, but she does anyway. He packs his bags and rushes after her and discovers that she is not on \"the one after 909,\" so he goes home depressed and goes into the wrong house. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Loretta - Liverpool, England\n                                                  \n                                                  ",
    "John Lennon wrote this jaunty number in 1959 - it was one of his first songs. He penned the tune during a visit to his grandparents' three-bedroom terrace house at 9 Newcastle Road, Wavertree, Liverpool, where he spent the first five years of his life living with his parents and grandparents.",
    "Part of The Beatles' early live repertoire, this wasn't released until their last album. The album was going to be titled \"Get Back\" and was supposed to be The Beatles getting back to their roots and playing live. It didn't work out that way, and by the time the album was released, The Beatles had broken up and \"Let It Be\" was chosen as the title. \"One After 909\" was included on the album because the group performed it twice in the movie Let It Be, including the impromptu concert on Apple Records' rooftop.",
    "The Beatles recorded this in 1963, but did not get a take they liked. The version on Anthology 1 was pieced together from the 1963 takes."
  ],
  "lyrics": "My baby said she's trav'ling on the one after 909\nI said move over honey I'm traveling on that line\nI said move over once, move over twice\nCome on baby don't be cold as ice.\nSaid she's trav'ling on the one after 909.\n\nI begged her not to go and I begged her on my bended knees,\nYou're only fooling around, you're fooling around with me.\nI said move over once, move over twice\nCome on baby don't be cold as ice.\nSaid she's trav'ling on the one after 909.\n\nI got my bag, run to the station\nRailman says you've got the the wrong location\nI got my bag, run right home\nThen I find I've got the number wrong\n\nWell she said she's trav'ling on the one after 909\nI said move over honey I'm traveling on that line\nI said move over once, move over twice\nCome on baby don't be cold as ice.\nSaid she's trav'ling on the one after 909.\n\nI got my bag, run to the station\nRailman says you've got the the wrong location\nI got my bag, run right home\nThen I find I've got the number wrong\n\nWell she said she's trav'ling on the one after 909\nI said move over honey I'm traveling on that line\nI said move over once, move over twice\nCome on baby don't be cold as ice.\nSaid she's trav'ling on the one after 9-0,\nSaid she's trav'ling on the one after 9-0,\nSaid she's trav'ling on the one after 909.\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}