{
  "Artist": "The Beatles",
  "Album": "Magical Mystery Tour",
  "Title": "Penny Lane",
  "URL": "https://www.songfacts.com/facts/the-beatles/penny-lane",
  "Confidence": 1.0,
  "youtube-id": "S-rB0pHI9fU",
  "facts": [
    "Paul McCartney was sitting at a bus shelter waiting for John Lennon to meet him on Penny Lane, a street near their houses in Liverpool, England. While sitting there Paul jotted down the things he saw, including a barber's shop with pictures of its clients and a nurse selling poppies for Remembrance Day (November 11th, marking the day World War I officially ended). He later turned these images into the song we now know, which celebrates this time in his life.\nPenny Lane evolved to accommodate the many tourists who visit, offering Beatles-themed dining and memorabilia. The barber's shop mentioned in the song is still there, but most of the other places that show up in the lyric are long gone. The shelter in the middle of the roundabout where the nurse sells the poppies later become a restaurant named Sgt. Pepper's Bistro, which has since closed. The street sign at the corner of Mossley Hill is the most popular photo op.",
    "The \"Penny Lane\" referenced in the song is really to the Penny Lane Bus Station (now gone) next to \"the shelter in the middle of the roundabout.\" When the boys were young they used to meet at this bus station as it was a hub to get them anywhere they wanted to go and was centrally located to all of them. Most of the places mentioned in the song are actually on Smithdown Place, which overlooks the roundabout.",
    "The piquant trumpet part was added after the rest of the song was finished. McCartney was watching the BBC when he saw a group called The New Philharmonia perform Bach's \"Brandenburg Concerto #2.\" He got the idea to add trumpet, and asked the group's trumpet player, Dave Mason, to play on this track. Mason brought nine trumpets to the session, eventually deciding to use a B-flat piccolo trumpet. Mason, who is not the same Dave Mason from the group Traffic, played on a few other Beatles songs, including \"A Day In The Life,\" \"Magical Mystery Tour,\" and \"All You Need Is Love.\"\nMcCartney credits Beatles producer George Martin for translating the trumpet line to Mason, as Martin spoke musician. McCartney sang the part he wanted, and Martin transcribed it to a piece of paper that he gave to Mason. It's one of many examples of how Martin helped the group execute their boundary-breaking ideas.",
    "Dave Mason played some trumpet for the end of the song, but it was cut out from the final release. It did make it onto the promotional single sent to radio stations, and was also used in the mix released on the Anthology album. Mason died on April 29, 2011 at age 85.",
    "There is no guitar on \"Penny Lane\"; John Lennon played piano and George Harrison played the conga drum.",
    "There are some obscene references in this song that were intentional: \"Finger Pie\" and \"keeps his fire engine clean\" were sexual slang.",
    "The first time The Beatles appeared with facial hair was in the promotional film for this song. The clip shows the band on horseback, trotting around Angel Lane in London (not Penny Lane). By this time, the group had stopped touring, so the only way many fans could see them perform was on music videos like this one. A restored version of the video appears on the 1+ compilation, released in 2015.",
    "Street signs on Penny Lane in Liverpool began disappearing after this song was released. The town painted \"Penny Lane\" on buildings to avoid theft.",
    "\"Penny Lane\" was a #1 hit in America, but it didn't reach the top spot in the UK, where it spent three weeks at #2 in March 1967 behind Engelbert Humperdinck's \"Release Me.\" Their previous seven UK singles all hit #1; you have to go back to 1964 with \"Ain't She Sweet\" to find one that didn't.",
    "This and \"Strawberry Fields Forever\" were intended for Sgt. Pepper's Lonely Hearts Club Band, but Capitol Records decided to release the two songs as a single, partly to regain popularity from John Lennon's \"The Beatles are bigger than Jesus\" comment. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Julian - Anaheim, CA\n                                                  \n                                                  ",
    "It's worth noting that the Penny Lane neighborhood was bombed into oblivion during World War II. It recovered much faster than most of England thanks to its proximity to Burtonwood, an American air base about 15 miles away. American soldiers came to Burtonwood flush with cash and rock and roll records, giving Liverpool a huge economic boost and a thirst for rock music. (Ringo's stepfather worked on the base; Brian Epstein's record store was stocked with American acts to meet demand).\nIn the late '50s, while most of Britain was still listening to crooners and vaudeville acts, Liverpool bands were learning rock and roll so they could play to American troops; the first song John, Paul and George recorded together (as the Quarrymen) was a cover of Buddy Holly's \"That'll Be The Day\" in 1958.",
    "In the movie Almost Famous, Penny Lane is the name of one of the groupies. Kate Hudson was nominated for an Oscar for the role.",
    "Lennon's mother Julia at one time worked as a cinema usher and a waitress in Penny Lane. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The piccolo trumpet that Dave Mason played on this track was sold at auction in 1987 for the equivalent of nearly $11,000. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The lyric, \"pretty nurse selling poppies from a tray\" is believed to refer to Beth Davidson, who married Lennon's boyhood friend, Pete Shotton.\nThe reference to the barber, with \"photographs of every head he's had the pleasure to have known,\" was later identified as James Bioletti, who used to cut the hair of Lennon, McCartney and Harrison when they were children.\nThe \"banker in a motor car\" on the other hand was invented by McCartney for the simple reason that it rhymed.",
    "Providing some perspective on this song and the songwriting talents of Paul McCartney, Seth Swirsky, who produced the Beatles documentary Beatles Stories and spent years as a staff songwriter for Chappell Music, told Songfacts: \"He could do so many things, and he could do things that are hard to quantify. Some people might say, 'Well, I like Hall and Oates as songwriters,' let's just say. But they do that 8th note thing where they're just banging on the piano, like 'Kiss On My List,' so you could kind of copy their sound a little bit, or copy their style of writing. Very hard to copy McCartney, because you just don't come out with 'Penny Lane,' where it just changes keys. It's out of a different kind of brain.\"",
    "It's been suggested that Liverpool's Penny Lane was named after James Penny, an 18th century slave ship owner. During the protests following the killing of George Floyd, four signs on Penny Lane were spray-painted, with the word \"racist\" painted on the wall above one sign. Joe Anderson, the Mayor of Liverpool, said there was no evidence to suggest that the street is named after James Penny, explaining its moniker instead refers to a penny toll bridge that used to exist on the road."
  ],
  "lyrics": "In Penny Lane, there is a barber showing photographs\nOf every head he's had the pleasure to know\nAnd all the people that come and go\nStop and say, \"Hello\"\n\nOn the corner is a banker with a motorcar\nAnd little children laugh at him behind his back\nAnd the banker never wears a mac\nIn the pouring rain, very strange\n\nPenny Lane is in my ears and in my eyes\nThere beneath the blue suburban skies\nI sit, and meanwhile back\nIn Penny Lane there is a fireman with an hourglass\nAnd in his pocket is a portrait of the Queen\nHe likes to keep his fire engine clean\nIt's a clean machine\n\nPenny Lane is in my ears and in my eyes\nA four of fish and finger pies\nIn summer, meanwhile back\nBehind the shelter in the middle of the roundabout\nThe pretty nurse is selling poppies from a tray\nAnd though she feels as if she's in a play\nShe is anyway\n\nIn Penny Lane, the barber shaves another customer\nWe see the banker sitting waiting for a trim\nAnd then the fireman rushes in\nFrom the pouring rain, very strange\n\nPenny Lane is in my ears and in my eyes\nThere beneath the blue suburban skies\nI sit, and meanwhile back\nPenny Lane is in my ears and in my eyes\nThere beneath the blue suburban skies\nPenny Lane!\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "place": {
    "name": "Penny Lane, Liverpool, England",
    "facts": [
      "George Martin, Beatles producer, is quoted as saying that \"Penny Lane,\" together with \"Strawberry Fields Forever,\" produced the best single ever pressed. The two songs do enjoy a special kind of kinship; both of them express nostalgia for places and times past. Both of them do so in a sweet, cheerful way. And both of them together make a centerpiece for what made the Lennon-McCartney songwriting team so special. While Lennon-McCartney are credited together with the authoring of \"Penny Lane,\" it is mainly Paul McCartney's work, just as John Lennon takes the more credit for \"Strawberry Fields.\" Together, they made something so much more than the sum of their parts.",
      "Penny Lane is a real place. In fact, it is so real that it touched off a rash of fans stealing street signs, until Liverpool, England, city officials gave up replacing the signs and just painted the name of the streets on the side of buildings. Stealing the building's brick wall would prove to be too much effort, even for Beatles fans. In 2007, new theft-proof signs were specially created, and Penny Lane can once again display its name like any other street.",
      "It is a street that is postcard-perfect in being a typical Liverpool setting. It's a narrow two-laner, lined with row houses and two-story shops and lofts, and for stretches it's hugged on one side by lush trees and greenery. While you can poke around playing scavenger-hunt trying to find the barber shop, banker, fire station, and poppy stand, it is doubtless that these artifacts have been washed away by the tides of time, and any close approximations that stand today will probably be in homage to the song.",
      "Curiously, no mention is made of the train tracks the street crosses with a little bridge. With all of the other sound effects included between verses, the sound of a train would have been an interesting addition. Perhaps they felt the song was packed enough already.",
      "Not all of the artifacts mentioned in \"Penny Lane\" are gone without a trace, however. There is a fish and chips shop near the midpoint, which could be the place referenced by the phrase \"four of fish\" - this means fourpennyworth of fish and chips. Also, because the song meanders through different times in the same location (references to blue skies and rain, to selling poppies for Remembrance Day and summer activities), the events of the song are more likely a pastiche of memories from the area.",
      "One prominent landmark from the song is still intact: the \"shelter in the middle of the roundabout.\" Look on the far east end of the street, where it merges with Church Road, and find a building on an island by itself with a fence around it. It's a rectangular white building with dark brown bay window part facing Church Road, and wall sections in between each window, which are gray with two white diamonds per section. Over the windows is written \"Sgt. Pepper's Bistro,\" a business which bought out the bus shelter and converted it into a restaurant for Beatles fans. It is quite abandoned today.",
      "And there it is! Bask in the magic for a moment. Don't worry, this area is used to tourists."
    ]
  },
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-115.jpg",
    "facts": "The building in the center is the \"Shelter in the middle of the roundabout.\" On the right side of the building in the foreground of the picture is where Beth (the pretty nurse) would sell her poppies from a tray. She wanted to be actress and thus the \"Feels like she's in a play\" reference.On the left side the black and red cars are parked in front of what used to be the bank the song references: On the corner is a banker with a motorcar, And little children laugh at him behind his back. And the banker never wears a mac In the pouring rain, very strange. For anyone to have a car back in the days this was written was rare and the banker being one of the rich men in town had one. He parked it right out side the bank's front door, thus when it rained he could walk right in and never have to wear a mack or a raincoat in the pouring rain.Further up to the left in the picture around the white truck is located the barber shop. While the barbershop has changed hands over the years there is still a barber shop there and they have Beatle pictures in the window. (thanks to David Bedford of Beatle Tours, Liverpool)"
  }
}