{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "Piggies",
  "URL": "https://www.songfacts.com/facts/the-beatles/piggies",
  "Confidence": 1.0,
  "youtube-id": "O3bCtx7SNAE",
  "facts": [
    "George Harrison wrote this song as a takedown of the upper crust, who he felt could be greedy and slovenly. The Beatles were already rich and famous, but came from very humble beginnings - Harrison grew up in a working-class family in Liverpool.",
    "Harrison intended this as social commentary, but many people interpreted it as an anti-police anthem. Charles Manson, in his very disturbed mind, thought the term \"damn good whacking\" meant against the American police. During the murders of Sharon Tate, the LaBianca's and others, knives and forks were used to stab them because these utensils were mentioned in the song. The words \"pig and piggy,\" were written with the victims' blood on the walls. Harrison was horrified when he learned his song took on another meaning. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dominic - Pittsburgh, PA\n                                                  \n                                                  ",
    "John Lennon did not play on this, but he improved this slightly with the line, \"Clutching forks and knives they eat their bacon\" - adding a touch of cannibalism to the proceedings. This replaced the line, \"Clutching forks and knives to cut their pork chops\" which can be heard on Anthology 3. The pig noises were his idea. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Mountlake Terrace, WA. U.S.A\n                                                  \n                                                  ",
    "This keeps the animal theme between \"Blackbird\" and \"Rocky Raccoon\" on The White Album.",
    "There was an extra verse that wasn't included on the song. It goes:\nEverywhere there's lots of piggies playing piggie pranks\nYou can see them on their trotters\nAt the piggy banks\nPaying piggy thanks\nTo thee pig brother \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n James - Ashland, OR\n                                                  \n                                                  ",
    "Harrison's mother Louise contributed the line: \"What they need is a damn good whacking.\""
  ],
  "lyrics": "Have you seen the little piggies\nCrawling in the dirt?\nAnd for all the little piggies\nLife is getting worse,\nAlways having dirt to play around in\n\nHave you seen the bigger piggies\nIn their starched white shirts?\nYou will find the bigger piggies\nStirring up the dirt,\nAlways have clean shirts to play around in\n\nIn their styes with all their backing\nThey don't care what goes on around\nIn their eyes there's something lacking\nWhat they need's a damn good whacking\n\nEverywhere there's lots of piggies\nLiving piggy lives\nYou can see them out for dinner\nWith their piggy wives\nClutching forks and knives to eat the bacon\n\nOne more time\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: CONCORD MUSIC PUBLISHING LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}