{
  "Artist": "The Beatles",
  "Album": "Please Please Me",
  "Title": "Please Please Me",
  "URL": "https://www.songfacts.com/facts/the-beatles/please-please-me",
  "Confidence": 1.0,
  "youtube-id": "q3NTVkHwD5I",
  "facts": [
    "On this song, John Lennon asks a girl to please please him, just like he does for her. Many assumed he was referring to oral sex, but of course The Beatles denied this, since they had a very clean image to maintain at the time. Lennon said of the song: \"I was always intrigued by the double use of the word 'please.'\"",
    "John Lennon, a big Roy Orbison fan, wrote this in the style of Orbison's overly dramatic singing, and on September 11, 1962, they recorded the song that way. Beatles producer George Martin suggested it would sound better sped up, with more pop appeal, so on November 26, they went back in the studio and cut the version that was released.\nIn 2006, Martin told The Observer Music Monthly, \"The songs the Beatles first gave me were crap. This was 1962 and they played a dreadful version of 'Please Please Me' as a Roy Orbison-style ballad. But I signed them because they made me feel good to be with them, and if they could convey that on a stage then everyone in the audience would feel good, too. So I took 'Love Me Do' and added some harmonica, but it wasn't financially rewarding even though Brian Epstein bought about 2,000 copies. Then we worked for ages on their new version of 'Please Please Me,' and I said: 'Gentlemen, you're going to have your first #1.'\"\nAlthough in the UK, \"Please Please Me\" was officially a #2 record, three of the four charts used at the time - Melody Maker, NME and Disc - listed it #1. Only the Record Retailer chart had it at #2. Their next single, \"From Me to You,\" became their first official #1.",
    "This was the second Beatles single released in the UK (following \"Love Me Do\") and the first Bealtes single released in America; getting it issued there was a struggle. In the UK, it was released on the EMI-owned Parlophone label on January 11, 1963. After EMI's US affiliate, Capitol Records, rejected the song (and a lot of other early Beatles material), the small, Chicago-based Vee Jay label stepped in and released \"Please Please Me\" stateside on February 25, 1963. The Chicago radio station WLS made history by becoming the first American radio station to play a Beatles song when they put it on the air, but it had little impact - the song reached #35 on their \"Silver Dollar Survey\" the week of March 15, but then dropped out.\nOver the next few months, the group caught on in the UK, and by 1964 were ready to conquer America. On January 30, 1964, \"Please Please Me\" was again released in America as \"I Want To Hold Your Hand\" was on its way to becoming the group's first American chart-topper. \"Please Please Me\" made it to #3 on March 14, 1964.",
    "The group's name was misspelled \"Beattles\" on the record label on the first American release of the single.",
    "Typical for the verse in \"Please Please Me,\" and for many of Lennon's songs are the long notes (legato) that are also used in hymns - even sounding a bit like Mendelssohn's Wedding March in A Midsummer Night's Dream. When Lennon was a little boy he used to go to church on Sunday. Afterwards he improvised his own counterpoints to the hymns.",
    "The climbing in the melody \"Come on, come on...\" is similar to parts of two traditional folk songs: \"New's Evens Song\" and \"Come Fair One.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Johan Cavalli, a music historian in Stockholm, for above 2\n                                                  \n                                                  ",
    "In the UK, this was re-released in 1983 to coincide with the 20th anniversary of it's initial release.",
    "The Beatles performed this on their second Ed Sullivan Show appearance in 1964. Sullivan was not a fan of many rock groups, but loved The Beatles and had them on his show whenever he could.",
    "An early version of this song with session drummer Andy White playing drums instead of Ringo can be found on Anthology 1.",
    "The Please Please Me album was The Beatles debut long player. When they recorded it at Abbey Studios in London, John Lennon was struggling with a streaming cold and all were tired after a tour supporting Helen Shapiro. However with the help and encouragement of producer George Martin within nine hours and 45 minutes they had recorded their groundbreaking LP.\nThe album was released to cash in on the success of this single in the UK. It took them about 12 hours to record, and was basically a re-creation of their live show, which was mostly cover songs. The album was released with the text \"Please Please Me with Love Me Do and 12 other songs.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France, for above 2\n                                                  \n                                                  ",
    "The Beatles performed this on Thank Your Lucky Stars on January 19, 1963. It was their first ever UK television appearance.",
    "The British Prime Minister Gordon Brown revealed in an interview on the British TV program GMTV that this was the first record that he ever bought.",
    "George Martin told Music Week magazine that the first time the Beatles played this to him, he wasn't very impressed. He recalled: \"I listened to it and I said: 'Do you know that's too bloody boring for words? It's a dirge. At twice the speed it might sound reasonable.' They took me at my word. I was joking and they came back and played it to me sped up and put a harmonica on it, and it became their first big hit.\"",
    "John Lennon was partly inspired by a line from a Bing Crosby song that read, \"Please lend a little ear to my pleas.\" He recalled: \"I remember the day I wrote it, I heard Roy Orbison doing \"Only The Lonely\" or something. And I was also always intrigued by the words to a Bing Crosby song that went, 'Please lend a little ear to my pleas.' The double use of the word 'please.' So it was a combination of Roy Orbison and Bing Crosby.\"\nLennon was a big fan of Bing Crosby. In 1978, when Yoko gave him a vintage '50s Wurlitzer jukebox for his birthday, he loaded the machine with as many 78-rpm records by Crosby as he could find.",
    "This is Keith Richards' favorite Beatles song. He told Jimmy Fallon: \"I've always told McCartney, 'Please Please Me.' I just love the chimes, and I was there at the time and it was beautiful. Mind you, there's plenty of others, but if I've got to pick one, 'Please Please Me'… oh, yeah!\"",
    "Lennon-McCartney was the standard alphabetical credit for their Beatles songwriters compositions except on Please Please Me, where for reasons unknown, the names were reversed."
  ],
  "lyrics": "Last night I said these words to my girl\nI know you never even try, girl\nCome on (come on), come on (come on)\nCome on (come on), come on (come on) \nPlease, please me, whoa yeah, like I please you\n\nYou don't need me to show the way, love\nWhy do I always have to say, love\nCome on (come on), come on (come on)\nCome on (come on), come on (come on) \nPlease, please me, whoa yeah, like I please you\n\nI don't want to sound complaining\nBut you know there's always rain in my heart (in my heart)\nI do all the pleasing with you\nIt's so hard to reason with you\nwhoa yeah, why do you make me blue?\n\nLast night I said these words to my girl\nI know you never even try, girl\nCome on (come on), come on (come on)\nCome on (come on), come on (come on)\nPlease, please me, whoa yeah, like I please you\n(Please me) whoa yeah, like I please you\n(Please me) whoa yeah, like I please you\n                                                  \n                                                  Writer/s: John Winston Lennon, Paul James McCartney \n\n                                                   Publisher: Downtown Music Publishing, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}