{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Polythene Pam",
  "URL": "https://www.songfacts.com/facts/the-beatles/polythene-pam",
  "Confidence": 1.0,
  "youtube-id": "Cb0dTdTeHMU",
  "facts": [
    "Polythene is a British term for polyethylene, a plastic polymer used in containers, insulation, and packaging. Written by John Lennon, this song has a rather strange background, and fortunately our Beatles expert Pattie Noah has sorted it out.\nWrites Pattie: \"On 'Polythene Pam,' John based her on two people. One was Patricia Hodgett, who was a Cavern Dweller (someone who hung out at the Cavern Club, where The Beatles used to play). Pat used to actually eat polythene! They started calling her 'Polythene Pat.' Not a far stretch to Pam. The other woman was named Stephanie, and she was the girlfriend of John's good friend, the poet Royston Ellis. John was with Ellis and Stephanie in the Channel Islands and they all had a three-way sexual experience with her wearing an outfit made from polythene. I think they were even doing it on a bed covered in sheets of polythene. Ellis said, 'We'd read all these things about leather and we didn't have any leather but I had my oilskins and we had some polythene bags from somewhere. We all dressed up in them and wore them to bed.' Ellis says nothing 'perverted' really happened... but John did ;).\"",
    "Lennon sang this in a thick Liverpool accent. Like the other Beatles, his regular singing voice sounded very American because he grew up listening to US artists.",
    "In the line, \"She's the kind of a girl that makes the News Of The World,\" The News Of The World is a tabloid newspaper that specializes in risqué news reporting. Pam must have been a wild girl. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Tim - Phoenix, AZ\n                                                  \n                                                  ",
    "The Beatles recorded this as one song with \"She Came In Through the Bathroom Window.\"",
    "Originally intended for The White Album, this was used in a suite of songs at the end of Abbey Road."
  ],
  "lyrics": "Well, you should see Polythene Pam\nShe's so good-looking but she looks like a man\nWell, you should see her in drag dressed in her polythene bag\nYes, you should see Polythene Pam\nYeah, yeah, yeah\n\nGet a dose of her in jackboots and kilt\nShe's killer-diller when she's dressed to the hilt\nShe's the kind of a girl that makes the \"News of the World\"\nYes, you could say she was attractively built\nYeah, yeah, yeah\n                                                  \n                                                  Writer/s: JOHN LENNON, PAUL MCCARTNEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}