{
  "Artist": "The Beatles",
  "Album": "CD2 - The Beatles",
  "Title": "Revolution 9",
  "URL": "https://www.songfacts.com/facts/the-beatles/revolution-9",
  "Confidence": 1.0,
  "youtube-id": "BGLGzRXY5Bw",
  "facts": [
    "John Lennon wrote this with contributions from Yoko Ono. It's a highly experimental piece, which Lennon once called \"The music of the future.\" It is the most controversial and bizarre track on the album - you have to have a very open mind to appreciate it.",
    "This was made by layering tape loops over the basic rhythm of \"Revolution.\" Lennon was trying to create an atmosphere of a revolution in progress. The tape loops came from EMI archives, and the \"Number 9\" voice heard over and over is an engineer testing equipment.",
    "Lennon told Rolling Stone that this was, \"an unconscious picture of what I actually think will happen when it happens; that was just like a drawing of revolution.\" He added: \"All the thing was made with loops, I had about thirty loops going, fed them onto one basic track. I was getting classical tapes, going upstairs and chopping them up, making it backwards and things like that, to get the sound effects. One thing was an engineer's testing tape and it would come on with a voice saying 'This is EMI Test Series #9.' I just cut up whatever he said and I'd number nine it. Nine turned out to be my birthday and my lucky number and everything. I didn't realize it; it was just so funny the voice saying 'Number nine'; it was like a joke, bringing number nine into it all the time, that's all it was.\"",
    "Paul McCartney and Beatles producer George Martin hated this and tried to keep it off the album.",
    "This is the longest Beatles song - it runs 8:15. It also took longer to complete than any other track on album.",
    "This helped fuel the \"Paul is dead\" rumors. If played backwards, you were supposed to hear the car crash where Paul died, and a voice saying \"Turn me on, dead man.\" Also, playing the line, \"I'm not in the mood for wearing clothing\" in reverse eventually becomes a rather odd but clear reversal, \"There were two, there are none now.\"\nThis is referencing the rumor that Paul McCartney died in a car with \"Lovely Rita\" and that the two were burned away after the wreck.\nThe rumor took off in October 1969 when a listener called the radio station WKNR in Detroit and told the DJ Russ Gibb about the backward message. When Gibb played it backwards on his show, listeners went wild and spent the next week calling in and offering their own rumors. The story quickly spread, and McCartney helped it along by laying low and letting it play out.",
    "Lennon felt the number 9 was quite significant. He was happy that, after he changed his name to John Ono Lennon, his and Yoko's names collectively contained 9 O's. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Nicole - Lake Forest, CA\n                                                  \n                                                  ",
    "According to the book The Beatles, Lennon And Me, by John Lennon's childhood friend Pete Shotton, One evening, Lennon was with Shotton in the attic of his Kenwood home, tripping on LSD and smoking a few joints. They messed about with John's Brunnel recorders, fiddling with feedback, running recordings backwards and creating tape loops. Opening the windows for some fresh air, John and Pete began to shout whatever was on their minds at the trees outside, the recorder running. This night's lark was to later captured on \"Revolution 9.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Margaret - Cullman, AL\n                                                  \n                                                  ",
    "Marilyn Manson released their own version of this on the B-side of the single for \"Get Your Gunn.\" It was called \"Revelation 9\" and ran 12:57. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Brett - Edmonton, Canada\n                                                  \n                                                  ",
    "This was parodied on an episode of The Simpsons. When the guys for a group called The B-Sharps, Barney meets a girl during recording. He exclaims at the studio that he's making the music of all time. The song is Barney's girl friend (with striking resemblance to Yoko Ono) saying \"Number 8\" and Barney burping. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n yo - sudbury, Ontario, Canada\n                                                  \n                                                  ",
    "Charles Manson thought that when they screamed the words \"Right!\" it was actually \"Rise!\" meaning the black community rising over the white people. Charles Manson was of course crazy, and thought The Beatles were warning about a race war. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mischa - Winnipeg, Australia\n                                                  \n                                                  "
  ],
  "lyrics": "Number nine, number nine, number nine, number nine...\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, BMG Rights Management\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}