{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "Rocky Raccoon",
  "URL": "https://www.songfacts.com/facts/the-beatles/rocky-raccoon",
  "Confidence": 1.0,
  "youtube-id": "qqA4ZiQaGtU",
  "facts": [
    "Rocky in this song is not a raccoon but a boy whose girl runs off with his rival, Dan. The song is set in the Old West, so Rocky does what any self-respecting cowboy would do: he challenges Dan to a gunfight. Unfortunately for Rocky, he Dan is quick on the draw and shoots him first, wounding Rocky and proving himself worthy of the girl.",
    "Paul McCartney wrote this song. He got the idea for it when he was playing guitar with John Lennon and Donovan Leitch at the Maharishi's camp in India. The Beatles went there in 1968 to study transcendental meditation.",
    "Beatles producer George Martin played the piano in an old-west saloon style. Several Beatles songs feature piano parts, which were usually played by either Martin, Lennon, Nicky Hopkins or Billy Preston.",
    "The main character was originally called Rocky Sassoon but McCartney changed it to Raccoon, as he thought the name was more cowboyish.",
    "McCartney told Mojo about the song: \"Rocky was me writing (speaks-sings in a baccy-chewing old prospector voice), 'It was way back in the hills of Dakota-or Arkansas-in the mining days. And it was tough, picking shovels, and we were underground 24 hours a day…' I could have taken this serious route, researched it - 'Take This Hammer' (a prison work song recorded by British skiffle star Lonnie Donegan in 1959), stuff I'd been brought up on. But at that point I was a little tongue-in cheek. So I crossed it with a (British singer and banjo player popular in the 1940s) George Formby sensibility, where John and I would go (sings a bit of doggerel in a choppy rhythm) - Stanley Holloway, Albert in The Lion's Den (the comic poem The Lion and Albert, written by Holloway's creative partner Marriott Edgar in 1932). We were very versed in all that stuff (sings opening lines of Rocky Raccoon in the same choppy way). The scanning of the poetical stanza always interested me. Somehow this little story unfolded itself.\nI was basically spoofing 'the folk-singer.' And it included Gideon's Bible, which I've seen in every hotel I've ever been in. You open the drawer and there it is! Who's this guy Gideon! I still don't know to this day who the heck he is. I'm sure he's a very well-meaning guy. Rocky Raccoon was a freewheeling thing, the fun of mixing a folky ramble with Albert In The Lion's Den with its ''orse's 'ead 'andle,' ha ha.\" ",
    "Most Bibles found in hotel rooms came from a group called Gideons International, and are thus known as \"Gideon's Bibles.\" In this song, Rocky checks into a room before the showdown, where he finds one. At the end of the song, he returns to the room and encounters the Bible again. He figures it was some kind of sign: a guy named Gideon must have left it for him to aid in his recovery. Rocky isn't the sharpest tool in the shed.\nIn the Jethro Tull song \"Locomotive Breath,\" there is also a mention of these Bibles:\nHe picks up Gideons Bible \nOpen at page one \nI think God, He stole the handle and\nThe train won't stop going ",
    "Like many of McCartney's songs at the time, this was a pastiche, in this instance of folk songs. He explained in Mojo magazine October 2008: \"I've got to admit a lot of my stuff is pastiche. I'd learned by then that pastiche would work because inevitably behind it would be something more.\"",
    "There is both a harmonica and accordion on this track. The harmonica, likely played by John Lennon, comes in at the \"in the next room at the hoedown\" line. The accordion, possibly played by McCartney, can be heard starting with the line, \"The doctor came in, stinking of gin.\"",
    "Richie Havens released this as the B-side to his \"Stop Pulling and Pushing Me\" single in 1969."
  ],
  "lyrics": "Now somewhere in the Black Mountain Hills of Dakota\nThere lived a young boy named Rocky Raccoon\nAnd one day his woman ran off with another guy\nHit young Rocky in the eye\nRocky didn't like that\nHe said, \"I'm gonna get that boy\"\nSo one day he walked into town\nBooked himself a room in the local saloon\n\nRocky Raccoon checked into his room\nOnly to find Gideon's Bible\nRocky had come, equipped with a gun\nTo shoot off the legs of his rival\nHis rival it seems, had broken his dreams\nBy stealing the girl of his fancy\nHer name was Magill, and she called herself Lil\nBut everyone knew her as Nancy\nNow she and her man, who called himself Dan\nWere in the next room at the hoe down\nRocky burst in, and grinning a grin\nHe said, \"Danny boy, this is a showdown\"\nBut Daniel was hot, he drew first and shot\nAnd Rocky collapsed in the corner\n\nNow the doctor came in, stinking of gin\nAnd proceeded to lie on the table\nHe said, \"Rocky, you met your match\"\nAnd Rocky said, \"Doc, it's only a scratch\nAnd I'll be better, I'll be better, Doc, as soon as I am able\"\n\nNow Rocky Raccoon, he fell back in his room\nOnly to find Gideon's Bible\nGideon checked out, and he left it, no doubt\nTo help with good Rocky's revival\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}