{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "Run For Your Life",
  "URL": "https://www.songfacts.com/facts/the-beatles/run-for-your-life",
  "Confidence": 1.0,
  "youtube-id": "fDa7bOUEsGE",
  "facts": [
    "John Lennon was inspired by an Elvis Presley song, \"Baby, Let's Play House,\" when he wrote this. The title and entire first line came from Elvis' song: \"I'd rather see you dead little girl, than to be with another man.\"\n\"Baby, Let's Play House\" was written in 1955 by Richard Gunther and was based on a 1951 Country & Western song by Eddy Arnold titled \"I Want To Play House With You,\" written by Cy Coben. That song contains the lyric, \"I'd rather see you dead, little girl, than to be with another man.\"",
    "We'd all rather forget this song, an otherwise sour note on the monumental Rubber Soul album, but here it is, so we have to look at it anyway. John Lennon made no bones about this being his \"least favorite Beatles song.\" Many agree. Do keep in mind that this was 1965; there was more slack attitudes towards gender equality than there are now.\nThere are a couple of other songs by Lennon with misogynist undertones, including \"I'll Cry Instead\" and \"You Can't Do That.\" Paul McCartney, in interviews for the book Many Years From Now, explains that while he had girlfriends and open relationships, Lennon had a marriage and hence a wife to worry about while he was on the road touring all the time. Interestingly enough, Yoko Ono mellowed him out and Lennon and Ono became crusading activists for all kinds of civil rights causes.",
    "In December 1992, the Ottawa radio station CFRA banned this song when a listener complained that the line, \"I'd rather see you dead little girl, than to be with another man,\" promoted violence against women. Most surprising about this news item was that they were playing the song at all!"
  ],
  "lyrics": "Well, I'd rather see you dead, little girl\nThan to be with another man\nYou better keep your head, little girl\nOr you won't know where I am\n\nYou better run for your life if you can, little girl\nHide your head in the sand, little girl\nCatch you with another man\nThat's the end'a little girl\n\nWell, you know that I'm a wicked guy\nAnd I was born with a jealous mind\nAnd I can't spend my whole life\nTrying just to make you toe the line\n\nYou better run for your life if you can, little girl\nHide your head in the sand, little girl\nCatch you with another man\nThat's the end'a little girl\n\nLet this be a sermon\nI mean everything I've said\nBaby, I'm determined\nAnd I'd rather see you dead\n\nYou better run for your life if you can, little girl\nHide your head in the sand, little girl\nCatch you with another man\nThat's the end'a little girl\n\nI'd rather see you dead, little girl\nThan to be with another man\nYou better keep your head, little girl\nOr you won't know where I am\n\nYou better run for your life if you can, little girl\nHide your head in the sand, little girl\nCatch you with another man\nThat's the end'a little girl\nNa, na, na\nNa, na, na\nNa, na, na\nNa, na, na\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}