{
  "Artist": "The Beatles",
  "Album": "CD2 - The Beatles",
  "Title": "Savoy Truffle",
  "URL": "https://www.songfacts.com/facts/the-beatles/savoy-truffle",
  "Confidence": 1.0,
  "youtube-id": "vzpbrxp3rOA",
  "facts": [
    "This was inspired by Eric Clapton's love of chocolate. He and George Harrison were good friends.",
    "George Harrison got the lyrics for this from the inside lid of a box of chocolates. Montelimart, Ginger Sling, Cream Tangerine, and Coffee Dessert were names of candies in the Mackintosh \"Good News\" assortment.",
    "Beatles' publicist Derek Taylor wrote some of the words.",
    "Harrison had the sax distorted to create a distinctive sound.",
    "According to Mojo magazine, the line \"You know that what you eat you are\" was suggested to Harrison by the Beatles' press officer Derek Taylor."
  ],
  "lyrics": "Creme tangerine and montelimar\nA ginger sling with a pineapple heart\nA coffee dessert, yes you know it's good news\nBut you'll have to have them all pulled out\nAfter the Savoy truffle\n\nCool cherry cream, a nice apple tart\nI feel your taste all the time we're apart\nCoconut fudge, really blows down those blues\nBut you'll have to have them all pulled out\nAfter the Savoy truffle\n\nYou might not feel it now\nBut when the pain cuts through\nYou're going to know, and how\nThe sweat is going to fill your head\nWhen it becomes too much\nYou shout aloud\n\nYou'll have to have them all pulled out\nAfter the Savoy truffle\n\nYou know that what you eat you are,\nBut what is sweet now, turns so sour\nWe all know Obla-Di-Bla-Da\nBut can you show me, where you are?\n\nCreme tangerine and montelimar\nA ginger sling with a pineapple heart\nA coffee dessert, yes you know it's good news\nBut you'll have to have them all pulled out\nAfter the Savoy truffle\nYes you'll have to have them all pulled out\nAfter the Savoy truffle\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: CONCORD MUSIC PUBLISHING LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}