{
  "Artist": "The Beatles",
  "Album": "CD2 - The Beatles",
  "Title": "Sexy Sadie",
  "URL": "https://www.songfacts.com/facts/the-beatles/sexy-sadie",
  "Confidence": 1.0,
  "youtube-id": "SVeJbIOQp_o",
  "facts": [
    "John Lennon wrote this song about Maharishi Mahesh Yogi, The Beatles' Indian guru. The group took an interest in Maharishi's Transcendental Meditation (TM) after attending one of his lectures in August 1967. In February 1968, they went to India to study TM at his camp, but left early when they began to fear he was more of a cult leader than an enlightened being. Specifically, they thought he was using his status to lure women.\nLennon wrote the song as \"Maharishi,\" but changed the title to \"Sexy Sadie\" to keep from getting sued. The opening lines make Lennon's sentiment perfectly clear:\nSexy Sadie, what have you done\nYou made a fool of everyone",
    "Lennon dubbed the Maharishi \"sexy\" after hearing he hit on the actress Mia Farrow, who was also at the camp. Farrow's sister, Prudence, was there as well, and her experience led Lennon to write \"Dear Prudence.\"\nBy the time George Harrison and John Lennon caught wind of Maharishi's discretions, Paul McCartney and Ringo Starr had already left, but they had planned to leave early. According to Lennon, when he and Harrison confronted Maharishi to tell them they were leaving, Maharishi asked why, and Lennon said, \"If you're so cosmic, you'll know why.\"\nThis was the end of The Beatles' association with Maharishi Mahesh Yogi, but they did continue to explore meditation and Eastern philosophy. Harrison, in particular, delved much deeper into his teachings and came to believe in reincarnation.\nAs for the Maharishi, it's not clear if he did anything wrong at the camp, as Lennon may have gotten bad information from those trying to curry favor. This song though, sullied Maharishi's reputation and derailed the Transcendental Meditation movement.",
    "This song required 52 takes and a full day-and-a-half of studio time. Lennon spent much of time cussing his way through the sessions, deeply hurt after coming to the conclusion that the Maharishi was not as holy as he'd hoped.",
    "The song confirmed Charles Manson's belief that the Beatles were talking directly to him, by virtue of one of his followers, Susan Atkins, having already been nicknamed Sadie Mae Glutz. Many of the tracks from The White Album (\"Piggies\" for example) were interpreted by Manson as messages directed to him.\nIn the Anthology book when The Beatles were talking about Manson, John Lennon was quoted as saying, \"All the other fellows had some 'influence' on Manson, but not me I didn't do nothing,\" but Sadie was the nickname for Susan Atkins (Sadie Mae Glutz) which did contribute to Manson's belief that the Beatles were singing about him and his \"Family.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Breanna - Henderson, NV\n                                                  \n                                                  "
  ],
  "lyrics": "Sexy Sadie, what have you done\nYou made a fool of everyone\nYou made a fool of everyone\nSexy Sadie, ooh, what have you done\n\nSexy Sadie, you broke the rules\nYou laid it down for all to see\nYou laid it down for all to see\nSexy Sadie, ooh, you broke the rules\n\nOne sunny day the world was waiting for a lover\nShe came along and turned on everyone\nSexy Sadie, the greatest of them all\n\nSexy Sadie, how did you know\nThe world was waiting just for you\nThe world was waiting just for you\nSexy Sadie, ooh, how did you know\n\nSexy Sadie, you'll get yours yet\nHowever big you think you are\nHowever big you think you are\nSexy Sadie, ooh, you'll get yours yet\n\nWe gave her everything we owned just to sit at her table\nJust a smile would lighten everything\nSexy Sadie, she's the latest and the greatest of them all\n\nShe made a fool of everyone\nSexy Sadie\n\nHowever big you think you are\nSexy Sadie\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "place": {
    "name": "Rishikesh, India",
    "facts": [
      "Only a song from the '60s could possibly have an origin and an evolution quite like those of \"Sexy Sadie\" from the Beatles' eponymous album. Only in that era of cultural upheaval, spiritual experimentation, and rivers of LSD could a song about a philandering spiritual guru end up as one about a female sexpot. Thankfully, that decade of weirdness and rebellion did happen, and so we ended up with both the terrific song that is \"Sexy Sadie,\" and the fascinating story behind it.",
      "In February of 1968, the Beatles traveled to Rishikesh, India, to attend the Maharishi Mahesh Yogi's meditation center. Ringo Starr stayed for 10 days. Paul McCartney stayed for a month. John Lennon and George Harrison lasted for about six weeks. It was an important historical event in a couple of different ways. It not only seized the public's attention and helped further fuel the growing popular interest in Indian spirituality and transcendental meditation, but it also gave the band space to pen somewhere between 30 and 48 songs that eventually made their way onto the discography of one of music history's most influential acts.",
      "Today it seems almost unimaginable that the world's biggest band would travel to Rishikesh, isolated from the media, to stay in relatively austere housing. But it wasn't something even mildly inconceivable in those times. In fact, the Beatles were just four more notable figures (albeit the",
      "notable) at the center. Mia Farrow, Donovan, Paul Saltzman, and several other celebrities and celebrity associates were all there upon their arrival.",
      "The Maharishi himself was something of a celebrity at that time. He had become widely recognized as the creator of Transcendental Meditation and a high profile peddler of enlightenment. Once he became the Beatles' spiritual advisor, of course, he easily cemented his place as the most powerful yogi in the world.",
      "Even today Rishikesh is known as one of the most important places for yoga in the world, if not",
      "most important. In 1968 it was at the height of its notoriety in that role because of Maharishi's International Academy of Meditation, which was a 14-acre compound located by the River Ganges.",
      "While all of the living conditions for students at the academy were simpler than they'd been used to in the West, the austerity was scaled a bit according to the visitor's level of fame. The Beatles, being demigods of rock, had some extra amenities and comforts. Still, their conditions paled in comparison to what they usually had.",
      "The band had gone to explore the spiritual peace promised by transcendental meditation, but it appears to have only somewhat sharpened Lennon's famously caustic wit; he once walked across a crowded room to pat the Maharishi on the head, saying, \"There's a good little guru.\"",
      "While the band was supposed to focus entirely on meditation and silence, they spent a lot of time working on music together. Lennon learned a guitar-picking technique from Donovan that he then taught to Harrison. The result can be heard on the songs \"",
      "\" and \"",
      ".\"",
      "Things went well for everyone at the academy at first. Harrison, in particular, was powerfully affected by his visit. However, some cracks in the relationship between Maharishi and the Beatles began to develop. Lennon in particular was put off by the Maharishi's penchant for turning profits and by the fact that he kept an accountant always in tow. In return, the Maharishi was frustrated with the Beatles' continued drug and alcohol use.",
      "Tensions rose as murmurings started that the Maharishi had been making passes at some of the female attendees. But when actress Mia Farrow reported that the guru had accosted her in some nearby caves, the whole thing came to a head.  Though there was no evidence that the assault happened, and despite the fact that people like Cynthia Lennon defended the Maharishi, John Lennon decided to condemn the guru as a \"lecherous womanizer\" and declare to the world that the man was a fake.",
      "Out of all those bad feelings, Lennon penned what was originally entitled \"Maharishi.\"  A verse from an early outtake gives an indication of the original song: \"Maharashi, you little twat/Who the f*ck do you think you are?/Who the f*ck do you think you are?/Oh, you c*nt.\" Someone eventually talked sense into Lennon and convinced him that releasing such a song was just inviting lawsuits.  So, keeping the cadence and softening the lyrics, the title segued into \"Sexy Sadie.\"",
      "The split between the band and the Maharishi became part of the Beatles myth. Years after the event, the whole band deeply regretted it. The sexual assault incident was never proven, and today it's generally accepted that it was all a misunderstanding exacerbated by a couple of the personalities attending the academy at that time. In the 1990s McCartney and Harrison apologized publicly and gave a benefit concert for the Maharishi-associated Natural Law Party. The damage to the guru's name, however, was permanent. Though it didn't ruin him or his movement by any means, it did sully his reputation and brand him as a conman among many.",
      "As for Rishikesh, our \"songplace\" of interest, it's still there in the Himalayan foothills in the Dehradun district of India, and still considered by many to be the yoga capital of the world. It has also been building a reputation as a tourist location for hikers, white-water rafters, and bungee jumpers.",
      "Wholly unrelated to the events in Rishikesh, the song was also a critical component of the grisly 1969 Tate/LaBianca murders, part of cult figurehead Charles Manson's twisted interpretation of the Beatles (commonly known as the White Album). While thematically it didn't have quite as much weight in the warped minds of him or his followers, it was critical to his murderous \"",
      "\" scenario (so known due to the book of the same name by Vincent Bugliosi) because at some time before the album's release the Family had dubbed member Sadie Mae Glutz \"Sexy Sadie.\" This coincidence helped cement in Manson's mind that the Beatles were speaking to him through their album.",
      "The Manson Family connection is fitting in a blackly ironic way. The Family's murder spree is largely credited today as being the psychic death knell for the Flower Power generation and the thing that finally killed the idealism of the '60s. The fact that Sexy Sadie sprang from a drug-filled stay at a spiritual retreat, was written as an attack on a supposedly-but-not-really corrupt guru, and then ended in misinterpretation by a band of homicidal, psychedelic nomads is sort of a microcosmic portrait of the era's social and spiritual experiments. Some may disagree with that assessment, of course.",
      "\"Sexy Sadie\" also just happens to be an exceptionally catchy, pretty song. There's something to be said for that, as well.",
      "~"
    ]
  }
}