{
  "Artist": "The Beatles",
  "Album": "Sgt. Pepper's Lonely Hearts Club Band",
  "Title": "Sgt. Pepper's Lonely Hearts Club Band",
  "URL": "https://www.songfacts.com/facts/the-beatles/sgt-peppers-lonely-hearts-club-band",
  "Confidence": 1.0,
  "youtube-id": "VtXl8xAPAtA",
  "facts": [
    "Paul McCartney wrote this and sang lead. After recording it, he had the idea of doing the whole album as if Sgt. Pepper was a real band. It became the title track of what was considered a \"concept\" album, with the songs running seamlessly together on the record.",
    "The album was heavily produced and took 129 days and about 700 hours to complete. The Beatles first album, Please Please Me, was recorded in less than 10 hours.",
    "The crowd noise was dubbed in. The Beatles had stopped touring by then.",
    "Three days after the album came out, Jimi Hendrix opened a concert with this. McCartney and Harrison were both there, and were very impressed that Hendrix learned it so quickly.",
    "There really is an apostrophe in this song's title, although on the album cover, it is rendered without. Since the Lonely Hearts Club Band belongs to Sgt. Pepper, it is possessive, thus \"Sgt. Pepper's.\"",
    "This is reprised at the end of the album before the final track, \"A Day In The Life.\"",
    "This was recorded as one song with \"With A Little Help From My Friends.\" They flow seamlessly on the album, creating a problem for radio stations that want to play just one of the songs. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Don - Rapid City, SD\n                                                  \n                                                  ",
    "George Harrison, Paul McCartney, and Ringo Starr played this on May 19, 1979 at Eric Clapton's wedding. Clapton married Harrison's ex-wife, Pattie.",
    "Artist Peter Blake designed the album cover as if Sgt. Pepper's band had just performed a concert. He asked The Beatles who they wanted at the concert, and put them in the cover design.",
    "All living people depicted on the cover were asked permission. Mae West refused at first - she didn't want to be part of a \"Lonely Hearts Club Band\" - but The Beatles wrote her a letter and she agreed. Other characters depicted on the album cover include comedic duos Laurel & Hardy and Abbott & Costello, Marilyn Monroe, Shirley Temple and W.C. Field. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Patrick - Tallapoosa, GA\n                                                  \n                                                  ",
    "Lennon wanted Jesus, Gandhi, and Hitler on the cover. He had recently taken a lot of heat for saying The Beatles were \"Bigger than Jesus,\" so they decided not to.",
    "It was rumored that the hand that is sticking out above Paul is that of Adolph Hitler. A Hitler cut out was on the set, but if you look at some side shots of the photo session, you can clearly see that the hand belongs to comic Issy Bonn, whose face is seen in between Paul McCartney and George Harrison. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Andre - Tampa, FL\n                                                  \n                                                  ",
    "On the cover of this album McCartney is taller than the other Beatles. This added to rumors of his death, since there is also a hand above Paul's head which is an omen of death. Also, if you take a mirror and put the edge on the center of the Lonely Hearts Club Band drum an arrow will point directly to McCartney.",
    "Sgt. Pepper was the first pop album to come with printed lyrics on the cover.",
    "The title is a parody of American bands who were choosing ridiculously long names for their groups.",
    "Twelve years after \"Sgt. Pepper's Lonely Hearts Club Band\" and \"With a Little Help from My Friends\" appeared on the Sgt. Pepper album, they were released together as a two-song medley and reached US #71 and UK #63. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jerro - New Alexandria, PA\n                                                  \n                                                  ",
    "In 2005, Bob Geldof helped organize Live 8, a set of concerts held in eight countries with the goal of promoting activism. The concerts coincided with the G-8 summit, and Geldof was hoping to send a message to world leaders that they should increase aid to Africa and institute fair trade practices. On the London stage, U2 played this with McCartney to kick off the concert. The opening line, \"It was 20 years ago today,\" was a reference to Live Aid, which Geldof organized for famine relief in 1985.",
    "Sgt. Pepper's Lonely Hearts Club Band was the first rock album to win a Grammy for Album of the Year. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "On the album cover, Paul McCartney is wearing an Ontario Provincial Police (OPP) badge on his right sleeve. You can see this better on the inside artwork. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Pat - Varna, Canada\n                                                  \n                                                  ",
    "The hand-painted drum skin used on the cover of the Sgt Pepper album was sold at Christie's House in London on 10th July 2008 for £541,250 ($1,071,000) - setting a record for non-lyrics Beatles memorabilia.",
    "In 2007, the Beatles Story museum in Liverpool went on a search for real Sgt. Peppers and found seven police or army officers in the UK that were sergeants with the last name Pepper. \"Being Sgt. Pepper is awesome but sometimes people think I am bogus when I call them on the phone or introduce myself,\" Sgt. Sean Pepper of Highfields said."
  ],
  "lyrics": "(1, 2, 3, 4)\n\nIt was twenty years ago today\nSergeant Pepper taught the band to play,\nThey've been going in and out of style,\nBut they're guaranteed to raise the smile,\nSo may I introduce to you,\nThe act you've known for all these years,\nSergeant Pepper's Lonely Hearts Club Band.\n\nWe're Sergeant Pepper's Lonely Hearts Club Band\nWe hope you will enjoy the show\nSergeant Pepper's Lonely Hearts Club Band\nSit back and let the evening go\nSergeant Pepper's Lonely\nSergeant Pepper's Lonely\nSergeant Pepper's Lonely Hearts Club Band\n\nIt's wonderful to be here,\nIt's certainly a thrill\nYou're such a lovely audience,\nWe'd like to take you home with us, we'd love to take you home\n\nI don't really want to stop the show,\nBut I thought you might like to know,\nThat the singer's going to sing a song\nAnd he wants you all to sing along,\nSo let me introduce to you\nThe one and only Billy Shears\nAnd Sergeant Pepper's Lonely Hearts Club Band\n\nOh ha ha \nYeah, dress down\nI feel it, I feel it, I feel it\nOh baby now, I feel it, I feel it, I feel it\nBaby, free now\nGotta be free now, gotta be free now, gotta be free\nDon't like that\nI think it'll probably be another day singing it\nYeah so just edit that then, it's nice\nYeah, and what you can do with the bits where you can't get it 'cause you haven't got enough breath\nJust take over, yeah\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-117.jpg",
    "facts": "Other than The Beatles, there are 63 people depicted on the album cover, including Bob Dylan and Fred Astaire"
  }
}