{
  "Artist": "The Beatles",
  "Album": "Sgt. Pepper's Lonely Hearts Club Band",
  "Title": "She's Leaving Home",
  "URL": "https://www.songfacts.com/facts/the-beatles/shes-leaving-home",
  "Confidence": 1.0,
  "youtube-id": "Dypv4SLyAfg",
  "facts": [
    "This was based on a newspaper story Paul McCartney read about a runaway girl. On February 27th, 1967 the London Daily Mail's headline read: \"A-Level Girl Dumps Car And Vanishes.\" That girl was 17-year-old Melanie Coe, who had ran away from home leaving everything behind. Her father was quoted as saying, \"I cannot imagine why she should run away, she has everything here.\"\nMcCartney said in 1000 UK #1 Hits by Jon Kutner and Spencer Leigh, \"We'd seen that story and it was my inspiration. There was a lot of these at the time and that was enough to give us the storyline. So I started to get the lyrics: she slips out and leaves a note and the parents wake up, it was rather poignant. I like it as a song and when I showed it to John, he added the Greek chorus and long sustained notes. One of the nice things about the structure of the song is that it stays on those chords endlessly.\"",
    "Melanie Coe, who became an estate agency director, told Dave Simpson her story in a 2008 interview for The Guardian. Said Coe: \"London was a very different place in the '60s. I went to a club called the Bag O' Nails [Soho] and I met everybody. You sat on the next table to the Beatles, the Rolling Stones, the Hollies, because there weren't many clubs in London. I got in coz I was a cute little girl and I dressed in the latest fashions. I'd go to Mary Quant and Biba, sketch the dress and get my aunt to make my clothes. Ready Steady Go! loved that. They held open auditions. I was 13. It went on what you were wearing and how you danced. I was asked to come every week. I met the Beatles at Ready Steady Go! George was great to meet - I looked a lot like Pattie Boyd, who later became his wife, of course.\nI was always going out. I danced the night away and was a face in London. In those days, to be trendy everything had to be French. I bought the T-shirt of the moment, which was my star sign in French. I loved that T-shirt. One day I got home and my mother had cut it to ribbons. She wanted me to look like Princess Anne, not my idol, Marianne Faithfull. When my parents found out I had the pill they grabbed me by the scruff of the neck and made me flush them down the toilet.\nI was 17 by then and ran away leaving a note, just like in the song. I went to a doctor and he said I was pregnant, but I didn't know that before I left home. My best friend at the time was married to Ritchie Blackmore, so she hid me at their house in Holloway Road. It was the first place my parents came to look, so I ran off with my boyfriend, who was a croupier, although he had been 'in the motor trade' like it says in the song. I think my dad called up the newspapers - my picture was on the front pages. He made out that I must have been kidnapped, because why would I leave? They gave me everything - coats, cars. But not love. My parents found me after three weeks and I had an abortion.\nI didn't realize for a long time that the song was about me. Years later Paul was on a program talking about how he'd seen a newspaper article and been inspired by it. My mother pieced it all together and called me to say, 'That song's about you!'\nI can't listen to the song. It's just too sad for me. My parents died a long time ago and we were never resolved. That line, 'She's leaving home after living alone for so many years' is so weird to me because that's why I left. I was so alone. How did Paul know that those were the feelings that drove me towards one-night stands with rock stars? I don't think he can have possibly realized that he'd met me when I was 13 on Ready Steady Go!, but when he saw the picture, something just clicked.\"",
    "No Beatles played instruments on this. John and Paul contributed vocals, which were double-tracked to sound like a quartet, and session musicians played strings. The first female to play on a Beatles album, Sheila Bromberg, played harp. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "Paul McCartney used his falsetto sparingly but effectively in his Beatles years. On this song, he goes up high in the contrasting lines in the chorus (\"she... is leaving... home\"), as John Lennon sings the part of the girl's parents in a plaintive manner (\"we gave her most of our lives...\").",
    "The string section was arranged by Mike Leander because producer George Martin was busy. Leander would later arrange strings for The Rolling Stones on \"As Tears Go By.\"",
    "Some of the lyrics were things John Lennon's Aunt Mimi said to him as a child. She raised John after his parents separated.",
    "In 1988 this was covered by Billy Bragg as part of the children's charity project album Sgt. Pepper Knew My Father. His version was released as a single in the UK as part of a double A side with Wet Wet Wet's version of \"With A Little Help From My Friends.\" The double A sided single topped the UK charts for four weeks.",
    "Nilsson covered this, along with \"You Can't Do That,\" for his 1967 breakthrough album, Pandemonium Shadow Show. Shortly after, the Beatles named Nilsson as their favorite singer."
  ],
  "lyrics": "Wednesday morning at five o'clock\nAs the day begins\nSilently closing her bedroom door\nLeaving the note that she hoped would say more\n\nShe goes downstairs to the kitchen\nClutching her handkerchief\nQuietly turning the backdoor key\nStepping outside, she is free\n\nShe(we gave her most of our lives)\nIs leaving (sacrificed most of our lives)\nHome (we gave her everything money could buy)\nShe's leaving home, after living alone, for so many years (bye bye)\n\nFather snores as his wife gets into her dressing gown\nPicks up the letter that's lying there\nStanding alone at the top of the stairs\nShe breaks down and cries to her husband\n\"Daddy, our baby's gone.\n\"Why would she treat us so thoughtlessly?\nHow could she do this to me?\"\n\nShe (we never thought of ourselves)\nIs leaving (never a thought for ourselves)\nHome (we struggled hard all our lives to get by)\nShe's leaving home, after living alone, for so many years\n\nFriday morning, at nine o'clock\nShe is far away\nWaiting to keep the appointment she made\nMeeting a man from the Motortrade\n\nShe (what did we do that was wrong)\nIs Having (we didn't know it was wrong)\nFun (fun is the one thing that money can't buy)\n\nSomething inside, that was always denied, for so many years\nShe's leaving home, bye, bye\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Universal Music Publishing Group\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}