{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "She Came In Through The Bathroom Window",
  "URL": "https://www.songfacts.com/facts/the-beatles/she-came-in-through-the-bathroom-window",
  "Confidence": 1.0,
  "youtube-id": "o14wVjw3HfQ",
  "facts": [
    "Paul McCartney wrote \"She Came In Through The Bathroom Window\" about a fan who broke into his house. Diane Ashley claims it was her. \"We found a ladder in his garden and stuck it up the bathroom window which he'd left slightly open,\" she told Songfacts. \"I was the one who climbed up and got in.\"\nNow married with four children, Diane keeps a framed photo of herself with Paul on her kitchen shelf and looks back on her days as an Apple Scruff with affection: \"I don't regret any of it. I had a great time, a really great time.\"",
    "Landis Kearnon (known at the time as Susie Landis) gave us the following account:\nHere, all this time I thought this song was written about me and my friend Judy. What a surprise to learn there was someone named Diane Ashley who put a ladder up to Paul's house and climbed in through the bathroom window. This and the bit about \"quit the police department\" being inspired by an ex-cop taxi driver in NYC tells me something I already know about songwriting, which is that many songs are composites. This one obviously was because Diane wasn't the only person having a profound effect on Paul McCartney by crawling in a bathroom window in 1967 (maybe '68 in her case). Judy and I were paid $1500 by Greene & Stone, a couple of sleazy artist managers driving around the Sunset Strip in a Chinchilla-lined caddy limo, to \"borrow\" the quarter-inch master of \"A Day In The Life\" off of David Crosby's reel-to-reel, drive it to Sunset Sound studios in Hollywood where Greene & Stone duped it, then put it back where we found it at Crosby's Beverly Glen Canyon pad. Crosby was playing with the Byrds that day in Venice so we knew his house was empty. This was the day after a major rainstorm so the back of his house was one big mudslide. We climbed up it, leaving 8-inch deep footprints and, you guessed it, gained access via the bathroom window, leaving behind footprints and a veritable goldmine of forensic matter. We were really nervous and did not make clear mental notes of how the master reel was on the player, but did have the sense to leave Crosby's front door unlocked while we drove across town and back. After the tape was back on the machine (badly) we changed out of our muddy shoes, drove to the Cheetah in Venice, and hung out with the Byrds into the evening, thinking we were awfully clever and cute. We did not know why Greene & Stone would pay so much money for a copy of a Beatles song, other than the fact that is was a groundbreaking and mind-blowing piece, but found out the next day when we heard \"A Day In The Life\" on KHJ, I think it was. Greene & Stone had used it as payola to get one of their groups, The Cake, singing \"Yes We Have No Bananas,\" on the air. Which they did, and it sucked, but oh well. By the following day \"A Day In The Life\" was no longer on the air. And just a day or two after that there was a front page blurb in the LA Times about \"A Day In The Life\" getting aired one month prior to the release date of the single and the Sgt. Pepper LP, which apparently cost the Beatles plenty and they were suing Capitol or Columbia, whichever the label was, for $2 million... and McCartney was flying in from London to deal with the mess. Oops. Judy and I nearly sank through the floor. Though we were active \"dancers\" in the various nightclubs on the Sunset Strip, we lay low for a while, not knowing what to expect. In fact, other than a song being written and a GREAT cover by Joe Cocker, nothing happened. We got our money, spent it on groovy clothes, of course (what else was there?) and never heard a word about it.\n\"I knew what I could not say\" and \"protected by a silver spoon\" seemed to explain why there were no repercussions. My dad was a TV director who had already threatened to bust and ruin David Crosby for smoking pot with and deflowering his daughter; he had clout and David was afraid of him. Judy was from money and influence too. I feel that David knew exactly who had broken in and borrowed the tape but couldn't press charges. He probably wasn't supposed to be playing the master for all his friends and hangers-on, so there must have been hell to pay for him. I always felt bad for the cred it must have cost him with his friend Paul McCartney.\nOh, the bit about \"Sunday's on the phone to Monday, Tuesday's on the phone to me\" - that was somebody named Sunday, maybe a detective, I can't remember now, calling the producer Billy Monday about the break-in and song leak. Billy Monday, knowing she was a friend of McCartney's, called Tuesday Weld, and it was she who called Paul in London and told him the news. Well, I guess I didn't make this very short after all. But you can't tell me that this incident didn't feed into the overall inspiration for the song. I'm just glad it turned out so cool and hope it made a heap for them in compensation for the publicity costs at the outset.\nIt was interesting and exciting then, that's for sure. Even though I came of age into that scene and had nothing to compare it to, I still had a sense at the time of being at the epicenter of something big. Some of that was attributable to the hubris of youth, but some of it turned out to be real, as it happened. Now, present time, it makes my day to come across someone who still finds it interesting or even knows what or whom I'm talking about. By the way, I never did get to meet the Beatles, though I was invited to party where they were staying once, when I was 17. My mother wouldn't let me go! I never forgave her.\nI lived in LA until 1987 where I was a model, actress, (groupie, but that wasn't professional), marching band manager, religious (Buddhist) leader, newspaper columnist, secretary, copywriter, copy editor, account executive, screenwriter, songwriter, band leader, session singer, textile designer, artist. Since then, in the Santa Fe area and now, since 1992, in Tucson, I continued my artistic and musical endeavors, ran a fabric-painting factory, was a jazz singer for several years (which has mutated to something more individual and artistic of late), have worked numerous odd jobs from pizza delivery to bookstore management, and am now close to completing my first novel, which is set in a Buddhist cult in the early '70s.\nIn the '70s I traveled halfway around the world on a square-rigged cargo ship, lived and sang in Europe for three years, and, as of 1991, am a mother of one though I never married.\nSubsequent to the bathroom window event, my friend and partner in crime, as it were, Judy, went off with a Dick Clark Productions road show (can't remember the name of it but it was something timely) as \"Irma the Dancing Girl.\" Her job, nightly, in each new town, was to put on a bikini, dance, and paint wild, acid abstract canvases with her extremely long blond hair. I, on the other hand, joined a Buddhist cult, which was like living on another planet entirely, and completely disappeared from view, as far as the \"scene\" was concerned. Judy and I didn't hang out much after we realized the impact of our little romp. We didn't talk about it, but we may have decided at some level that we pushed our combined wildness a bit too far on that one and moved on to \"safer\" friends. I saw her once in the early '70s. She had been married and divorced, was the mother of one, and that was the last contact we had.",
    "The Beatles recorded this as one song with \"Polythene Pam.\"",
    "The Beatles gave this to Joe Cocker, who released it in 1969 a few months after The Beatles released theirs. Cocker's version was used on the soundtrack to the movie All This and World War II, released in 1976. A strange mix of World War II documentary footage set to the music of The Beatles, the movie bombed and has barely been heard of since. Others who covered The Beatles on the soundtrack include Peter Gabriel, Elton John, Tina Turner, Leo Sayer, Frankie Laine and the Bee Gees. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Emma - Palm Beach, Australia\n                                                  \n                                                  ",
    "This is part of a suite of songs at the end of Abbey Road. They used bits from many songs they never finished to put the suite together.",
    "Paul McCartney said in a documentary shown February 6, 2002 in England that part of the lyric was inspired by sitting in the back of a New York cab. The drivers name was on display (Quitts) saying \"Ex Police Department,\" which inspired the line: \"And so I quit the Police Department and got myself a steady job...\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n John - London, England\n                                                  \n                                                  "
  ],
  "lyrics": "She came in through the bathroom window\nProtected by a silver spoon\nBut now she sucks her thumb and wanders\nBy the banks of her own lagoon\n\nDidn't anybody tell her?\nDidn't anybody see?\nSunday's on the phone to Monday\nTuesday's on the phone to me\n\nShe said she'd always been a dancer\nShe worked at fifteen clubs a day\nAnd though she thought I knew the answer\nWell, I knew what I could not say\n\nAnd so I quit the police department\nAnd got myself a steady job\nAnd though she tried her best to help me\nShe could steal but she could not rob\n\nDidn't anybody tell her?\nDidn't anybody see?\nSunday's on the phone to Monday,\nTuesday's on the phone to me\nOh yeah\n                                                  \n                                                  Writer/s: JOHN LENNON, PAUL MCCARTNEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}