{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Something",
  "URL": "https://www.songfacts.com/facts/the-beatles/something",
  "Confidence": 1.0,
  "youtube-id": "UelDrZ1aFeY",
  "facts": [
    "Written and sung by George Harrison, \"Something\" seemed to be inspired by Harrison's wife, Pattie. When asked in 1969 by BBC presenter David Wigg if she inspired the song, Harrison dithered, saying, \"Maybe Pattie, probably.\"\nLater, he claimed he did not have anyone in mind when he wrote it. George was really into his studies of Krishna Consciousness when he wrote the song, and its original intent was as a devotion to Lord Krishna. In fact, the lyric was \"something in the way HE moves,\" but George ended up changing it because he didn't want to be perceived as a \"poof.\"\nPattie did inspire \"Layla\" when Eric Clapton realized he loved her a few years later. She and Clapton were married from 1979-1988 (he also wrote \"Wonderful Tonight\" for her).\nIn her 2007 book Wonderful Tonight: George Harrison, Eric Clapton, and Me, Pattie Boyd wrote: \"George wrote a song called 'Something.' He told me in a matter-of-fact way that he had written it for me. I thought it was beautiful and it turned out to be the most successful song he ever wrote, with more than 150 cover versions. George's favorite version was the one by James Brown. Mine was the one by George Harrison, which he played to me in our kitchen. But, in fact, by then our relationship was in trouble. Since a trip to the Maharishi Mahesh Yogi's ashram in India in 1968, George had become obsessive about meditation. He was also sometimes withdrawn and depressed.\"",
    "This was released as a double A-side single with \"Come Together.\" It was the only song written by George Harrison released as a single by The Beatles. They had used some of his songs as B-sides, including \"The Inner Light\" and \"Old Brown Shoe.\"",
    "Harrison wrote this during a break while The Beatles were working on The White Album. It was not recorded in time for the album, so Harrison gave the song to Joe Cocker, but Cocker didn't release it until late in 1969 on his second album, Joe Cocker!, which came out about a month after The Beatles issued it on Abbey Road.",
    "Harrison came up with the title and the first line after listening to a James Taylor song called \"Something In The Way She Moves.\" Taylor was signed to Apple Records (The Beatles' label) at the time.",
    "This is the only song on the Beatles 1 album that was not a #1 hit on its own in the US or UK. \"Something\" and \"Come Together\" spent one week at #1 on Billboard's Hot 100 chart when the compilers of the chart changed its ranking method and stopped giving separate rankings for the two sides of a single. It was also gave Harrison representation among the 27 tracks.  \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Frank Sinatra called this \"The greatest love song ever written.\" He often performed it in the '70s, at one point wrongly attributing it to Lennon and McCartney rather than Harrison.",
    "Harrison had the first line, \"Something in the way she moves,\" but had trouble coming up with the second. He considered \"attracts me like a pomegranate,\" before coming up with \"attracts me like no other lover.\"",
    "This was used in a commercial for Chrysler cars in 1987.",
    "With at least 200 cover versions on record, this is the second-most-covered Beatles song; only \"Yesterday\" has been covered more.",
    "James Brown covered this song, releasing it as the B-side of his 1973 single \"Think.\" When he appeared on the radio show Rockline in 1992, Harrison said this was the best cover of anything he had done. \"It's the most incredible version,\" he said. \"I think they should put it out as a single.\"",
    "John Lennon said that this was his favorite song on Abbey Road.",
    "Harrison wrote this on a piano. The Beatles often composed and recorded separately at this time.",
    "Harrison pictured Ray Charles on vocals when he wrote this. Charles did eventually cover it, including it on his 1971 album Volcanic Action Of My Soul.",
    "With 21 string players used in overdubs, this ended up being one of the most orchestral Beatles songs. This sound made it a staple of light rock radio and, in bowlderized instrumental form, Muzak.",
    "The Beatles had long since stopped touring when they recorded this song, but George Harrison played it at most of his performances. He only headlined one tour: a 1974 trek with Ravi Shankar, but did join Eric Clapton on 12 tour dates in Japan in 1991. On both tours, Harrison included \"Something\" in his sets. He also played it at the Concert For Bangladesh, which he helped organize in 1971.",
    "\"Something\" was recorded over several sessions as they constructed the song. At one point, it had a long instrumental tag at the end.",
    "Harrison chastised McCartney for being too active with his bass lines in this song. In the past, Paul had always been very critical of George's guitar playing on his songs. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Dave Grohl, a former member of Nirvana and leader of The Foo Fighters, recorded a tribute song to Harrison on the Foo's first album called \"Oh, George\" based on the guitar lead to this. Harrison was Grohl's favorite Beatle, and this was one of the first leads he learned to play on guitar.",
    "As a tribute to George Harrison, Paul McCartney played a version of this on his 2002 tour using a ukulele George had given him.",
    "Jeff Lynne, Joe Walsh and Dhani Harrison performed this song on the CBS special The Beatles: The Night That Changed America. The show featured Grammy-winning performers covering Beatles songs; it aired on February 9, 2014 - the 50th anniversary of the group's first Ed Sullivan Show appearance."
  ],
  "lyrics": "Something in the way she moves\nAttracts me like no other lover\nSomething in the way she woos me\nI don't want to leave her now\nYou know I believe and how\n\nSomewhere in her smile she knows\nThat I don't need no other lover\nSomething in her style that shows me\nI don't want to leave her now\nYou know I believe and how\n\nYou're asking me will my love grow\nI don't know, I don't know\nYou stick around and it may show\nI don't know, I don't know\n\nSomething in the way she knows\nAnd all I have to do is think of her\nSomething in the things she shows me\nI don't want to leave her now\nYou know I believe and how\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: CONCORD MUSIC PUBLISHING LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}