{
  "Artist": "The Beatles",
  "Album": "Magical Mystery Tour",
  "Title": "Strawberry Fields Forever",
  "URL": "https://www.songfacts.com/facts/the-beatles/strawberry-fields-forever",
  "Confidence": 1.0,
  "youtube-id": "HtUH9z_Oey8",
  "facts": [
    "Strawberry Field was a Salvation Army home in Liverpool where John Lennon used to go. He had fond memories of the place that inspired this. In 1984, Lennon's widow Yoko Ono donated $375,000 to the home. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "John's aunt Mimi did not like John going to Strawberry Fields, as it was basically an orphanage and she thought they would lead John astray. John liked going there because having lost his father and later his mother he felt a kinship to the lads. When John and his aunt would argue about his going he would often reply, \"What are they going to do, hang me?\" Thus the line \"Nothing to get hung about.\" In America, to be \"hung up\" is to worry about something, so many US listeners thought the line meant that it was nothing to get \"hung up about.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ken - Hartland, MI\n                                                  \n                                                  ",
    "Lennon (from his 1980 interview with Playboy magazine): \"Strawberry Fields is a real place. After I stopped living at Penny Lane, I moved in with my auntie who lived in the suburbs in a nice semidetached place with a small garden and doctors and lawyers and that ilk living around... not the poor slummy kind of image that was projected in all the Beatles stories. In the class system, it was about half a class higher than Paul, George and Ringo, who lived in government-subsidized housing. We owned our house and had a garden. They didn't have anything like that. Near that home was Strawberry Fields, a house near a boys' reformatory where I used to go to garden parties as a kid with my friends Nigel and Pete we would go there and hang out and sell lemonade bottles for a penny. We always had fun at Strawberry Fields. So that's where I got the name. But I used it as an image. Strawberry Fields forever.\"\nSome of the lyrics reflect being misunderstood. Lennon added: \"The second line goes, 'No one I think is in my tree.' Well, what I was trying to say in that line is, 'Nobody seems to be as hip as me, therefore I must be crazy or a genius.'\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Conrad - Los Angeles, CA\n                                                  \n                                                  ",
    "Lennon wrote this while he was in Spain working on a movie called How I Won The War. He house where he stayed was in Almeria, which is in the southeast corner of the country. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Michelle Hardman - Leeds, England\n                                                  \n                                                  ",
    "A distorted voice at the end sounds like \"I buried Paul,\" which fueled rumors that Paul McCartney was dead. The voice is actually Lennon saying, \"Cranberry sauce.\" Over the end credits of the Simpsons episode \"D'oh-in In The Wind,\" you can hear Homer saying \"I buried Flanders\" in reference to this. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Tommy - Flower Mound, TX\n                                                  \n                                                  ",
    "There is a memorial to Lennon in Central Park called \"Strawberry Fields.\" It is located across from The Dakota, the building in New York City where Lennon lived.",
    "John donated money to Strawberry Fields before his death. One of its buildings is named \"Lennon Hall.\"",
    "This was released as the flip side of \"Penny Lane.\" The Beatles often released singles that contained a song written by Lennon on one side, and a song written by McCartney on the other. Which single was considered the A-side was sometimes a point of contention.",
    "This was the first Beatles single to break their long-running streak of #1 hits in the UK. If they had not released it with \"Penny Lane,\" they would have beaten the existing #1 by a large margin, but stores recorded sales for one side of the single or the other, which hurt the chart position for this song.",
    "Two versions were recorded with different instruments and spliced together to make one song. Where Lennon's vocal wanders during \"going to;\" after that point, the second take is slowed down, which causes the vocal to have more of a nasal sound.\nThe story goes that John Lennon couldn't decide on which of the two versions to release, so he left George Martin with the instruction to try an put them together. Martin was flabbergasted - they were in different keys and different tempos! But he found that by speeding up the first part and slowing down the second, he could make the two roughly match. The \"magical mystery\" edit occurs at exactly :59 seconds in, between the words \"Let me take you down, 'cause I'm\" /edit/ \"Going to... Strawberry Fields.\" Be cautious in listening for this edit! You will never hear this song the same way again. Martin was never completely pleased with the edit, but it just goes to show how creative and innovative the aging geniuses had become by the late '60s. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dwight Rounds, author of The Year The Music Died, 1964-1972\n                                                  \n                                                  ",
    "Paul McCartney played the intro to the song on a Mellotron, which is a keyboard that triggers loops of recorded taped instruments at different pitches. It is not a synthesized sound at all, but recordings of actual instruments - on \"Strawberry Fields Forever,\" recordings of flutes were used as the tape loops. The unique sound comes from warble in the tape during playback. Strings were another popular tape loop used in the Mellotron, used by the Moody Blues on their album Days of Future Passed. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Michael De Lazzer - Studio City, CA\n                                                  \n                                                  ",
    "This was the first pop song that faded to silence and then came back. The fake ending drove DJs nuts because it created the dreaded \"dead air.\"",
    "The working title was \"It's Not Too Bad.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Mountlake Terrace, Washington\n                                                  \n                                                  ",
    "Just after Lennon sings, \"Let me take you down 'cause I'm going to,\" there is a series of beeps that some sources claim is Morse Code forming the letters \"J\" and \"L.\" This has never been substantiated.",
    "On January 30, 1967, The Beatles shot a promotional film for this song, which was one of the first and most successful music videos, featuring stop motion animation and other special effects. It was filmed in and around Knole Park, an estate owned by the National Trust, near Sevenoaks in Kent. The tree that features prominently in the video is behind the park's birdhouse.\nThe director of these videos was Peter Goldmann, a Swedish friend of Klaus Voormann, who was associated with the Beatles in their early days in Hamburg and later designed the Revolver album cover. The following day the Beatles filmed a promo film for \"Penny Lane\" also at Knole Park. These films hold up very well because, like movies, they were shot on high quality film.",
    "Peter Gabriel covered this in 1975 on the compilation All This And World War II.",
    "\"Strawberry Fields Forever\" is the name of a US fan club that publishes a popular Beatles magazine.",
    "Cyndi Lauper performed this at the Strawberry Fields memorial in Central Park as part of the 2001 special Come Together: A Night For John Lennon's Words And Music. Proceeds from the show went to victims of the September 11 attacks on America.",
    "It turns out Strawberry Fields is not forever. In 2005, Britain's Salvation Army closed the Strawberry Field children's home in Liverpool, stating that it's preferable for children to be raised in a foster or small group home instead of a large orphanage. The home opened in 1936, and Lennon left money to Strawberry Field in his will. His widow, Yoko Ono, donated the equivalent of $70,000 in 1984 to keep the home open. Only 3 children remained in the home in January 2005, when the Salvation Army announced it would close. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Tom - Seneca, SC\n                                                  \n                                                  ",
    "Vanilla Fudge does a series of fractured covers of this song on the second side of their debut album. It is split up into four parts, titled \"STRA\" \"WBER\" \"RYFI\" and \"ELDS.\" At the end of their cover of Eleanor Rigby, they sing \"Nothing is real\" and \"Nothing to get hung about.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jim - Oxnard, CA\n                                                  \n                                                  ",
    "When Richie Havens opened the Woodstock festival in 1969, he performed this song and \"Hey Jude \" in his set.",
    "The Victorian house at the Strawberry Fields orphanage in Liverpool was torn down in 1977, and was replaced with a rectangular house named Lennon Hall.",
    "Trent Reznor from Nine Inch Nails owns the Mellotron played at the beginning of this song. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Leslie - Mountainville, NY, for above 2\n                                                  \n                                                  ",
    "On an episode of the TV show Lost, the character Charlie Pace has some lyrics to this song on his arm. The tattoo reads, \"Living is easy with eyes closed.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Hermione - Los Angeles, CA\n                                                  \n                                                  ",
    "George Martin revealed at a 2008 LA presentation for members of the National Recording Academy of Arts and Sciences that Lennon told him before he died in 1980 that he wished he could re-record everything the Beatles ever did. When the astonished Beatles producer asked, \"Even 'Strawberry Fields?'\" Lennon answered, \"Especially 'Strawberry Fields!'\"",
    "On this track, George Harrison played the swarmandal, an Indian instrument that some say sounds like a harp, but actually has more similarity to a zither. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Annabelle - Eugene, OR\n                                                  \n                                                  ",
    "Later in 1967, another famous musical strawberry emerged when a group called the Strawberry Alarm Clock had a #1 US hit with \"Incense And Peppermints.\" A common rumor was that the band based their name on this song, but they were actually told by their record company to use \"strawberry,\" as Donovan's \"Mellow Yellow,\" with the \"electrical banana,\" brought psychedelic imagery to fruit. The group, who were from California, faked a British look and sound at first, and were originally called Thee Sixpence."
  ],
  "lyrics": "Let me take you down\n'Cause I'm going to Strawberry Fields\nNothing is real\nAnd nothing to get hung about\nStrawberry Fields forever\n\nLiving is easy with eyes closed\nMisunderstanding all you see\nIt's getting hard to be someone\nBut it all works out\nIt doesn't matter much to me\n\nLet me take you down\n'Cause I'm going to Strawberry Fields\nNothing is real\nAnd nothing to get hung about\nStrawberry Fields forever\n\nNo one I think is in my tree\nI mean it must be high or low\nThat is you can't, you know, tune in\nBut it's all right\nThat is, I think, it's not too bad\n\nLet me take you down\n'Cause I'm going to Strawberry Fields\nNothing is real\nAnd nothing to get hung about\nStrawberry Fields forever\n\nAlways, no, sometimes think it's me\nBut you know I know when it's a dream\nI think, er, no, I mean, er, yes\nBut it's all wrong\nThat is I think I disagree\n\nLet me take you down\n'Cause I'm going to Strawberry Fields\nNothing is real\nAnd nothing to get hung about\nStrawberry Fields forever\nStrawberry Fields forever\nStrawberry Fields forever\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "place": {
    "name": "Strawberry Field, Liverpool, England",
    "facts": [
      "Since John Lennon was so fond of leaving intellectual riddles in his lyrics for fans to puzzle out, it is quite unusual that we can be afforded such a straightforward interpretation of \"Strawberry Fields Forever.\" Yes, Strawberry Field is a real place: it's an orphanage in Liverpool, England, specifically in the suburb Woolton. It is not the home itself, which Lennon never attended, but the surrounding area, on which the song dwells. Lennon's actual childhood home was 251 Menlove Avenue, only a short distance away.",
      "This area was prominent in John Lennon's childhood. The Salvation Army, which ran the orphanage, had a band that would play at the Calderstones Park garden party every summer, right next door to the orphanage. The young John, having played in the gardens of the area with his childhood friends, would beg his aunt to go to the party every year as soon as he heard the band playing.",
      "It is no coincidence that this song was released as a double-A single paired with \"Penny Lane\" on the other side; both songs are nostalgic for times and places past. Both Lennon and McCartney had fond memories of Penny Lane, while Strawberry Fields was Lennon's memory, exclusively.",
      "It is small wonder that Lennon had such idyllic memories of Woolton. It is a prestigious middle class suburb, incorporated into the rest of Liverpool in 1931. The average dwelling is a single-family home. The whole area is a cozy glen of old British charm, churches, inns, and pubs, feeling more like a small town than part of a larger one.",
      "As for the song itself, it is a splendid example of the Beatles at their peak, with all of the characteristic trademarks: a complex, winding melody, obscure instruments, quirky lyrics, psychedelic style, and an overall feeling of impressionism.",
      "In the opening verse, it is indeed only John Lennon who can \"take us down\" to this hazy dream, because it's more important when viewed from inside his head. Lennon explains how the song is self-analysis set to music; with the verse \"no one I think is in my tree, I mean it must be high or low,\" he was saying that he'd noticed that he was an unusual child and had concluded that he must be either a genius or a madman. Like all fiercely creative legends, it turned out to be a touch of both. \"Living is easy with eyes closed, misunderstanding all you see\" is likewise a commentary on seeing your childhood home through the eyes of your former self, in stark contrast to how you view it as an adult. If we return to our childhood homes, we will find the place very different from how we remembered it, but when we close our eyes and remember, it's all there again.",
      "The closing phrases, after the chorus repeats thrice and fades out, expands into a muddle of scattered drums, twanging strings, aimless woodwind notes flying around like dandelion puffs, and John chanting \"cranberry sauce.\" Are these the last fading pieces of memories left, wafting their way through his consciousness and yet too obscure to even put to words? Have we at last entered a trance state, where we stay playing with our childhood friends in our memory garden forever, never again to accept the reality of the present day?",
      "Only John, and his most empathic fans, know for sure."
    ]
  }
}