{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "Sun King",
  "URL": "https://www.songfacts.com/facts/the-beatles/sun-king",
  "Confidence": 1.0,
  "youtube-id": "o0smzPxu3jI",
  "facts": [
    "John Lennon wrote this song. He used to say that he dreamed 'Sun King,' but it's possible that he was also reading a book with that title by Nancy Mitford about the life of Louis XIV of France (The \"Sun King\" was a nickname given to King Louis XIV). He also was poking a bit of fun at George Harrison's \"Here Comes The Sun.\" At one point the title was \"Here Comes the Sun King.\"",
    "The foreign part of the song is a garbled mixture of Spanish and Italian, which roughly translates to: \"When for much my love of happy heart, world paparazzi my love green for warm sun, hill as much much that small carousel.\" \"Paparazzi\" has the same meaning in Italian as it does in English. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Spencer - Los Angeles, CA\n                                                  \n                                                  ",
    "This was recorded as one song with \"Mean Mr. Mustard.\" It's part of a suite of songs at the end of Abbey Road. They put together bits of unfinished songs to make up most of Side 2.",
    "The Beatles got the idea to use reverb on this after hearing Fleetwood Mac's \"Albatross.\"",
    "In 2006, a backwards version of this song called \"Gnik Nus\" was included on the album Love, which was a soundtrack to the Cirque du Soleil show featuring the music of The Beatles. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Chicago, IL\n                                                  \n                                                  "
  ],
  "lyrics": "Ooh, here comes the sun king\nHere comes the sun king\nEverybody is laughing\nEverybody is happy\nHere comes the sun king\n\nQuando para mucho mi amore de felice corazón\nMundo paparazzi mi amore chicka ferdy parasol\nCuesto obrigado tanta mucho que canite carousel\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}