{
  "Artist": "The Beatles",
  "Album": "Revolver",
  "Title": "Taxman",
  "URL": "https://www.songfacts.com/facts/the-beatles/taxman",
  "Confidence": 1.0,
  "youtube-id": "ZAWugfIKyWA",
  "facts": [
    "George Harrison wrote this song. The music was inspired by the theme song for the popular 1960s TV series Batman, which was written and originally recorded by the conductor/trumpeter Neal Hefti, and covered by the surf rock group The Marketts early in 1966 in a version that hit #17 in the US. Harrison was a big fan of the show.",
    "This was the first track on the Revolver album. It was the first song Harrison wrote that was given such prominent position, indicating that he was capable of writing songs as good as Lennon and McCartney's.",
    "This is a bitter song about how much money The Beatles were paying in taxes. At the time, high earners paid exorbitant taxes in England. Many successful entertainers left the country so they could keep more of their money. As a result, The Beatles - as well as The Who and The Rolling Stones - spent a lot of time in America and other parts of Europe as \"tax exiles.\"",
    "George Harrison said: \"'Taxman' was when I first realized that even though we had started earning money, we were actually giving most of it away in taxes.\"",
    "\"Mr. Wilson\" and \"Mr. Heath\" are mentioned in the lyrics. They are British Prime Ministers Harold Wilson and Edward Heath, who were being scorned in the song for contributing to English tax laws. Before this song was released, Wilson had presented The Beatles with the award for England's Show Business Personalities of 1963 at the Variety Club of Great Britain Annual Show Business Awards held on March 19, 1964 in London. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "Over the next few years, George Harrison came to realize that money, when you have lots of it, is a rather ephemeral concept and does not translate to happiness. This played into his spiritual awakening. In 1969, he told BBC Radio: \"No matter how much money you've got, you can't be happy anyway. So you have to find your happiness with the problems you have and you have to not worry too much about them.\"",
    "The fade-out ending is a reprise of the guitar solo as all completed takes of the song ended with John and Paul singing \"Taxman!\"",
    "There's been a lot of confusion over who played lead guitar on this track. Harrison said in his 1977 Crawdaddy interview: \"I helped out such a lot in all the arrangements. There were a lot of tracks though where I played bass. Paul played lead guitar on 'Taxman,' and he played guitar - a good part - on 'Drive My Car.\"\nJeff Emerick said in his book on recording the Beatles that Harrison just couldn't get the solo right, so Paul played most of the guitar parts, including the solo. The repeat of the solo at the end of the song was the same \"exact\" solo by Paul, which Jeff dubbed from the middle of the song to another piece of tape and cut into the fade at the end.\nSeth Swirsky, who worked as a staff songwriter before producing the Beatles documentary Beatles Stories, told Songfacts: \"I think Paul McCartney was one of the greatest guitar players of the '60s. Nobody really recognized him as an electric guitar player, or an acoustic guitar player, but his leads on 'Taxman' and on different songs that you think George played, they ripped. I think George is great, but when Paul played lead on some songs, they tore. They were just very unique. There's no one like Paul McCartney in the history of the world.\"",
    "Revolver is the only album on which Harrison has three songs. On all the others he only has two or fewer. On The White Album he had four, but it was a double album so he was only allotted his usual one track per side. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "The 1,2,3,4 count-in is fake, and was edited on as an afterthought. The real count-in (by Paul) can be heard underneath.",
    "The guitar solo at the end is a straight copy of the middle-eight. This same solo was later reused as a tape spool on \"Tomorrow Never Knows.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Mountlake Terrace, WA. U.S.A, for above 2\n                                                  \n                                                  ",
    "\"Weird Al\" Yankovic recorded a parody of this song called \"Pac-Man\" in 1981. It was never officially released on any of his albums (possibly because Pac-Man Fever got there first), but a demo version can be found on Dr. Demento's Basement Tapes No. 4. The song is very faithful to the Beatles' original, plus some musical and well-placed Pac-Man sound effects. Sample lyrics:\nI used to be a pinball freak\nThat's where you'd find me every week\nBut now it's Pacman\nYeah it's the Pacman \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Joe - Boston, MA\n                                                  \n                                                  ",
    "This wasn't the last Beatles song to question who else is getting their cash. On their 1969 Abbey Road album, Paul McCartney contributed \"You Never Give Me Your Money,\" where he takes aim at their unscrupulous business partners.",
    "Blues guitarist Stevie Ray Vaughan covered this song. His version sounds very different, but the lyrics are identical. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Rusty - Houston, TX\n                                                  \n                                                  ",
    "Harrison put some math into the lyrics. In the beginning of the song, he sings, \"There's one for you, 19 for me\" before \"If 5 percent appears too small.\" One of 19 is 5 percent. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Tyler - Branford, CT\n                                                  \n                                                  ",
    "In his 1987 reminiscence \"When We Was Fab,\" it was clear that the taxation of long ago was still on George Harrison's mind, as he sang, \"Income tax was all we had.\"",
    "In 2002, H&R Block used this in commercials for their tax preparation service. The ads aired shortly after Harrison died."
  ],
  "lyrics": "Let me tell you how it will be\nThere's one for you, nineteen for me\n'Cause I'm the taxman, yeah, I'm the taxman\n \nShould five per cent appear too small\nBe thankful I don't take it all\n'Cause I'm the taxman, yeah I'm the taxman\n \nIf you drive a car, I'll tax the street,\nIf you try to sit, I'll tax your seat.\nIf you get too cold I'll tax the heat,\nIf you take a walk, I'll tax your feet.\n \nDon't ask me what I want it for\nIf you don't want to pay some more\n'Cause I'm the taxman, yeah, I'm the taxman\n \nNow my advice for those who die\nDeclare the pennies on your eyes\n'Cause I'm the taxman, yeah, I'm the taxman\nAnd you're working for no one but me.\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-101.jpg",
    "facts": "George Harrison wrote \"Taxman\" in 1966, when he realized that 98% of his earnings were gone in taxes. \"I will never be a millionaire\", he said.In the chorus line you can hear \"Taxman, Mr. Wilson (Prime Minister, in the picture), taxman, Mr. Heath\" (Leader of the Conservative Party by then)."
  }
}