{
  "Artist": "The Beatles",
  "Album": "A Hard Day's Night",
  "Title": "Tell Me Why",
  "URL": "https://www.songfacts.com/facts/the-beatles/tell-me-why",
  "Confidence": 1.0,
  "youtube-id": "FV_PGs0m34U",
  "facts": [
    "John Lennon, whose parents separated when he was 3 years old, has said that the lyrics were about children whose parents split up. Apparently, he didn't put a great deal of effort into the song, staing: \"They needed another upbeat song, and I just knocked it off.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "This was performed in The Beatles movie A Hard Day's Night. It was The Beatles first movie, and the group was not yet popular in America when the deal was signed to make it. Before filming began, The Beatles became huge and the movie did very well.",
    "John and Paul sang lead vocals, but Lennon was double-tracked to create a 3 part harmony.",
    "This was recorded on Thursday, February 27, 1964. Take 8 was used. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ben - Cheverly, MD\n                                                  \n                                                  "
  ],
  "lyrics": "Tell me why you cried, and why you lied to me\nTell me why you cried, and why you lied to me\n\nWell, I gave you everything I had\nBut you left me sitting on my own\nDid you have to treat me oh, so bad?\nAll I do is hang my head and moan\n\nTell me why you cried, and why you lied to me\nTell me why you cried, and why you lied to me\n\nIf there's something I have said or done\nTell me what and I'll apologize\nIf you don't, I really can't go on\nHolding back these tears in my eyes\n\nTell me why you cried, and why you lied to me\nTell me why you cried, and why you lied to me\n\nWell, I beg you on my bended knees\nIf you'll only listen to my pleas\n(Is there anything I can do?)\n'Cause I really can't stand it, I'm so in love with you\n\nTell me why you cried, and why you lied to me\nTell me why you cried, and why you lied to me\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Universal Music Publishing Group, BMG Rights Management, Songtrust Ave, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}