{
  "Artist": "The Beatles",
  "Album": "Magical Mystery Tour",
  "Title": "The Fool On The Hill",
  "URL": "https://www.songfacts.com/facts/the-beatles/the-fool-on-the-hill",
  "Confidence": 1.0,
  "youtube-id": "DGEX_7IqaC4",
  "facts": [
    "Paul McCartney wrote this song. It's about a man who is considered a fool by others, but whose foolish demeanor is actually an indication of wisdom.\nAn event which prompted this song happened when Paul was walking his dog, Martha, on Primrose Hill one morning. As he watched the sun rise, he noticed that Martha was missing. Paul turned around to look for his dog, and there a man stood, who appeared on the hill without making a sound. The gentleman was dressed respectably, in a belted raincoat. Paul knew this man had not been there seconds earlier as he had looked in that direction for Martha. Paul and the stranger exchanged a greeting, and this man then spoke of what a beautiful view it was from the top of this hill that overlooked London. Within a few seconds, Paul looked around again, and the man was gone. He had vanished as he had appeared. A friend of McCartney's, Alistair Taylor, was present with Paul during this strange incident, and wrote of this event in his book, Yesterday.\nBoth Paul and Alistair could not imagine what happened to this man. He had seemed to vanish in thin air. The nearest trees for cover were too far to reach by walking or running in a few seconds, and the crest of the hill was too far as well to reach in that short time. What made the experience even more mysterious, was that just before this man first appeared, Paul and Alistair were speaking to each other of the beauty they observed of the view towards London and the existence of God. Once back home, they spent the morning discussing what had happened, trying to make some sense of it. They both agreed that this was something others were infer occurred as a result of an \"acid trip,\" but they both swore they had not taken or used any drugs. When Paul filmed the sequence for this song in the film, it shows him on a hilltop overlooking the town of Nice. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Gavin - Hampden, MA\n                                                  \n                                                  ",
    "Paul played this for John Lennon while they were writing \"With A Little Help From My Friends.\" John made him write down the words so he wouldn't forget.",
    "This is a very curious song musically as well as lyrically, as it shifts between major and minor keys. Dan Wilson, a songwriter whose credits include Adele's \"Someone Like You\" and Chris Stapleton's \"When The Stars Come Out,\" explained in a Songfacts interview: \"I think that song is musically just incredible. And mysterious. The way it goes from minor to major to minor just kills me every time.\nWhy it isn't a funny kind of silly song in my heart is just a mystery to me, also. The lyrics are like a nursery rhyme. It's so simple and there's nothing to it, yet I find it deeply sad and affecting and almost tragic, like it's some kind of tragedy of human nature being explained or channeled in a super-simple song that toggles from minor to major and back again.\"",
    "This began as a solo composition with Paul McCartney at the piano. Flutes were added last.",
    "This was not a hit for The Beatles, but a 1968 cover version by Sergio Mendes & Brasil '66 went to #6 in the US. In America, this was the highest-charting Beatles cover until 1975, when Elton John took \"Lucy in the Sky With Diamonds\" to #1.",
    "This was used in the Beatles movie Magical Mystery Tour.",
    "The Eurythmics (Annie Lennox and Dave Stewart) reunited to perform this song on the CBS special The Beatles: The Night That Changed America, which aired on February 9, 2014 - exactly 50 years after The Beatles first appeared on the Ed Sullivan Show."
  ],
  "lyrics": "Day after day\nAlone on a hill\nThe man with the foolish grin\nIs keeping perfectly still\nBut nobody wants to know him\nThey can see that he's just a fool\nAnd he never gives an answer\n\nBut the fool on the hill\nSees the sun going down\nAnd the eyes in his head\nSee the world spinning 'round\n\nWell on the way\nHead in a cloud\nThe man of a thousand voices\nTalking perfectly loud\n\nBut nobody ever hears him\nOr the sound he appears to make\nAnd he never seems to notice\n\nBut the fool on the hill\nSees the sun going down\nAnd the eyes in his head\nSee the world spinning 'round\n\nAnd nobody seems to like him\nThey can tell what he wants to do\nAnd he never shows his feelings\n\nBut the fool on the hill\nSees the sun going down\nAnd the eyes in his head\nSee the world spinning 'round, oh oh oh, 'round 'round 'round 'round\n\nHe never listens to them\nHe knows that they're the fools\nThey don't like him\n\nThe fool on the hill\nSees the sun going down\nAnd the eyes in his head\nSee the world spinning 'round\n\nOh, 'round 'round 'round 'round, oh\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}