{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "The End",
  "URL": "https://www.songfacts.com/facts/the-beatles/the-end",
  "Confidence": 1.0,
  "youtube-id": "oV8PSj-hQvw",
  "facts": [
    "The line \"In the end the love you take is equal to the love you make\" is essentially the Beatles closing statement. It is the last lyric on the last album they recorded. Let It Be was the last album they released, but it was recorded earlier.",
    "This starts over the end of \"Carry That Weight,\" and is the last song in a suite at the end of the Abbey Road album.",
    "Lennon, McCartney and Harrison took turns doing guitar solos. If you listen closely, you can hear how the styles change from one to the other. This is the only time in the Beatles' history that they traded riffs. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Matt - Lancaster, PA\n                                                  \n                                                  ",
    "The phrase \"Love You\" is repeated 24 times.",
    "On this song, you can hear the only drum solo Ringo Starr ever performed as a Beatle. He hated solos and had to be persuaded to do it, with McCartney convincing him that the drum fill was necessary as a transition. Ringo later said that he could never re-create the solo if he tried.",
    "This ends with a 30-piece orchestra.",
    "When Paul McCartney was on Saturday Night Live, he did the skit \"Chris Farley's Talk Show,\" in which Chris was really nervous to be talking to a Beatle, and you can see it from his disheveled look, sweat, and stuttering. One funny part is when Chris asks, \"Do you remember when you said 'in the end, the love you take is equal to the love you make?'\" To which Paul responds \"yes\" in such a serious, and slightly irritated, way that you can't help but laugh. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Natasha - Chico, CA\n                                                  \n                                                  ",
    "According to Geoff Emerick who engineered the album, the guitar solos are in this order; Paul, George,and John. Paul wanted to go first and John wanted to go last. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Phil - New Britain, CT\n                                                  \n                                                  "
  ],
  "lyrics": "Oh yeah, all right\nAre you going to be in my dreams\nTonight?\n\nAnd in the end\nThe love you take\nIs equal to the love you make\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}