{
  "Artist": "The Beatles",
  "Album": "Let It Be",
  "Title": "The Long and Winding Road",
  "URL": "https://www.songfacts.com/facts/the-beatles/the-long-and-winding-road",
  "Confidence": 1.0,
  "youtube-id": "fR4HjTH_fTM",
  "facts": [
    "One of the last Beatles songs, Paul McCartney wrote this based on tensions within the band.",
    "The road McCartney is talking about is the B842 which runs down the east coast of Kintyre and on into Campbeltown near his Scottish farmhouse. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Mountlake Terrace, WA\n                                                  \n                                                  ",
    "McCartney: \"I just sat down at my piano in Scotland, started playing and came up with that song, imagining it was going to be done by someone like Ray Charles. I have always found inspiration in the calm beauty of Scotland and again it proved the place where I found inspiration.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The Beatles recorded this in January 1969 as a fairly simple ballad. By 1970, The Beatles were breaking up and Phil Spector was brought in to go through the tapes and produce the album. Spector was known for his \"Wall Of Sound\" recording technique, where he added many instruments and layered the tracks to create a very full sound. On this track, he took out most of The Beatles instruments and added a string section and choir (The Mike Sammes Singers). The result was very different from what the group originally had in mind. \nEven though he wrote this song, Paul McCartney didn't go to the sessions where Spector produced it. When McCartney heard the results, he made it clear that he hated what Spector did to his song, and tried to get the original version, which was mixed by engineer Glyn Johns, on the album. The band was already falling apart, and this caused further turmoil within the group, as Harrison and Lennon both supported Spector. Paul has not changed his stance over the years, and still believes Spector butchered it. Lennon and Harrison felt otherwise, and each had Spector produce their next solo efforts. Lennon said of Spector's work on Let It Be: \"Phil was given the s--ttiest load of badly recorded s--t with a lousy feeling to it, and he made something of it.\"",
    "The Beatles performed this in the movie Let It Be. Both the movie and album were the last The Beatles released. Abbey Road was the last album they recorded.",
    "Paul McCartney offered this song to Tom Jones in 1968 on the condition it be his next single. He had \"Without Love (There is Nothing)\" set for release so he turned down the offer, something he would later regret. Speaking with Media Wales in 2012, Jones explained: \"I saw him (McCartney) in a club called Scotts Of St. James on Jermyn Street in London. I said to him When are you going to write me a song then Paul? He said, aye I will then. Then not long after he sent a song around to my house, which was 'The Long And Winding Road,' but the condition was that I could do it but it had to be my next single.\nPaul wanted it out straight away. At that time I had a song called 'Without Love' that I was going to be releasing. The record company was gearing up towards the release of it. The timing was terrible, but I asked if we could stop everything and I could do 'The Long And Winding Road.' They said it would take a lot of time and it was impractical, so I ended up not doing it. I was kicking myself. I knew it was a strong song.\"\n\"Without Love\" did well for Jones - it reached #5 in the US and #10 in the UK, but didn't have anywhere near the staying power of this Beatles classic. Jones did eventually record a Paul McCartney song, but not until 2012 when Paul wrote \"(I Want To) Go Home,\" which was released on Jones' album Spirit In The Room.",
    "This was the only Beatles song where John Lennon played bass. He was ordinarily their rhythm guitarist. Harrison and Ringo had their parts removed by Phil Spector, so they don't appear on this at all.",
    "Alistair Taylor, the General manager at Apple Records, witnessed Paul McCartney's recording of the original demo version of this at 3 in the morning. He recalls in 1000 UK #1 Hits by Jon Kutner and Spencer Leigh: \"He was picking out a melody and I said 'I like that, it's a fabulous melody,' and he said, 'It's just an idea.' He told the engineer to switch on the tape and he recorded 'The Long And Winding Road' then and there: it was full of la-las as he'd only written a few lines, but it was quite fantastic.\"",
    "McCartney blocked release of the song as a single in the UK, but he could not prevent its release in the US where it topped the charts for two weeks.",
    "This was one of five Beatles songs McCartney played on his 1976 Wings Over America tour.",
    "In 2002 a cover version by Pop Idol winner Will Young and runner-up Gareth Gates topped the UK chart.",
    "In 2003, Apple Records released a new version of the album called Let It Be... Naked, with Spector's production removed. For this song, a previously unreleased take was used when it was remixed. This version is what McCartney had in mind when he wrote the song.",
    "Ringo's drums can be heard both on the Anthology 3 version and Spector's version (Spector's version just has the strings on top of the Anthology 3 version). \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "The Brazilian singer Caetano Veloso begins his song \"It's a long way\" with the lines, \"Woke up this morning singing an old Beatles song.\" A few verses later he says, \"It's a long and winding road.\" The song is in his 1972 British album Transa. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Marcos - Rio de Janeiro, Brazil\n                                                  \n                                                  ",
    "Some of the many artists who covered this song: Tony Bennett, George Benson, Cilla Black, Ray Charles, Cher, Judy Collins, Peter Frampton, Aretha Franklin, Richie Havens, Cissy Houston, Gladys Knight and the Pips, Liberace, The London Symphony Orchestra, Barry Manilow, Mantovani, Johnny Mathis, Bill Medley, George Michael, Olivia Newton-John, Billy Ocean, Stu Phillips, Kenny Rogers, Diana Ross, Kevin Rowland, Sarah Vaughan, Andy Williams and Nancy Wilson. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "In an interview shortly before he became British Prime Minister, after five years of Leader of the Opposition, David Cameron told Q magazine that this is his favorite Paul McCartney song. He explained; \"It has a wonderful melody and emotion and pretty much sums up the life of the Leader of the Opposition.\"",
    "This became The Beatles 20th and last US #1 song on June 13, 1970."
  ],
  "lyrics": "The long and winding road\nThat leads to your door\nWill never disappear\nI've seen that road before\nIt always leads me here\nLead me to you door\n\nThe wild and windy night\nThat the rain washed away\nHas left a pool of tears\nCrying for the day\nWhy leave me standing here?\nLet me know the way\n\nMany times I've been alone\nAnd many times I've cried\nAnyway you'll never know\nThe many ways I've tried\n\nAnd still they lead me back\nTo the long winding road\nYou left me standing here\nA long long time ago\nDon't leave me waiting here\nLead me to your door\n\nBut still they lead me back\nTo the long winding road\nYou left me standing here\nA long long time ago\nDon't keep me waiting here\nLead me to your door\n\nYeah, yeah, yeah, yeah\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}