{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "The Continuing Story of Bungalow Bill",
  "URL": "https://www.songfacts.com/facts/the-beatles/the-continuing-story-of-bungalow-bill",
  "Confidence": 1.0,
  "youtube-id": "J39DC9t0I5o",
  "facts": [
    "John Lennon called this quirky tune, \"A sort of teenage social-comment song and a bit of a joke.\"",
    "Lennon wrote this about a guy he met at the Maharishi's camp in India who loved to hunt. The four Beatles went on the retreat to study meditation, but were not impressed with the results.\nThe hunter's name was Richard A. Cooke, and his wife Bronwyn explained in Mojo magazine September 2008 that Richard, \"had asked the Maharishi if it was a sin to kill a tiger. John and George were in the room. Maharishi's response was, 'Life destruction is Life destruction.' Rik has not shot anything since. He became a freelance photographer for National Geographic.\"",
    "Yoko Ono sang the line \"Not when he looked so fierce.\" It was the first female vocal on a Beatles song.",
    "The opening riff that sounds like a flamenco guitar was played on a Mellotron, which is a type of synthesizer.",
    "Why \"bungalow\"? At the ashram where The Beatles were visiting in India, guest stayed in luxury bungalows. The hunter they wrote the song about clearly was not into immersing himself in the culture, but more interested in the comfort of his bungalow.",
    "The Beatles recorded this in an overnight session. Everyone around the studio was invited to sing on the chorus. Ringo's wife Maureen sang harmony.",
    "The correct name of the LP this is on is actually called \"The Beatles.\" It became known as \"The White Album\" because of it's stark white cover. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Chet - Saratoga Springs, NY\n                                                  \n                                                  "
  ],
  "lyrics": "Hey, Bungalow Bill\nWhat did you kill\nBungalow Bill?\n\nHey, Bungalow Bill\nWhat did you kill\nBungalow Bill?\n\nHe went out hunting with his elephant and gun\nIn case of accidents he always took his mom\nHe's the all-American bullet-headed Saxon mother's son\n\nAll the children sing\nHey, Bungalow Bill\nWhat did you kill\nBungalow Bill?\n\nHey, Bungalow Bill\nWhat did you kill\nBungalow Bill?\n\nDeep in the jungle where the mighty tiger lies\nBill and his elephants were taken by surprise\nSo Captain Marvel zapped him right between the eyes\n\nAll the children sing\nHey, Bungalow Bill\nWhat did you kill\nBungalow Bill?\n\nHey, Bungalow Bill\nWhat did you kill\nBungalow Bill?\n\nThe children asked him if to kill was not a sin\n\"Not when he looked so fierce\", his mommy butted in\n\"If looks could kill, it would have been us instead of him\".\n\nAll the children sing\nHey, Bungalow Bill\nWhat did you kill\nBungalow Bill?\n\nHey, Bungalow Bill\nWhat did you kill\nBungalow Bill?\n\nHey, Bungalow Bill\nWhat did you kill\nBungalow Bill?\n\nHey, Bungalow Bill\nWhat did you kill\nBungalow Bill?\n\nHey, Bungalow Bill\nWhat did you kill\nBungalow Bill?\n                                                  \n                                                  Writer/s: JOHN LENNON, PAUL MCCARTNEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}