{
  "Artist": "The Beatles",
  "Album": "Help!",
  "Title": "The Night Before",
  "URL": "https://www.songfacts.com/facts/the-beatles/the-night-before",
  "Confidence": 1.0,
  "youtube-id": "7tD40D7jk-Q",
  "facts": [
    "One of the lesser-known Beatles songs, many fans consider it one of their more underrated pieces. It's a light Pop song about relationship troubles, featuring John Lennon and George Harrison's harmonies backing up Paul McCartney's lead vocals. McCartney wrote the song. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n auds - aberdeenshire, Scotland\n                                                  \n                                                  ",
    "The Beatles performed this on the Salisbury Plain in their second film, Help!.",
    "John Lennon played a Hohner Pianet electric piano on this track, which he can be seen playing in the movie.",
    "The Country music band Restless Heart recorded this on their 2004 album Still Restless. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Maya - Richmond, BC, for above 3\n                                                  \n                                                  "
  ],
  "lyrics": "We said our goodbyes, ah, the night before\nLove was in your eyes, ah, the night before\nNow today I find you have changed your mind\nTreat me like you did the night before\n\nWere you telling lies, ah, the night before?\nWas I so unwise, ah, the night before?\nWhen I held you near you were so sincere\nTreat me like you did the night before\n\nLast night is a night I will remember you by\nWhen I think of things we did it makes me want to cry\n\nWe said our goodbye, ah, the night before\nLove was in your eyes, ah, the night before\nNow today I find you have changed your mind\nTreat me like you did the night before\n\nWhen I held you near you were so sincere\nTreat me like you did the night before\n\nLast night is a night I will remember you by\nWhen I think of things we did, it makes me want to cry\n\nWere you telling lies, ah, the night before?\nWas I so unwise, ah, the night before?\nWhen I held you near you were so sincere\nTreat me like you did the night before\nLike the night before\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}