{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "The Word",
  "URL": "https://www.songfacts.com/facts/the-beatles/the-word",
  "Confidence": 1.0,
  "youtube-id": "x9kmeGIdEow",
  "facts": [
    "This is another brilliant musical innovation from the Rubber Soul album, the first point at which The Beatles shrugged off the \"mop tops\" image and went for bolder artistic horizons. \"The Word\" sounds almost like evangelizing; as opposed to a standard boy-girl love song, the lyrics here embrace love as more of a concept, the way the Flower Power movement was thinking about it.\nThe lyrics of \"The Word\" also mark an important point at which The Beatles began to realize that they were, in fact, spokespeople for a new generation. Their songs started packing a stronger message, bridging their way to the future when John and George would make their lyrics more political.",
    "Lead vocals on this song were shared by John Lennon, Paul McCartney and George Harrison. Beatles producer George Martin played the harmonium, an organ-like keyboard instrument.",
    "Yoko Ono gave the sheet music of this song as a gift to the composer John Cage, who later published it in his book Notations. Ono studied under Cage, even sharing the occasional stage with him, before she met John Lennon.",
    "Out of all the zillions of times that music fans claim that something was composed on drugs, this is one of the rare times when a performer actually states that they did drugs while creating it. Paul McCartney reported in interviews that they'd blazed some reefer before setting down to do the lyrics, and reports that far from enhancing their ability, it actually got in the way.",
    "In 2002, Joan Jett covered this for the album, It's All About Eve (Music For The Cure), a charity compilation to support breast cancer research. It was produced by Rob Stevens, who had worked with John Lennon.",
    "Rubber Soul is often cited as the first album issued without the artist's name on its cover, but that honor really goes to Elvis Presley for his 1959 album For LP Fans Only. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "Say the word and you'll be free\nSay the word and be like me\nSay the word I'm thinking of\nHave you heard the word is love?\n\nIt's so fine, it's sunshine\nIt's the word, love\n\nIn the beginning I misunderstood\nBut now I've got it, the word is good\n\nSpread the word and you'll be free\nSpread the word and be like me\nSpread the word I'm thinking of\nHave you heard the word is love?\n\nIt's so fine, it's sunshine\nIt's the word, love\n\nEvery where I go I hear it said\nIn the good and bad books that I have read\n\nSay the word and you'll be free\nSay the word and be like me\nSay the word I'm thinking of\nHave you heard the word is love?\n\nIt's so fine, it's sunshine\nIt's the word, love\n\nNow that I know what I feel must be right\nI'm here to show everybody the light\n\nGive the word a chance to say\nThat the word is just the way\nIt's the word I'm thinking of\nAnd the only word is love\n\nIt's so fine, it's sunshine\nIt's the word, love\n\nSay the word love\nSay the word love\nSay the word love\nSay the word love\n                                                  \n                                                  Writer/s: John Winston Lennon, Paul James McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, O/B/O CAPASSO, Songtrust Ave\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}