{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "Think For Yourself",
  "URL": "https://www.songfacts.com/facts/the-beatles/think-for-yourself",
  "Confidence": 1.0,
  "youtube-id": "vtx5NTxebJk",
  "facts": [
    "Written by George Harrison, this was one of his first songs included on a Beatles album. He took on more of a songwriting role in his later years with The Beatles and as a solo artist.",
    "This song can be a shock the first time you hear it. It takes the typical \"silly love songs\" trope characteristic of The Beatles at the time and stands it right on its nose, by being an actual breakup song. And a dark and sour one at that! Paul McCartney played his bass through a distortion box to get a fuzz effect that dominates the song, snarling like an angry dog. The lyrics are saturated with negative words: \"misery,\" \"lies,\" \"ruins.\" The downbeat tune sounds like the end of the world is coming, almost over-dramatic.",
    "The album Rubber Soul marks the point at which The Beatles starting breaking out of their \"Fab Four\" image and started growing artistically. Critics went nuts over it. \"Think For Yourself\" is an excellent example, seeing George Harrison finally come into his own as a songwriter and Paul McCartney experimenting with the fuzz bass. Even Ringo playing the maracas and John Lennon lending that folk-rock edge with the tambourine.\nProducer George Martin was also developing artistically, experimenting with an eye towards making the album sound good on either a stereo or monaural player. So Harrison's vocals on \"Think For Yourself\" is double-tracked, then split between the right and left channels.",
    "Note the slight wobble in the group's harmonics - for instance, in the word 'time' on the lyric \"you've got time to rectify all the things that you should.\" It comes in just a little higher, sounding slightly more strained or sharper. This might be partly a deliberate effect, but the various vocal quirks on Rubber Soul also are an effect of the rushed recording to get the album in the can by Christmas. Still, these small imperfections also give the whole album a warmer, more natural feeling.",
    "In 1968, this was included in The Beatles movie Yellow Submarine."
  ],
  "lyrics": "I've got a word or two\nTo say about the things that you do\nYou're telling all those lies\nAbout the good things that we can have\nIf we close our eyes\n\nDo what you want to do\nAnd go where you're going to\nThink for yourself\n'Cause I won't be there with you\n\nI left you far behind\nThe ruins of the life that you had in mind\nAnd though you still can't see\nI know your mind's made up\nYou're gonna cause more misery\n\nDo what you want to do\nAnd go where you're going to\nThink for yourself\n'Cause I won't be there with you\n\nAlthough your mind's opaque\nTry thinking more if just for your own sake\nThe future still looks good\nAnd you've got time to rectify\nAll the things that you should\n\nDo what you want to do\nAnd go where you're going to\nThink for yourself\n'Cause I won't be there with you\n\nDo what you want to do\nAnd go where you're going to\nThink for yourself\n'Cause I won't be there with you\nThink for yourself\n'Cause I won't be there with you\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}