{
  "Artist": "The Beatles",
  "Album": "A Hard Day's Night",
  "Title": "Things We Said Today",
  "URL": "https://www.songfacts.com/facts/the-beatles/things-we-said-today",
  "Confidence": 1.0,
  "youtube-id": "LFD3GT387uI",
  "facts": [
    "Paul McCartney wrote this while he was on vacation in The Bahamas and away from his girlfriend. Along with McCartney on the yacht voyage were Ringo Starr and his girlfriend and future wife Maureen. McCartney told interviewer Barry Miles: \"I got away from the main party but it was a bit queasy downstairs; you could smell the oil and the boat was rocking a bit and I'm not the best sailor in the world, so I wrote a little bit of it downstairs and then the rest of it on the back deck where you couldn't smell the engine.\" Kind of accounts for the dour mood if you're seasick.",
    "\"Things We Said Today\" was recorded at the legendary Abbey Road Studios, home to The Beatles for most of their career together and given its tribute in the Abbey Road album. A Hard Day's Night was the first Beatles studio album recorded at Abbey. Abbey Road started out as a nine-bedroom townhouse built in 1930, before being converted into apartments. Gramophone bought the property in 1930, and converted it into a studio. The first European rock 'n' roll song to be recorded at Abbey Road was Cliff Richards' \"Move It,\" released 1958.",
    "Maureen McGovern recorded this and \"For No One\" as a 2-song medley for her 1992 album Baby I'm Yours. Other acts to cover this song include Dick Rivers, Mary McCaslin, Jackie DeShannon, Dwight Yoakam, and one pastiche version by Beatles-parody act The Rutles.",
    "In the UK, this song was used as the B-side of the UK single release of \"A Hard Day's Night,\" which was a far more up-tempo and rollicking song.",
    "McCartney's vocal was double-tracked to make it stand out."
  ],
  "lyrics": "You say you will love me\nIf I have to go\nYou'll be thinking of me\nSomehow I will know\n\nSomeday when I'm lonely\nWishing you weren't so far away\nThen I will remember\nThings we said today\n\nYou say you'll be mine, girl\n'Til the end of time\nThese days such a kind girl\nSeems so hard to find\n\nSomeday when we're dreaming\nDeep in love, not a lot to say\nThen we will remember\nThe things we said today\n\nMe, I'm just the lucky kind\nLove to hear you say that love is luck\nAnd, though we may be blind\nLove is here to stay\nAnd that's enough\nTo make you mine, girl\nBe the only one\nLove me all the time, girl\nWe'll go on and on\n\nSomeday when we're dreaming\nDeep in love, not a lot to say\nThen we will remember\nThings we said today\n\nMe, I'm just the lucky kind\nLove to hear you say that love is luck\nAnd, though we may be blind\nLove is here to stay\nAnd that's enough\nTo make you mine, girl\nBe the only one\nLove me all the time, girl\nWe'll go on and on\n\nSomeday when we're dreaming\nDeep in love, not a lot to say\nThen we will remember\nThe things we said today\n                                                  \n                                                  Writer/s: John Winston Lennon, Paul James McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}