{
  "Artist": "The Beatles",
  "Album": "Help!",
  "Title": "Ticket To Ride",
  "URL": "https://www.songfacts.com/facts/the-beatles/ticket-to-ride",
  "Confidence": 1.0,
  "youtube-id": "SyNt5zm3U_M",
  "facts": [
    "According to A Hard Day's Write by Steve Turner, many Americans concluded the \"ticket\" was from British Railways, and \"ride\" was the town of Ryde on the Isle of Wight. McCartney confessed to his biographer Barry Miles that they were partly right. Paul had a cousin who ran a bar in Ryde and he and John had visited them there. Paul later mentioned that although the song was primarily about a girl riding out of the life of the narrator, they were conscious of the potential for a double meaning.",
    "Don Short, who traveled with the Beatles in the '60s, recalled that John coined the phrase \"Ticket to Ride\" for another meaning: The girls who worked the streets in Hamburg had to have a clean bill of health and the authorities would give them a card saying they were clean. Don later said that although he specifically recalls John telling him that, John could have been joking - you had to be careful with him like that. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ant - Belleville, Canada, for above 2\n                                                  \n                                                  ",
    "John Lennon: \"That was one of the earliest heavy-metal records made.\"",
    "The brief but recognizable guitar solo was played by Paul McCartney, who was The Beatles bass player.",
    "This was used in the Beatles movie Help! in the scene where The Beatles ski... poorly. Copies of the original singer released on Capitol Records say: \"From The United Artists Release 'Eight Arms To Hold You',\" which was the original working title of Help! \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "This was the first Beatles song over 3-minutes long, which started a trend to longer songs. \"You Won't See Me\" from Rubber Soul was the next 3-minute song. Yesterday And Today and Revolver each had one, and Sgt. Pepper had four, including two over 5 minutes.\nLonger songs continued over the rest of their albums. Their longest was \"I Want You (She's So Heavy),\" followed by \"Hey Jude .\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dwight Rounds, author of The Year The Music Died, 1964-1972\n                                                  \n                                                  ",
    "Ringo came up with a distinctive staccato drum pattern for this song which he talked about quite often, sometimes mentioning that he's a left-handed drummer trying to play right-handed.\nAccording to the renown stickman Carl Palmer of Emerson, Lake & Palmer fame, Ringo's work on this track is stellar. \"One of the most exciting, rhythmical patterns and parts and songs that I ever heard, which I thought was really big-time and had it all going is a track by The Beatles called 'Ticket To Ride,'\" said Palmer. \"The drum part on that I always thought was exceptional.\"",
    "The Beatles taped a performance of this song that was broadcast on an episode of Ed Sullivan Show that aired September 12, 1965 (the last Ed Sullivan show broadcast in black and white). The Beatles recorded it prior to their Shea Stadium concert that took place August 15.",
    "The Carpenters covered this in 1969 with the gender reversed to suit lead vocalist Karen Carpenter (\"he's got a ticket to ride...\" Their mellow version was released as the duo's first single and included on their first album, which was also called Ticket To Ride. Their rendition didn't chart, but made its way onto plenty of light rock playlists.",
    "The Beatles were one of the first groups to make music videos, which were done so they could promote their songs without showing up at TV stations. They made one for \"Ticket To Ride\" in a shoot where they did four other songs as well. All of the footage was shot in the studio; this one saw the band performing in front of oversized tickets for trains and busses.",
    "In Stephen King's 1977 novel The Shining, a supernatural Big Band ensemble plays a swing version of this at The Overlook Hotel."
  ],
  "lyrics": "I think I'm gonna be sad\nI think it's today, yeah\nThe girl that's driving me mad\nIs going away\n\nShe's got a ticket to ride\nShe's got a ticket to ride\nShe's got a ticket to ride\nBut she don't care\n\nShe said that living with me\nIs bringing her down yeah\nFor she would never be free\nWhen I was around\n\nShe's got a ticket to ride\nShe's got a ticket to ride\nShe's got a ticket to ride\nBut she don't care\n\nI don't know why she's ridin' so high\nShe ought to think twice\nShe ought to do right by me\nBefore she gets to saying goodbye\nShe ought to think twice,\nShe ought to do right by me\nI think I'm gonna be sad\nI think it's today yeah\nThe girl that's driving me mad\nIs going away, yeah\n\nShe's got a ticket to ride\nShe's got a ticket to ride\nShe's got a ticket to ride\nBut she don't care\n\nI don't know why she's ridin' so high\nShe ought to think twice\nShe ought to do right by me\nBefore she gets to saying goodbye\nShe ought to think twice\nShe ought to do right by me\nShe said that living with me\nIs bringing her down, yeah\nFor she would never be free\nWhen I was around\n\nAh, she's got a ticket to ride\nShe's got a ticket to ride\nShe's got a ticket to ride\nBut she don't care\n\nMy baby don't care, my baby don't care\nMy baby don't care, my baby don't care\nMy baby don't care, my baby don't care\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd., DistroKid\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}