{
  "Artist": "The Beatles",
  "Album": "With the Beatles",
  "Title": "Till There Was You",
  "URL": "https://www.songfacts.com/facts/the-beatles/till-there-was-you",
  "Confidence": 1.0,
  "youtube-id": "JN36SzacyTI",
  "facts": [
    "This was written in 1957 for the Broadway musical The Music Man. It was written by songwriter Meredith Willson, who also wrote \"76 Trombones\" for the same musical as well as the seasonal favorite \"It's Beginning To Look A Lot Like Christmas.\"",
    "Paul McCartney loved show tunes and wanted to cover this. His favorite version was Peggy Lee's.",
    "The Beatles played this song, along with \"She Loves You\" and \"Twist And Shout,\" at the Royal Command Performance of 1963. Paul credited it to their \"Favorite American group, Sophie Tucker.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n don - rapid city, SD\n                                                  \n                                                  ",
    "The Beatles performed this on their first Ed Sullivan Show appearance, February 9, 1964. This was a huge event, as Beatlemania had just come to America. This was the only song they played that night that was not one of their hits - they put it in to appeal to the older audience that was tuned in. As they played, the camera zoomed in on each Beatle and superimposed their first name. When it got to Lennon, it read, \"Sorry girls, he's married.\"",
    "This was also performed during the Beatles appearance on the Royal Variety Show on November 4, 1963. It was probably also appealing to the older audience and it provided a break between the up-tempo numbers, \"She Loves You\" and \"Twist and Shout.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  "
  ],
  "lyrics": "There were bells on a hill\nBut I never heard them ringing\nNo, I never heard them at all\n'Til there was you\n\nThere were birds in the sky\nBut I never saw them winging\nNo, I never saw them at all\n'Til there was you\n\nThen there was music and wonderful roses\nThey tell me in sweet fragrant meadows\nOf dawn and dew\n\nThere was love all around\nBut I never heard it singing\nNo, I never heard it at all\n'Til there was you\n\nThen there was music and wonderful roses\nThey tell me in sweet fragrant meadows\nOf dawn and dew\n\nThere was love all around\nBut I never heard it singing\nNo, I never heard it at all\n'Til there was you\n'Til there was you\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}