{
  "Artist": "The Beatles",
  "Album": "Revolver",
  "Title": "Tomorrow Never Knows",
  "URL": "https://www.songfacts.com/facts/the-beatles/tomorrow-never-knows",
  "Confidence": 1.0,
  "youtube-id": "pHNbHn3i9S4",
  "facts": [
    "Like \"A Hard Day's Night,\" the title came from an expression Ringo Starr used. The proper idiom is \"tomorrow never comes,\" meaning that when tomorrow arrived, it would become today. Ringo's variation of the phrase took the edge off the heavy philosophical lyrics. Working titles for the song before Ringo gave them inspiration were \"Mark I\" and \"The Void.\"",
    "John Lennon wrote this, and described it as \"my first psychedelic song.\" It was inspired by Timothy Leary and Richard Alpert's book The Psychedelic Experience: A Manual Based On The Tibetan Book Of The Dead, which Lennon discovered at Indica Books and Gallery (inspiration for \"Paperback Writer\").\nThe book is a reinterpretation of the Tibetan Book of the Dead and a guide to understanding it through psychedelic drugs. Lennon would read it while tripping on LSD, and according to his biographer Albert Goldman, he recorded himself reading from the book, played it back while tripping on LSD, and wrote the song.\nThe most overt reference to the book is the line:\nTurn off your mind\nRelax and float downstream\nIt is not dying\nThe book states: \"Whenever in doubt, turn off your mind, relax, float downstream.\"",
    "To accompany the psychedelic imagery in Lennon's lyric, each Beatle created strange sounds which were mixed in throughout the recording, often backward and in different speeds. Their producer, George Martin, was older and more experienced, but he allowed the group to experiment in the studio as much as they pleased.",
    "The night before they recorded this song, Paul McCartney created 16 tape loops of guitar sounds and odd vocals that he brought in to the studio to create some of the effects. Several people remember standing around the room holding pencils for the tape to loop around and back into the recording machine as the various sound effects and instrumentation were faded in and out.",
    "The vocals were forced through a Leslie (revolving) speaker. Lennon desired the effect that the listener could hear the words but not hear him, like a group of Tibetan monks chanting on a mountain top.",
    "John Lennon used only one chord in this whole song, which creates a hypnotic feeling. For his vocals, he asked producer George Martin to make him sound like the Dali Lama.",
    "Drugs influenced the creation of this song, but the Beatles recorded sober. \"We would have the experiences and then bring that into the music later,\" Ringo Starr explained.",
    "George Harrison played a droning Indian instrument called a tambura on this track, which added an ethereal feel to the soundscape.",
    "The musical break that comes in about a minute into this song consists mostly of guitars that were heavily processed. This wild passage makes use of just about every studio trick at their disposal, including passing from one channel to the other. Those listening in mono (often in cars) didn't get the full experience.",
    "This was the first track recorded for the Revolver album, but the last one on the tracklist.",
    "On May 6, 2012, this song was featured in an episode of the popular American TV series Mad Men. The episode was set in 1966, and part of the plot was the ad agency in the show helping a client capitalize on Beatlemania. This was a big deal, since Beatles songs are very rarely licensed for TV shows - at least in their original versions. Cover versions and performances (think American Idol) show up from time to time, since those just have to be approved by Sony/ATV, which owns the publishing rights. Getting permission to use an actual Beatles recording requires permission from Apple Corp, which is controlled by The Beatles and their heirs.\nThe Wall Street Journal reported the payment for the song at $250,000, and that Mad Men creator Matthew Weiner had to reveal to Apple exactly how the song would be used, which was a big deal since he is very secretive about scripts. In the episode, the main character Don Draper has trouble adapting to changing musical times. He plays this song to see what all the fuss is about, and after a character-developing montage while the song is playing, he switches it off. The song then comes back to play over the closing credits.",
    "Phil Collins covered this on his debut solo album, Face Value, in 1981, using synthesizers to create many of the unusual sounds. Like The Beatles did on Revolver, Collins used it to close the album. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Our Lady Peace remade this song for the soundtrack to the movie The Craft. It's played during the opening credits. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Patrick - Bremen, GA\n                                                  \n                                                  ",
    "Oasis pays tribute to this song in \"Morning Glory\" with the line:\nWalking to the sound of my favorite tune\nTomorrow never knows what it doesn't know too soon\nThe Beatles were a huge influence on Oasis.",
    "This song is featured on the 2006 Beatles album Love (a soundtrack to the Cirque du Soleil show based on their music) remixed with \"Within You Without You.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ryan - London, England\n                                                  \n                                                  "
  ],
  "lyrics": "Turn off your mind relax and float down stream\nIt is not dying, it is not dying\n\nLay down all thoughts, surrender to the void\nIt is shining, it is shining\n\nYet you may see the meaning of within\nIt is being, it is being\n\nLove is all and love is everyone\nIt is knowing, it is knowing\n\nAnd ignorance and hate mourn the dead\nIt is believing, it is believing\n\nBut listen to the colour of your dreams\nIt is not leaving, it is not leaving\n\nSo play the game \"Existence\" to the end\nOf the beginning, of the beginning\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}