{
  "Artist": "The Beatles",
  "Album": "Please Please Me",
  "Title": "Twist And Shout",
  "URL": "https://www.songfacts.com/facts/the-beatles/twist-and-shout",
  "Confidence": 1.0,
  "youtube-id": "b-VAxGJdJeQ",
  "facts": [
    "A Philadelphia R&B group called The Top Notes originally recorded this in 1961. It was a hit for The Isley Brothers in 1962, which is the version The Beatles emulated. Engineer Norman Smith explained how The Beatles version came about: \"Someone suggested they do 'Twist and Shout' with John taking the lead vocal. But by this time all their throats were sore; it was 12 hours since we had started working. John's, in particular, was almost completely gone so we really had to get it right the first time. The Beatles on the studio floor and us in the control room. John sucked a couple more Zubes (a brand of throat lozenges), had a bit of a gargle with milk and away we went.\"\nThis session took place on February 11, 1963 at EMI Studios in London, which was later re-named Abbey Road Studios. The Beatles did 10 songs that day, nine of which ended up on Please Please Me, their first UK album.",
    "The Beatles used this to end many of their early live performances. It was always a huge hit when they played it in concert, and was chosen as their opening song at their Shea Stadium performance on August 15, 1965 - the first rock concert held in a stadium.",
    "John Lennon admitted that he screamed the lyrics. The Beatles had to sing loud when they did countless live shows in their early years.",
    "You can hear McCartney yell \"hey\" over the very last chord of this song, possibly because it was such a challenge doing the vocals with Lennon suffering from a cold (he was plagued with them his entire life). A lot of people think that the song was recorded once - a one time shot. They actually did two takes, and kept the first one. John was totally knackered, sick as a dog and had stripped off his shirt to let himself sweat it out, but he pulled it off. The next day - February 12, 1963 - The Beatles played two shows, one at the Azena Ballroom in Yorkshire and another at the Astoria Ballroom in Lancashire.",
    "In 1986, this charted again (at #23) when it was used in the movie Ferris Bueller's Day Off.",
    "This was used in the Rodney Dangerfield movie Back To School.",
    "This was the first hit song written by Bert Berns. He went on to write songs for The Drifters, Ben E. King, and Van Morrison. He died of a heart attack in 1967."
  ],
  "lyrics": "Well, shake it up, baby, now\nTwist and shout\nCome on, come on, come, come on, baby, now\nCome on and work it on out\nWell, work it on out, honey\nYou know you look so good\nYou know you got me goin' now\nJust like I know you would\n\nWell, shake it up, baby, now\nTwist and shout\nCome on, come on, come, come on, baby, now\nCome on and work it on out\nYou know you twist, little girl\nYou know you twist so fine\nCome on and twist a little closer now\nAnd let me know that you're mine, woo\n\nAh, ah, ah, ah, wow\nBaby, now\nTwist and shout\nCome on, come on, come, come on, baby, now\nCome on and work it on out\nYou know you twist, little girl\nYou know you twist so fine\nCome on and twist a little closer now\nAnd let me know that you're mine\nWell, shake it, shake it, shake it, baby, now\nWell, shake it, shake it, shake it, baby, now\nWell, shake it, shake it, shake it, baby, now\nAh, ah, ah, ah\n                                                  \n                                                  Writer/s: Bert Russell, Phil Medley \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Warner Chappell Music, Inc., Kobalt Music Publishing Ltd., Songtrust Ave\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}