{
  "Artist": "The Beatles",
  "Album": "Let It Be",
  "Title": "Two of Us",
  "URL": "https://www.songfacts.com/facts/the-beatles/two-of-us",
  "Confidence": 1.0,
  "youtube-id": "YQSr2GY1YX8",
  "facts": [
    "Paul McCartney wrote this about his travel adventures with his wife Linda. When The Beatles were breaking up, it took on new meaning as a gesture of affection from Paul to John Lennon.",
    "Lennon and McCartney sang together on this song, which is something they did a lot in the early years of The Beatles, but not so much later on, when they started writing separately and restricting the lead vocal to whoever wrote the song.",
    "This song is mostly acoustic, with Lennon and McCartney each playing acoustic guitar. George Harrison's electric guitar is there, but low in the mix. There is no bass on the track.",
    "This appears twice in the Beatles documentary movie Let It Be, first as a duet by John and Paul and then with the whole band.",
    "John Lennon did the whistling on the fade-out.",
    "John Lennon often amused himself (and others) in the studio with off-kilter banter before takes, and occasionally parts of these would be included on the tracks. \"Two Of Us\" starts with one such rant, where he says: \"'I Dig A Pygmy' by Charles Hawtry and the Deaf Aids, phase one in which Doris gets her oats.\"",
    "VH1 used the title for a fictional movie in 2000 about Lennon and McCartney getting together in the '70s. This was the first original movie VH1 made. Others they produced include films about Meat Loaf and Def Leppard.",
    "Other notable songs McCartney wrote for/about Linda: \"My Love,\" \"Maybe I'm Amazed,\" \"Calico Skies,\" \"Warm & Beautiful,\" \"Golden Earth Girl,\" \"Some days,\" \"She's My Baby,\" \"Long Haired Lady,\" and \"The Lovely Linda.\""
  ],
  "lyrics": "Two of us riding nowhere\nSpending someone's\nHard earned pay\nTwo of us Sunday driving\nNot arriving\n\nOn our way back home\nWe're on our way home\nWe're on our way home\nWe're going home\n\nTwo of us sending postcards\nWriting letters\nOn my wall\nYou and me burning matches\nLifting latches\n\nOn our way back home\nWe're on our way home\nWe're on our way home\nWe're going home\n\nYou and I have memories\nLonger than the road that stretches out ahead\n\nTwo of us wearing raincoats\nStanding so low\nIn the sun\nYou and me chasing paper\nGetting nowhere\n\nOn our way back home\nWe're on our way home\nWe're on our way home\nWe're going home\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-177.jpg",
    "facts": "They first met at the June 1, 1967 launch party for Sgt. Pepper's Lonely Hearts Club Band and the relationship blossomed over the next two years. Paul and Linda married at a small civil ceremony at Marylebone Registry Office in March 12th. 1969, while he was still a member of The Beatles. No other Beatles attended the ceremony: John and Yoko said they were working on a project and could not attend, George said he was too busy with business and Ringo and wife Maureen said they were busy with \"Domestic matters.\" Paul adopted Linda's daughter, Heather (from her first marriage), and they went on to have three other children (Mary, Stella, and James) together. They remained married and devoted to each other until Linda's death to breast cancer April 17th, 1998. The couple reportedly spent less than a week apart during their entire marriage."
  }
}