{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "Wait",
  "URL": "https://www.songfacts.com/facts/the-beatles/wait",
  "Confidence": 1.0,
  "youtube-id": "pkCuJ-n63Js",
  "facts": [
    "The Beatles recorded this during the last session for the album Help. They added bits and pieces in the last Rubber Soul session to create one more song for the album.\nIt isn't quite clear why this song was left off the Help! album, except that it's much more folksy and fits in better with Rubber Soul anyway. Help! ended with \"Dizzy Miss Lizzy,\" a much more rousing and rockabilly number which gave the album the kind of ending the band felt it needed.",
    "\"Wait\" was written specifically for the film Help!. Paul McCartney recalls British child actor Brandon de Wilde being present while he was composing it, comparing him to a \"Brat Pack\" actor.",
    "The added percussion (including tambourine and maracas) was added in later to make the song better fit in with the Rubber Soul album.",
    "This is one of those songs of the Beatle canon with discrepancy as to authorship. It's known today to be credited to Lennon and McCarthy, but in his book Many Years from Now, McCartney credits the song entirely to himself, while another music publication of the time credits it entirely to Lennon.",
    "George Harrison puts a tone pedal to his guitar, rendering these unusually mellow sounds to the song and those last strumming notes at the final slow-down in tempo.",
    "The Beatles' tribute group Yellow Matter Custard covered this song.",
    "This is one of the few songs to have John and Paul alternating sole vocal roles. Usually either they sang in harmony, or one or the other took lead vocal duties. It's just one more thing that makes \"Wait\" unique."
  ],
  "lyrics": "It's been a long time\nNow I'm coming back home\nI've been away now\nOh how I've been alone\nWait till I come back to your side\nWe'll forget the tears we've cried\n\nBut if your heart breaks\nDon't wait, turn me away\nAnd if your heart's strong\nHold on, I won't delay\nWait till I come back to your side\nWe'll forget the tears we've cried\n\nI feel as though\nYou ought to know\nThat I've been good\nAs good as I can be\nAnd if you do\nI'll trust in you\nAnd know that you\nWill wait for me\n\nIt's been a long time\nNow I'm coming back home\nI've been away now\nOh how I've been alone\nWait till I come back to your side\nWe'll forget the tears we've cried\n\nI feel as though\nYou ought to know\nThat I've been good\nAs good as I can be\nAnd if you do\nI'll trust in you\nAnd know that you\nWill wait for me\n\nBut if your heart breaks\nDon't wait, turn me away\nAnd if your heart's strong\nHold on, I won't delay\nWait till I come back to your side\nWe'll forget the tears we've cried\n\nIt's been a long time\nNow I'm coming back home\nI've been away now\nOh, how I've been alone\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}