{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "While My Guitar Gently Weeps",
  "URL": "https://www.songfacts.com/facts/the-beatles/while-my-guitar-gently-weeps",
  "Confidence": 1.0,
  "youtube-id": "YEMEAxlYL04",
  "facts": [
    "He wasn't credited on the album's liner notes or anywhere else, but Eric Clapton played lead guitar on this song. He and George Harrison were good friends, but George had to convince him to come to the studio because Clapton was worried the other Beatles wouldn't want him there. Clapton's presence eased the mood in the studio at a tense time for The Beatles - they were at each other's throats during recording of The White Album, but they all relaxed when Clapton showed up.",
    "Harrison often had to fight to get his songs on the albums. John Lennon and Paul McCartney were not interested in this song at first, but came around when Harrison brought Clapton to the studio.",
    "According to A Hard Day's Write by Steve Turner, Harrison was reading I Ching, the Chinese book of changes, and decided to write a song about the first words he saw, which were \"Gently Weeps.\" This explains the very zen lyrics like \"I look at the floor and I see it needs sweeping.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jonathan - Johnstown, PA\n                                                  \n                                                  ",
    "This was originally recorded as an acoustic ballad with just Harrison on acoustic guitar and Paul McCartney on organ. This version can be found on some bootlegs and on The Beatles Anthology 3. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Stefanie Magura - Rock Hill, SC\n                                                  \n                                                  ",
    "This was the first song Ringo Starr played on after leaving the band in frustration a few weeks earlier. He returned to find flowers on his drums to welcome him back.",
    "Clapton used a Les Paul guitar on this track. Later in his career, he switched to a Fender Stratocaster.",
    "Even though this was not a hit, it is one of the most enduring Beatles songs. It remains popular on classic rock radio.",
    "When George Harrison arranged a trip to India for The Beatles to study Transcendental Meditation, they were joined by their good friend Donovan, a singer-songwriter who had hits with \"Sunshine Superman\" and \"Mellow Yellow.\" They shared a lot of ideas on this trip, many of which influenced The White Album. In a Songfacts interview with Donovan, he said that John Lennon wanted to learn the clawhammer guitar style, while Harrison was interested in Donovan's chord structures. The A minor descents Donovan showed him ended up in \"While My Guitar Gently Weeps.\"",
    "After working on this song, Eric Clapton became good friends with John Lennon and played with him on some of his solo work. When George Harrison threatened to leave The Beatles in 1969, Lennon was ready to replace him with Clapton.",
    "In his solo career, George Harrison played this song more than any other. He toured as a headliner just once, in 1974, and included the song on this setlist. In 1991, he jumped on the Japanese leg of Eric Clapton's tour, and they teamed up to perform the song as an encore for these shows. Harrison and Clapton also played it together in 1971 at the Concert For Bangladesh, which Harrison organized to bring aid to the war-torn region. Clapton was one of the \"special guests\" at the show and gave it lots of additional star power.",
    "Jeff Healy covered this song on his 1990 album Hell To Pay. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jay Fitzgerald - Saskatoon, Canada\n                                                  \n                                                  ",
    "In the Las Vegas show, LOVE, this song is included. In the show they use the Anthology version with a cello added. George Harrison came up with the idea for LOVE, though he died before the show was ever performed. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Breanna - Henderson, NV\n                                                  \n                                                  ",
    "Carlos Santana covered the song on his 2010 album Guitar Heaven. His version features vocals by India.Arie and cello by Yo-Yo Ma. \"When I think of that song,\" Arie told Rolling Stone, \"I always had this vision of George Harrison being at home with his wife and his kids, and going in at five o'clock in the morning and playing his guitar to himself. I imagined that and put a sensual energy on it.\""
  ],
  "lyrics": "I look at you all, see the love there that's sleeping\nWhile my guitar gently weeps\nI look at the floor and I see it needs sweeping\nStill my guitar gently weeps\n\nI don't know why nobody told you\nHow to unfold your love\nI don't know how someone controlled you\nThey bought and sold you\n\nI look at the world and I notice it's turning\nWhile my guitar gently weeps\nWith every mistake we must surely be learning\nStill my guitar gently weeps\n\nI don't know how you were diverted\nYou were perverted too\nI don't know how you were inverted\nNo one alerted you\n\nI look at you all, see the love there that's sleeping\nWhile my guitar gently weeps\nLook at you all\nStill my guitar gently weeps\n                                                  \n                                                  Writer/s: George Harrison \n\n                                                   Publisher: CONCORD MUSIC PUBLISHING LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}