{
  "Artist": "The Beatles",
  "Album": "CD1 - The Beatles",
  "Title": "Why Don't We Do It In The Road",
  "URL": "https://www.songfacts.com/facts/the-beatles/why-dont-we-do-it-in-the-road",
  "Confidence": 1.0,
  "youtube-id": "5AdtR-d2HJQ",
  "facts": [
    "Paul McCartney and Ringo Starr recorded this without the other Beatles. It was one of the first Beatles songs recorded without the whole group present, something they would do more often as their relationships deteriorated.",
    "John Lennon said this was one of Paul's best songs. He may have been joking.",
    "This contains only two lines of lyrics, and they are probably about sexual tension. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Dominic - Pittsburgh, PA\n                                                  \n                                                  ",
    "Apparently, McCartney got the idea for this while he was watching a pair of monkeys conducting business: \"I was up on a flat roof meditating and I'd see a troupe of monkeys walking along and the male just hopped onto her back and gave her one, as they say in the vernacular. Within two or three seconds he hopped off again, and looked around as if to say, 'it wasn't me,' and she looked around as if there had been some kind of mild disturbance but thought, huh, I must have imagined it. And I thought, bloody hell, that puts it all into a cocked hat, that's how simple the act of procreation is, this bloody monkey just hopping on and off. There is an urge, they do it, and it's done with. It's that simple.\" McCartney was in India at the time.",
    "This was a very John Lennon kind of song, John was very upset Paul did not include him in the recording of this. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Mountlake Terrace, WA. U.S.A, for above 2\n                                                  \n                                                  ",
    "The Beatles had stopped touring by the time they released this song, and Paul McCartney didn't play it live until October 8, 2016 when he performed it at the Desert Trip festival with Neil Young."
  ],
  "lyrics": "Why don't we do it in the road?\nWhy don't we do it in the road?\nWhy don't we do it in the road?\nWhy don't we do it in the road?\n\nNo one will be watching us\nWhy don't we do it in the road?\n\nWhy don't we do it in the road?\nWhy don't we do it in the road?\nWhy don't we do it in the road?\nWhy don't we do it in the road?\n\nNo one will be watching us\nWhy don't we do it in the road?\n\nWhy don't we do it in the road?\nWhy don't we do it in the road?\nWhy don't we do it, do it in the road?\nWhy don't we do it in the road?\n\nNo one will be watching us\nWhy don't we do it in the road?\n                                                  \n                                                  Writer/s: JOHN LENNON, PAUL MCCARTNEY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}