{
  "Artist": "The Beatles",
  "Album": "Sgt. Pepper's Lonely Hearts Club Band",
  "Title": "With A Little Help From My Friends",
  "URL": "https://www.songfacts.com/facts/the-beatles/with-a-little-help-from-my-friends",
  "Confidence": 1.0,
  "youtube-id": "0C58ttB2-Qg",
  "facts": [
    "The album was recorded as if Sgt. Pepper was a real band. It opens with the title track, then segues into \"With A Little Help From My Friends.\" Beatles drummer Ringo Starr sang lead, introduced as \"Billy Shears,\" a name chosen because it sounded good and played up the idea that the group was in character.\nThe song was never released as a single, but became one of the group's most enduring tracks. Since it there is no break on the album between the fade of the title track (and \"Billy Shears\" introduction) and the beginning of this song, radio stations were forced to either play the tracks together or play the awkward open.",
    "This was one of the very last songs John Lennon and Paul McCartney sat down and wrote together in a true collaboration. They were at Paul's house messing around on the piano.",
    "The working title was \"Bad Finger Boogie,\" a name Lennon came up with because he had injured his finger. The Beatles got some use out of the name when they signed a group called The Iveys to their label, Apple Records, in 1968 and renamed them Badfinger.",
    "The cheering at the beginning was taken from a Beatles concert at the Hollywood Bowl. The Beatles had stopped touring by the time this was recorded.",
    "This hit #1 on the UK chart three times: first by Joe Cocker in 1968, again by Wet Wet Wet in 1988 and finally by Sam and Mark in 2004. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "John Lennon claimed this was not about drugs, but many people didn't believe him, including US vice president Spiro Agnew, who once told a crowd that this song was a \"Tribute to the power of illegal drugs.\" He said the lines, \"I get by with a little help from my friends, I get high with a little help from my friends,\" \"Is a catchy tune, but until it was pointed out to me, I never realized that the 'friends' were assorted drugs!\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Mountlake Terrace, WA. U.S.A\n                                                  \n                                                  ",
    "The first line was originally \"What would you do if I sang out of tune? Would you stand up and throw tomatoes at me?\" Ringo did not want to sing it, fearing that if they ever did it live he would be pelted with tomatoes.",
    "The Beatles finished recording this the night they shot the cover for the Sgt. Pepper album. This continued the \"Concept\" of the album, but until the reprise of \"Sgt. Pepper's Lonely Hearts Club Band\" at the end, the theme of the fictional band ends with this.",
    "Twelve years after \"Sgt. Pepper's Lonely Hearts Club Band\" and \"With a Little Help from My Friends\" appeared on the Sgt. Pepper album, they were released together as a two-song medley and reached US #71 and UK #63. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jerro - New Alexandria, PA\n                                                  \n                                                  ",
    "When Ringo Starr was inducted into the Rock and Roll Hall of Fame in 2015, he performed this song with many of the evening's participants, including Joan Jett, Miley Cyrus, Dave Grohl, Stevie Wonder and Paul McCartney.",
    "Joe Cocker's 1968 cover was used as the theme song for the '80s/'90s TV series The Wonder Years, starring Fred Savage.",
    "Richie Havens, the first performer at Woodstock, included this song in his set at the festival."
  ],
  "lyrics": "Billy Shears\n\nWhat would you think if I sang out of tune?\nWould you stand up and walk out on me?\nLend me your ears and I'll sing you a song\nAnd I'll try not to sing out of key\n\nOh, I get by with a little help from my friends\nMm, I get high with a little help from my friends\nMm, gonna try with a little help from my friends\n\nWhat do I do when my love is away?\nDoes it worry you to be alone?\nHow do I feel by the end of the day?\nAre you sad because you're on your own?\n\nNo, I get by with a little help from my friends\nMm, get high with a little help from my friends\nMm, gonna try with a little help from my friends\n\nDo you need anybody?\nI need somebody to love\nCould it be anybody?\nI want somebody to love\n\nWould you believe in a love at first sight?\nYes, I'm certain that it happens all the time\nWhat do you see when you turn out the light?\nI can't tell you, but I know it's mine\n\nOh, I get by with a little help from my friends\nMm, get high with a little help from my friends\nOh, I'm gonna try with a little help from my friends\n\nDo you need anybody?\nI just need someone to love\nCould it be anybody?\nI want somebody to love\n\nOh, I get by with a little help from my friends\nMm, gonna try with a little help from my friends\nOh, I get high with a little help from my friends\nYes, I get by with a little help from my friends\nWith a little help from my friends\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}