{
  "Artist": "The Beatles",
  "Album": "Sgt. Pepper's Lonely Hearts Club Band",
  "Title": "Within You Without You",
  "URL": "https://www.songfacts.com/facts/the-beatles/within-you-without-you",
  "Confidence": 1.0,
  "youtube-id": "zEwKmqWtnjM",
  "facts": [
    "George Harrison wrote this song and was the only Beatle to perform on it. The song is about how the answers are inside us, so we have to look within to find them. We can go to the mountaintop searching to find our truths, but that won't do any good if we're not searching within.\nIt's also a reminder of our mortality and our place in the Universe, summarized in the last line: \"Life flows on within you and without you.\"",
    "An outlier on the Sgt. Pepper album, this song features Indian instruments played by Harrison and members of the Asian Music Circle, a collective in England that helped Harrison learn about Indian music. Harrison took an interest in Indian music when he was exposed to it on set in a restaurant scene from the 1965 Beatles move Help!. He bought a sitar that he played on the 1965 Rubber Soul track \"Norwegian Wood (This Bird Has Flown),\" and then came under the tutelage of Ravi Shankar. Harrison used a sitar to write the 1966 Beatles song \"Love You To,\" which was influenced by Indian music but also incorporated guitars and Western forms. \"Within You Without You\" was his first song to fully embrace Indian music and also to explore Eastern religion, which became a lifelong quest. Harrison believed in reincarnation, which helped him accept death in 2001 when he lost his life to cancer.",
    "Harrison wrote this as a 30-minute piece that he trimmed down for the album. Speaking with Timothy White in 1992, he explained how he put the song together: \"That was quite a complicated one at the time because it was done in three sections, and then I edited the three sections together. It had a solo instrumental in a 5/4 kind of tempo, which was very unusual. I suppose Dave Brubeck was the only person who ever played out of 4/4 or 3/4. See, this is the thing: In Western music, basically the tempo goes 4/4 or 3/4, and that's it. In Indian music they have 108 rhythm cycles, and they can even play in things like 7½. [Laughs.] It's quite complex, but I did learn this little piece, one of my exercises that I used to practice, that was in a 5/4 timing. So I did the solo in 'Within You Without You' into a 5/4, just to show how clever I was.\"",
    "Harrison based this song on a piece by Ravi Shankar, who helped teach him the sitar. Harrison wrote his own lyrics and shortened it considerably.",
    "The laughter at the end was Harrison's idea to lighten the mood and follow the theme of the album. Some people thought it indicated that the song was included on Sgt. Pepper as a joke.",
    "This was the only song Harrison wrote that made it onto the Sgt. Pepper's Lonely Hearts Club Band album. He also contributed \"Only A Northern Song\" (recorded in February of 1967 as verified by the Anthology 2 album), but it was left off the album at the last minute. It was initially intended to go on the first side of Sgt. Pepper between \"She's Leaving Home\" and \"Being for the Benefit of Mr. Kite.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Harrison would sometimes quote this song when talking about friends who died, as he believed they were still with us, just not physically. On the TV show Aspel & Company in 1988, he said this about John Lennon:\n\"I think it's unfortunate the way he went out, but it doesn't really matter. He's okay, and life flows on within you and without you.\"\nIn 1989, he said this when speaking to MTV news about Roy Orbison, his bandmate in the Traveling Wilburys who had recently passed on:\n\"We love Roy, and we still do, and he's out there really, his spirit. Life flows on within you and without you, and he's around in his astral body.\"",
    "In 2007, Oasis covered this for the BBC to celebrate the 40th anniversary of Sgt. Pepper's Lonely Hearts Club Band. Other artists to cover the song include Sonic Youth and Patti Smith.",
    "In the 2011 documentary The Material World, Sir George Martin says: \"'Within You Without You' was not a commercial song by any means. But it was very interesting. [George Harrison] had a way of communicating music by the Indian system of kind of a separate language... the rhythms decided by the tabla player.\""
  ],
  "lyrics": "We were talking\nAbout the space between us all\nAnd the people\nWho hide themselves behind a wall of illusion\nNever glimpse the truth\nThen it's far too late when they pass away\n\nWe were talking\nAbout the love we all could share \nWhen we find it\nTo try our best to hold it there, with our love, with our love\nWe could save the world, if they only knew\n\nTry to realize it's all within yourself, no-one else can make you change\nAnd to see you're really only very small\nAnd life flows on within you and without you\n\nWe were talking\nAbout the love that's gone so cold\nAnd the people\nWho gain the world and lose their soul\nThey don't know, they can't see\nAre you one of them?\n\nWhen you've seen beyond yourself then you may find peace of mind is waiting there\nAnd the time will come when you see we're all one\nAnd life flows on within you and without you\n                                                  \n                                                  Writer/s: GEORGE HARRISON \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, BMG Rights Management\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "place": {
    "name": "Rishikesh, India",
    "facts": [
      "The city of Rishikesh, in Northern India, has a vibrant history. Located at the foothills of the Himalayas, it’s often referred to as the \"Gateway\" to the mountains. Most people hadn’t heard of it until George Harrison – the quiet one – led the rest of the Beatles to the city for a long retreat under the guidance and tutelage of Maharishi Mahesh Yogi at his fourteen-acre compound. Built in 1963 to accommodate several dozen people, the bungalows of the International Academy of Meditation were designed to suit Western habits, equipped with heaters, running water, and English-style furniture.",
      "The title",
      "simply means \"enlightened spiritual one\" and Mahesh earned it for the development of what he called Transcendental Deep Meditation. His new movement based solely around this technique swept India and the world by storm in the late 1960s and early 1970s. A fad that swelled similarly to present-day Scientology, this meditation attracted the likes of celebrities on every continent, from dozens of countries.",
      "Mahesh became the spiritual advisor to the Beatles when he met with them in London and invited them to study with him. They followed him back to India in February 1968 – a trip originally slated for October '67, but delayed due to the filming schedule of",
      "– to devote themselves fully to his instruction. A New York",
      "article declared Mahesh the \"Man Who Saved the Beatles\" and attributed his techniques to weaning them off of their heavy LSD use.",
      "Never before, nor since, has any musical artist achieved the success and recognition of the Beatles. The band reinvented the recording industry and created the rock album as its own art form. How could they have done this? Ticket and record sales between 1964 and 1967 bought and paid for Abbey Road Studios – their own private recording space. Without the burden of paying rent just to record their music, the Beatles earned the luxury of time, which led to massive amounts of experimentation with both their writing as well as the production of their music. Masterpieces such as",
      ",",
      ", and",
      "wouldn’t have been possible without all their free time. However, idle hands are the devil’s playground, and like the rest of us, the Beatles found themselves often distracted and struggled to focus on their work.",
      "Following the unprecedented success of",
      ", the Beatles hit the wall with writer’s block. In fact, the block started earlier as they struggled to fill",
      ". John found nominal inspiration from posters and television commercials simply to make his quota. \"",
      "\" and \"",
      "\" – the first two cuts of the",
      "studio sessions – were omitted from the final release due to the record label's insistence they be released as a double-sided 45 rpm. Lennon didn’t want to cheat the fans who already owned them by including them on the album. It was this scenario that allowed Harrison to get his Eastern-influenced song a spot.",
      "Harrison’s fascination with Eastern philosophy and Indian culture grew through his wife at the time, model Patti Boyd, and he began to incorporate sitars and other elements in his writing. While it is true that \"Within You Without You\" was completed prior to the Beatles' encounter with the Maharishi, the song epitomizes that Beatles era and particularly that of Harrison, as it launched him into an entirely new direction.",
      "“I was continually playing Indian [sitar exercises] called",
      ",” Harrison said during a portion of his",
      "interview, “which are the bases of the different Ragas. That's why around this time I couldn't help writing tunes like this, which were based on unusual scales.” \"Within You Without You\" wouldn’t be the Beatles’ first foray into Indian music.",
      "featured two: \"Love You To\" (also by Harrison) and \"Tomorrow Never Knows\" (Lennon). The band also continued to utilize the sitar as an alternative to the overused guitar in many of their songs. Additionally, some of their lyrics even mirrored the Maharishi and his philosophy.",
      "A little more than a month into the retreat, the Beatles and Mahesh had a falling out. It has been speculated the reason for the sudden and angry departure had been at the request of the Maharishi due to their continued alcohol and drug use. Some have claimed the guru’s sexual indiscretions were to blame; Lennon himself commented about the excessive amounts of celebrity and money the Maharishi had - more than any spiritual man should, at any rate. Whatever the reason, Lennon returned to England and never saw Mahesh again. “We believe in medication, but not the Maharishi and his scene,” he later said on",
      ".",
      "Obviously, the time the Beatles spent in Rishikesh had a dramatic and profound influence on their personality and their music. It’s been said that their trip to India may have been \"the most momentous spiritual retreat since Jesus spent those forty days in the wilderness,\" and it’s easy to see why. McCartney composed \"Mother Nature’s Son\" after one of the Maharishi’s lectures. \"Why Don’t We Do It in the Road\" was inspired by a group of monkeys mating in the middle of the main street through the city. Finally, the song \"Sexy Sadie\" – originally titled \"Maharishi\" – tells the story of Lennon’s disillusionment with the man he fully respected, but never quite grew in awe of. “Sexy Sadie [Ma-ha-ri-shi], what have you done? You’ve made a fool of everyone.”",
      "Harrison and Boyd, after leaving Rishikesh, didn’t follow the rest of the Beatles home right away. Instead, they traveled around India, even spending some time with Ravi Shankar – who must have been a big fan of \"Within You Without You\" already, since he and Harrison remained close friends until George’s death in 2001.",
      "~"
    ]
  }
}