{
  "Artist": "The Beatles",
  "Album": "Revolver",
  "Title": "Yellow Submarine",
  "URL": "https://www.songfacts.com/facts/the-beatles/yellow-submarine",
  "Confidence": 1.0,
  "youtube-id": "m2uTFF_3MaA",
  "facts": [
    "Paul McCartney wrote the majority of this song. He explained shortly after it was released in 1966: \"'Yellow Submarine' is very simple but very different. It's a fun song, a children's song. Originally we intended it to be 'Sparky' a children's record. But now it's the idea of a yellow submarine where all the kids went to have fun. I was just going to sleep one night and thinking if we had a children's song, it would be nice to be on a yellow submarine where all your friends are with a band.\"\nPaul purposely used short words in the lyrics because he wanted kids to pick it up early and sing along.",
    "Ringo sang lead, as he did on many of the lighter Beatles songs, including \"Octopus's Garden\" and \"Act Naturally.\" Originally, Ringo had a spoken intro to go with the children's story theme, but this was discarded. Ringo did eventually get his chance to narrate for children: He was voice talent on the UK cartoon Thomas The Tank Engine. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "As with just about every Beatles song, there's a lot that can be read into this one if you look hard enough. One possible interpretation: Once famous, The Beatles were forced to stay in hotel rooms and live under pressure = Submarine. Because they were having a great time it was Yellow (friends are all aboard). Sea of green = money. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mike - Los Angeles, CA\n                                                  \n                                                  ",
    "The sounds of bubbles, water, and other noises were recorded in the studio. The background vocals (and some effects) were done by John, Paul, and George and they had some help on the fadeout chorus by Mal Evans, Neil Aspinall, George Martin, Alf Bicknell (their chauffeur), Geoff Emerick, Brian Jones of The Rolling Stones, Marianne Faithful, Pattie Harrison and a few other staff people that were in the building at the time. The \"bubble\" effects are John blowing into a straw. All of the speaking parts are done by John and Paul.",
    "Some people felt this song had deeper meaning about drugs or war, and it was often sung at protests and other rallies as a symbol of unity. The Beatles insisted there was no subtext, but they were used to people reading too much into their songs. On The White Album, there is a song called \"Glass Onion\" that addresses this issue.",
    "The chorus at the end consists of the studio crew, as well as their friends Mal Evans and Neil Aspinall, producer George Martin, and Pattie Harrison. The famous folk singer Donovan, who was McCartney's friend and neighbor at the time, helped him with uncredited lyrical contributions on this song. He likely also recorded backing vocals in the chorus. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jonathon - Clermont, FL\n                                                  \n                                                  ",
    "According to Steve Turner's book A Hard Day's Write, about a month after the album was released, there were barbiturate capsules that started to be known as \"yellow submarines.\" McCartney denied any comparison to drugs and said the only submarine he knew that you could eat was a sugary sweet he's come across in Greece while on holiday. These had to be dropped in water and were known as \"submarines.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ant - Belleville, Canada\n                                                  \n                                                  ",
    "This is the title song to the 1968 animated movie Yellow Submarine, featuring cartoon avatars of The Beatles. The group had a lot going on at the time, so actors were brought in to voice their lines. In the film, The Beatles try to save Pepperland from the Blue Meanies, who hate music. We won't spoil it by telling you how it ends.",
    "The photographic scenes shown in the movie Yellow Submarine are of well-known locations in England, including Buckingham Palace and Big Ben. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Patrick - Tallapoosa, GA\n                                                  \n                                                  ",
    "The Scottish musician Donovan, a good friend of The Beatles, made a key contribution to this song, coming up with the line \"Sky of blue, sea of green.\"\nAfter he got the idea for the song, Paul McCartney dropped by Donovan's place and asked him for suggestions in hashing out a verse. In our interview with Donovan, he explained: \"He already had those words to the song, but he seemed to have a hole in the song. So I took his words and turned them around for him.\"\nThis line is Donovan's best-known contribution to a Beatles song, as it's the most concrete, but it was simply adding a line; he takes more pride in other Beatles songs he influenced on their shared musical journey. In February 1968, he joined the Beatles on their retreat to India, where he taught McCartney and Lennon the \"clawhammer\" guitar technique, where the picking hand strikes the strings in a downward motion with the back of the nail. McCartney used this technique on \"Blackbird,\" and Lennon used it on \"Dear Prudence.\" He also helped Lennon with another song written in India, \"Julia,\" which John wrote about his mother.",
    "After The Beates recorded this song, Donovan recorded his own \"yellow\" track: \"Mellow Yellow.\" Paul McCartney came by that session and was recorded hollering, which was likely used in the cheering at the end of the song.\nThese colorful songs had similar success in America: \"Yellow Submarine\" hit #2 in September 1966, and in December, \"Mellow Yellow\" reached that same chart position.",
    "After the song and movie were released, about 40 different \"submarine churches\" were formed in America. These groups were based on Protestant and Roman Catholic traditions, but with a counterculture ethos that encouraged protest and freedom. They also engaged in some monkeyshines, like sending a couple into a hotel lobby with a donkey (à la Joseph and Mary) to ask for a room. They petered out in the early '70s, but were so popular at one point that the New York Times reported on them.",
    "This was used as the B-side of \"Eleanor Rigby.\"",
    "In 2004, McCartney voiced over three animated short films for a project called The Music And Animation Collection. He explained that it was much more fun voicing other characters, and he had no interest in using his own voice on the Yellow Submarine movie.",
    "According to Q magazine, this song originally featured a medieval-style poem as an intro. Written by Lennon and narrated by Starr, the poem was inspired by a 1960 charity walk from the south west tip of England to the northern coast of Scotland by pioneering health enthusiast Dr. Barbara Moore.",
    "Spanish premier division soccer team Villareal is nicknamed \"Los Submarinos Amarillos\" (Spanish for \"Yellow Submarine\") because of their yellow uniforms. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n mark - Rotterdam, Netherlands\n                                                  \n                                                  ",
    "Fans of the \"Yellow Submarine\" universe will enjoy the animated short Cat Stevens made in 1972 to accompany his song \"Moonshadow.\""
  ],
  "lyrics": "In the town where I was born\nLived a man who sailed to sea\nAnd he told us of his life\nIn the land of submarines\nSo we sailed up to the sun\nTill we found a sea of green\nAnd we lived beneath the waves\nIn our yellow submarine\n\nWe all live in a yellow submarine\nYellow submarine, yellow submarine\nWe all live in a yellow submarine\nYellow submarine, yellow submarine\n\nAnd our friends are all aboard\nMany more of them live next door\nAnd the band begins to play\n\nWe all live in a yellow submarine\nYellow submarine, yellow submarine\nWe all live in a yellow submarine\nYellow submarine, yellow submarine\n\n(Full speed ahead Mr. Boatswain, full speed ahead\nFull speed ahead it is, Sergeant.\nCut the cable, drop the cable\nAye, Sir, aye\nCaptain, captain)\n\nAs we live a life of ease\nEvery one of us has all we need\nSky of blue and sea of green\nIn our yellow submarine\n\nWe all live in a yellow submarine\nYellow submarine, yellow submarine\nWe all live in a yellow submarine\nYellow submarine, yellow submarine\nWe all live in a yellow submarine\nYellow submarine, yellow submarine\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-106.jpg",
    "facts": "John Lennon flashed the \"I Love You\" sign language symbol on the cover of the \"Yellow Submarine\" single. A decade later, the gesture was appropriated by metal bands as the \"devil horns,\" thrown to indicate approval and a rockin' good time.Lennon may have been the first musician to use the sign in promotional materials, which stymied Gene Simmons' case when he tried to trademark the gesture in 2017; Simmons claimed he was the first to use it when he did it on stage in 1974. The photo with Dave Grohl is what Simmons submitted as the \"specimen\" in his application."
  }
}