{
  "Artist": "The Beatles",
  "Album": "CD2 - The Beatles",
  "Title": "Yer Blues",
  "URL": "https://www.songfacts.com/facts/the-beatles/yer-blues",
  "Confidence": 1.0,
  "youtube-id": "JeFwaWFTGYU",
  "facts": [
    "John Lennon wrote this in India while The Beatles were on a retreat learning meditation with the Maharishi.",
    "John used \"yer\" instead of \"your\" in the title so as not to be taken too seriously. The song is a good-natured jab at the British blues scene.",
    "A 9 minute version with Lennon, Eric Clapton, Keith Richards and Mitch Mitchell was performed on the Rolling Stones' Rock 'n' Roll Circus. Taped as a British TV special in 1968, it never aired but was released on video in 1995. This was Lennon's first performance without The Beatles.",
    "This was the only Beatles song Lennon performed at the Toronto Rock 'n' Roll Revival concert in 1969. Eric Clapton joined him for this on guitar. After playing with him at the Toronto show, Lennon asked Clapton to join his Plastic Ono Band. Clapton considered it, but had other obligations.",
    "The line \"Feel so suicidal, just like Dylan's Mr. Jones\" is a reference to Bob Dylan's song \"Ballad of a Thin Man.\"",
    "In a Rolling Stone interview, Ringo said this song was one of his all-time favorite sessions: \"We were just in an 8 foot room, with no separation, just doing what we do best: playing.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n VinnyVegas - Durham, NC\n                                                  \n                                                  ",
    "Ringo's count-in was edited from another take.",
    "The Beatles recorded this in Abbey Road Studio Two's \"annex,\" a side room which McCartney referred to as \"a cupboard.\" They jammed together from 7pm to 5am and after 14 takes produced this parody of British blues.",
    "McCartney told Lennon not to title this song \"Year Blues,\" but \"just say it straight.\" However he kept the title as he was self conscious about singing blues. In the January 1971 edition of Rolling Stone, Lennon explained this was because, \"We were all listening to Sleepy John Estes and all that in art school, like everybody else. But to sing it was something else. I'm self conscious about doing it.\""
  ],
  "lyrics": "Yes, I'm lonely\nWant to die\nYes, I'm lonely\nWant to die\nIf I ain't dead already\nOh, girl, you know the reason why\n\nIn the morning\nWant to die\nIn the evening\nWant to die\nIf I ain't dead already\nOh, girl, you know the reason why\n\nMy mother was of the sky\nMy father was of the earth\nBut I am of the universe\nAnd you know what it's worth\n\nI'm lonely\nWant to die\nIf I ain't dead already\nOh, girl, you know the reason why\n\nThe eagle picks my eye\nThe worm he licks my bone\nI feel so suicidal\nJust like Dylan's Mr. Jones\n\nLonely\nWant to die\nIf I ain't dead already\nOh, girl, you know the reason why\n\nBlack cloud crossed my mind\nBlue mist round my soul\nFeel so suicidal\nEven hate my rock and roll\n\nWant to die\nYeah, want to die\nIf I ain't dead already\nOh, girl, you know the reason why\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}