{
  "Artist": "The Beatles",
  "Album": "Help!",
  "Title": "Yesterday",
  "URL": "https://www.songfacts.com/facts/the-beatles/yesterday",
  "Confidence": 1.0,
  "youtube-id": "wXTJBr9tt8Q",
  "facts": [
    "This is the most covered pop song of all time, with over 3,000 versions recorded according to The Guinness Book Of World Records. For years, it was also the song with the most radio plays, but in 1999 BMI music publishing reported that \"You've Lost That Lovin' Feelin'\" had passed it. Still, at any given time, some version of \"Yesterday\" is probably being broadcast somewhere.",
    "This is a rather gloomy song about a guy whose girl has left and gone away. Instead of moving on with his life, he dreams of yesterday, when they were still together. It's quite a contrast to earlier Beatles hits like \"Love Me Do\" and \"I Saw Her Standing There.\"",
    "Paul McCartney wrote this song and was the only Beatle to play on it. It was the first time a Beatle recorded without the others, and marked a shift to more independent accomplishments among the group. While John Lennon and Paul McCartney wrote The Beatles early songs together, by 1965 most of their songs were primarily written by one or the other, although they continued to credit all their songs Lennon/McCartney.",
    "A string quartet was brought in to play on this track. In addition to the strings, this is notable as one of the first pop songs to use elements of classical music.\nWhen producer George Martin first suggested adding a string quartet, Paul McCartney responded; \"Oh no, George. We are a rock 'n' roll band and I don't think it's a good idea.\"",
    "This was the first Beatles song that could not be reproduced live without additional musicians. When they played it live, including at their famous Shea Stadium concert in 1965, it was just McCartney with an acoustic guitar.",
    "McCartney claimed that while The Beatles were touring in Paris, he tumbled out of bed and this tune was in his head. He thought he had heard it somewhere before, and played the melody to different people in the music industry to make sure he wasn't stealing it. The working title was \"Scrambled Eggs\" until Paul could figure out lyrics.",
    "This was the first Beatles song to capture a mass adult market. Most of their fans were young people to this point, but this song gave the band a great deal of credibility among the older crowd. It also became one of their \"Muzak\" classics, as companies recorded instrumental versions as soothing background noise for shopping centers and elevators. Another Beatles song that lived on in this form is \"Here Comes The Sun.\"",
    "McCartney wrote some of the lyrics during a five-hour car trip from Lisbon to Albufeira (in Algarve, south of Portugal), on the 27th of May 1965, when he was on vacation with Jane Asher. The villa where Paul and Jane stayed was owned by Shadows' guitarist Bruce Welch. Bruce said that when he was packing to leave, Paul asked him if he had a guitar because (Paul) was working on the lyrics since the airport. Said Bruce: \"He borrowed my guitar and started playing the song we all now know as 'Yesterday'.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Rato - Lisbon, Portugal\n                                                  \n                                                  ",
    "The Beatles performed this on their third live Ed Sullivan Show appearance and on their last tour. For the live appearances, McCartney would play with a prerecorded backing track of strings.\nMcCartney says that when he performed it on Sullivan, just before the curtain opened a stagehand asked him, \"Are you nervous?\" \"No,\" Paul lied, to which the man responded, \"You should be. There's 73 million people watching.\"",
    "This was one of five Beatles songs McCartney performed on his \"Wings Over America\" tour in 1976.",
    "McCartney had to ask Michael Jackson to use this in his movie Give My Regards to Broadstreet. Jackson outbid McCartney for the publishing rights to The Beatles catalogue, something that fractured their friendship as McCartney counseled Jackson on the value of publishing rights.",
    "McCartney has consistently talked about how easy this song was for him to compose. In describing it, he has said \"I did the tune easily and then the words took about two weeks.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Shannon - Kathleen, GA\n                                                  \n                                                  ",
    "This song caused a rift between McCartney and Yoko Ono. When The Beatles Anthology album was released, McCartney asked that the writing credit on this read \"McCartney/Lennon,\" since he wrote it. Yoko refused, and it was listed as \"Lennon/McCartney,\" which is how they usually credited songs written by either Beatle (between Please Please Me and With The Beatles, the song credits turned from McCartney/Lennon to Lennon/McCartney). In 2003, McCartney switched the writing credit for the first time when he listed 19 Beatles songs on his Back In The US album as \"Paul McCartney and John Lennon.\" Paul claims he and John made an informal agreement in 1962 regarding the credits, but he had every right to switch it if he chose. Yoko disagreed.",
    "Some of the artists who have covered this song include Boyz II Men, Ray Charles, En Vogue, Marianne Faithfull, Marvin Gaye, Tom Jones, Nana Mouskouri, Elvis Presley, Frank Sinatra, The Supremes, The Toys, Andy Williams, and Tammy Wynette. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jerro - New Alexandria, PA\n                                                  \n                                                  ",
    "This was featured in the 1997 movie Bean, when the title character (played by Rowan Atkinson) sings it with David Langley (played by Peter MacNicol) as they trot home one night. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Tiffany - Dover, FL\n                                                  \n                                                  ",
    "Paul McCartney's first performance at the Grammys came in 2006. He joined in with Jay-Z and the lead singer of Linkin Park to sing part of the lyrics to this song. Paul also performed \"Fine Line\" and \"Helter Skelter\" earlier in the show. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Patrick - Statesville, NC\n                                                  \n                                                  ",
    "When McCartney played this song, he tuned his guitar one tone lower than usual. On a recording that can be heard on The Beatles Anthology, he explains to the musicians before the song: \"I'm in G, but it's F.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mikhail Povorin - Moscow, Russia Federation\n                                                  \n                                                  ",
    "John Lennon referenced this song in his anti-McCartney solo effort \"How Do You Sleep?\" with the lyrics, ''The only thing you've done was yesterday, and since you've gone you're just another day.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jordan - Buffalo, NY\n                                                  \n                                                  ",
    "Carrie Underwood performed this song at the Primetime Emmy Awards on September 22, 2013 in honor of The Beatles historic Ed Sullivan Show appearance nearly 50 years earlier (February 9, 1964). Underwood's performance was conceived as an affirmation of the power of television and its impact on music and entertainment, as she got her start on the TV show American Idol.\nUnderwood didn't switch the gender for her performance, singing \"I'm not half the man I used to be.\"",
    "Yesterday is the name of a 2019 film about a struggling musician (Himesh Patel) who finds himself in an alternate universe where The Beatles never existed. He finds this out when he plays \"Yesterday\" to some friends, who think he wrote it.",
    "This doesn't seem like an appropriate song to honor the dead, but that's how it was used at the 2020 Oscars when Billie Eilish sang it for the \"In Memoriam\" segment."
  ],
  "lyrics": "Yesterday, all my troubles seemed so far away\nNow it looks as though they're here to stay\nOh, I believe in yesterday\n\nSuddenly, I'm not half the man I used to be\nThere's a shadow hanging over me\nOh, yesterday came suddenly\n\nWhy she had to go I don't know she wouldn't say\nI said something wrong, now I long for yesterday\n\nYesterday, love was such an easy game to play\nNow I need a place to hide away\nOh, I believe in yesterday\n\nWhy she had to go I don't know she wouldn't say\nI said something wrong, now I long for yesterday\n\nYesterday, love was such an easy game to play\nNow I need a place to hide away\nOh, I believe in yesterday\nMm mm mm mm mm mm mm\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}