{
  "Artist": "The Beatles",
  "Album": "Help!",
  "Title": "You've Got To Hide Your Love Away",
  "URL": "https://www.songfacts.com/facts/the-beatles/youve-got-to-hide-your-love-away",
  "Confidence": 1.0,
  "youtube-id": "_m7XVmzJ1ro",
  "facts": [
    "It was rumored that this was the first gay rock song, a message to Beatles manager Brian Epstein, who was gay. In the part of The Beatles Anthology, that covers Epstein's death, this song is played, giving credence to the idea that this song was indeed a song about hiding one's homosexuality. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Patrickman - Makati City\n                                                  \n                                                  ",
    "John Lennon told Rolling Stone in 1971, that when he wrote this, he was just knocking out pop songs, without expressing his own personal emotions to any great extent: He explained: \"I was in Kenwood (his home at the time) and I would just be songwriting. The period would be for songwriting and so every day I would attempt to write a song and it's one of those that you sort of sing a bit sadly to yourself, 'Here I stand, head in hand...'\"\nLennon then went on to say how listening to Bob Dylan was beginning to influence his songwriting around the time he wrote this. He recalled: \"I started thinking about my own emotions - I don't know when exactly it started like 'I'm a Loser' or 'Hide Your Love Away' or those kind of things- instead of projecting myself into a situation I would just try to express what I felt about myself which I'd done in me books. I think it was Dylan helped me realize that - not by any discussion or anything but just by hearing his work - I had a sort of professional songwriter's attitude to writing pop songs; he would turn out a certain style of song for a single and we would do a certain style of thing for this and the other thing. I was already a stylized songwriter on the first album. But to express myself I would write Spaniard in the Works or In His Own Write, the personal stories which were expressive of my personal emotions. I'd have a separate songwriting John Lennon who wrote songs for the sort of meat market, and I didn't consider them - the lyrics or anything - to have any depth at all. They were just a joke. Then I started being me about the songs, not writing them objectively, but subjectively.\"",
    "The line \"feeling two foot small\" was written \"feeling two foot tall.\" Lennon sang it wrong but liked it and left it that way.",
    "Session musicians played flutes. It was the first time outsiders played on a Beatles record.",
    "Lennon's friend Pete Shotton came up with the \"Hey\"s in the chorus.",
    "Joe Cocker in 1991 on his album Night Calls. Cocker previously covered The Beatles \"I'll Cry Instead,\" \"With A Little Help From My Friends\" and \"She Came In Through The Bathroom Window.\""
  ],
  "lyrics": "Here I stand head in hand\nTurn my face to the wall\nIf she's gone I can't go on\nFeeling two foot small\nEverywhere people stare\nEach and every day\nI can see them laugh at me\nAnd I hear them say\n\nHey, you've got to hide your love away\nHey, you've got to hide your love away\n\nHow can I even try?\nI can never win\nHearing them, seeing them\nIn the state I'm in\nHow could she say to me\n\"Love will find a way?\"\nGather round all you clowns\nLet me hear you say\n\nHey you've got to hide your love away\nHey you've got to hide your love away\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}