{
  "Artist": "The Beatles",
  "Album": "A Hard Day's Night",
  "Title": "You Can't Do That",
  "URL": "https://www.songfacts.com/facts/the-beatles/you-cant-do-that",
  "Confidence": 1.0,
  "youtube-id": "y8Dpt7TI9q0",
  "facts": [
    "The Beatles recorded this in nine takes on George Harrison's 21st Birthday (in the same session as \"And I Love Her\" and \"I Should Have Known Better\"), although in May, producer George Martin overdubbed a piano making a 10th take that wasn't used. The one that saw the light of the day was Take 9. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ben - Cheverly, MD\n                                                  \n                                                  ",
    "This was filmed for the movie A Hard Day's Night, but did not make the cut. It was, however, included on the movie's soundtrack, which was released by the film's production company United Artists. Since United Artists had the soundtrack rights, The Beatles' American label, Capitol, released it as the B-side of \"Can't Buy Me Love.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "John Lennon played lead guitar. He normally played rhythm while George Harrison played lead. Ringo played the cowbell.",
    "This was the first Beatles song on which George Harrison played a 12-string guitar.",
    "John Lennon told the British journalist Ray Connolly that this song was his attempt at being pioneering American soul singer Wilson Pickett.",
    "Harry Nilsson covered this song on his 1967 debut album, Pandemonium Shadow Show as a tribute to The Beatles' music in general. It is performed at a slower tempo, and throughout the song lines from other Beatles songs are sung in counterpoint, ending with the line \"Strawberry Beatles Forever.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n David - Mesa, AZ\n                                                  \n                                                  "
  ],
  "lyrics": "I got something to say that might 'cause you pain\nIf I catch you talking to that boy again\nI'm gonna let you down\nAnd leave you flat\nBecause I told you before, oh\nYou can't do that\n\nWell, it's the second time I've caught you talking to him\nDo I have to tell you one more time, I think it's a sin\nI think I'll let you down (let you down)\nAnd leave you flat\n(Gonna let you down and leave you flat)\nBecause I've told you before, oh\nYou can't do that\n\nEverybody's green\n'Cause I'm the one, who won your love\nBut if they'd seen\nYou're talking that way they'd laugh in my face\n\nSo please listen to me, if you wanna stay mine\nI can't help my feelings, I'll go out of my mind\nI'm gonna let you down (let you down)\nAnd leave you flat\n(Gonna let you down and leave you flat)\nBecause I've told you before, oh, you can't do that\n\nYou can't do that\nYou can't do that\nYou can't do that\nYou can't do that\nYou can't do that\n\nEverybody's green\n'Cause I'm the one who won your love\nBut if they'd seen\nYou're talking that way they'd laugh in my face\n\nSo please listen to me, if you wanna stay mine\nI can't help my feelings, I'll go out of my mind\nI'm gonna let you down (let you down)\nAnd leave you flat\n(Gonna let you down and leave you flat)\nBecause I've told you before, oh\nYou can't do that\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Kobalt Music Publishing Ltd.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}