{
  "Artist": "The Beatles",
  "Album": "Abbey Road",
  "Title": "You Never Give Me Your Money",
  "URL": "https://www.songfacts.com/facts/the-beatles/you-never-give-me-your-money",
  "Confidence": 1.0,
  "youtube-id": "P4ycjKzg2PA",
  "facts": [
    "When The Beatles realized the British government was collecting most of their earnings in taxes, they expressed their frustration with \"Taxman,\" a track from their 1966 Revolver album. Three years later, they had more money problems, this time driven by internal affairs. When their manager Brian Epstein died in 1967, they were burdened with handling their own finances, which became a source of tension in the band and led to some disastrous business dealings, including the Apple Boutique. Paul McCartney responded with \"You Never Give Me Your Money,\" where he expresses his own fiscal frustration.",
    "This is the first of a medley of songs on Abbey Road, which goes another 15 minutes to \"The End.\"",
    "By 1969, members of The Beatles had a lot of unfinished song ideas, which they sometimes combined. This contains fragments of four songs put into one.",
    "Regarding the lines, \"You never give me your money, you only give me your funny paper,\" \"funny paper\" is how The Beatles felt they were paid. They got frustrated when their accountants would tell them how much they were worth \"on paper,\" without actually telling them how much money they had.",
    "George Harrison, who wrote \"Taxman,\" appreciated this song. Speaking with David Wigg on BBC Radio in 1969, he said: \"To actually get the money that you've earned is virtually impossible. It's like illegal to earn money. Well, not to earn it, it's illegal to keep the money you earn. 'You never give me your money, you only give me your funny paper.' You know, that's what we get. Bits of paper saying how much is earned and what's this and that.\"",
    "Paul McCartney played this combined with \"Carry That Weight\" on his 2002 \"Back In The US\" tour."
  ],
  "lyrics": "You never give me your money\nYou only give me your funny paper\nAnd in the middle of negotiations\nYou break down\n\nI never give you my number\nI only give you my situation\nAnd in the middle of investigation\nI break down\n\nOut of college, money spent\nSee no future, pay no rent\nAll the money's gone, nowhere to go \nAny jobber got the sack\nMonday morning, turning back\nYellow lorry slow, nowhere to go\nBut oh, that magic feeling, nowhere to go\nOh, that magic feeling\nNowhere to go, nowhere to go\n\nOne sweet dream\nPick up the bags and get in the limousine\nSoon we'll be away from here\nStep on the gas and wipe that tear away\nOne sweet dream came true today\nCame true today\nCame true today (yes, it did)\n\nOne, two, three, four, five, six, seven\nAll good children go to Heaven\n\nOne, two, three, four, five, six, seven\nAll good children go to Heaven\n\nOne, two, three, four, five, six, seven\nAll good children go to Heaven\n\nOne, two, three, four, five, six, seven\nAll good children go to Heaven\n\nOne, two, three, four, five, six, seven\nAll good children go to Heaven\n\nOne, two, three, four, five, six, seven\nAll good children go to Heaven\n\nOne, two, three, four, five, six, seven\nAll good children go to Heaven\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}