{
  "Artist": "The Beatles",
  "Album": "Rubber Soul",
  "Title": "You Won't See Me",
  "URL": "https://www.songfacts.com/facts/the-beatles/you-wont-see-me",
  "Confidence": 1.0,
  "youtube-id": "_Xe0C2WB5Og",
  "facts": [
    "Paul McCartney wrote this about his tumultuous five-year relationship with the actress Jane Asher. He wrote it one night after she had walked out. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adrian - Wilmington, DE\n                                                  \n                                                  ",
    "Up to this point, McCartney wrote lots of \"silly love songs. \"You Won't See Me\" was a departure lyrically, as the song was more personal and mature, and also a little bitter, which reflects how he felt about his relationship with Jane Asher. Another Rubber Soul song, \"I'm Looking Through You,\" is also about Asher and is similarly scathing. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "A cover version by the country singer Anne Murray hit #8 US in 1974.",
    "Mal Evans, The Beatles road manager, played the Hammond organ.",
    "This was recorded in two takes. In their early years, The Beatles did so many live shows that they had no trouble recording quickly.",
    "The melody for the Chicago hit \"Saturday In The Park\" is based on this song."
  ],
  "lyrics": "When I call you up, your line's engaged\nI have had enough, so act your age\nWe have lost the time that was so hard to find\nAnd I will lose my mind\nIf you won't see me, you won't see me\n\nI don't know why you should want to hide\nBut I can't get through, my hands are tied\nI won't want to stay, I don't have much to say\nBut I get turned away\nAnd you won't see me, you won't see me\n\nTime after time you refuse to even listen\nI wouldn't mind if I knew what I was missing\nThough the days are few, they're filled with tears\nAnd since I lost you, it feels like years\nYes, it seems so long, girl, since you've been gone\nAnd I just can't go on\nIf you won't see me, you won't see me\n\nTime after time you refuse to even listen\nI wouldn't mind if I knew what I was missing\nThough the days are few, they're filled with tears\nAnd since I lost you, it feels like years\nYes, it seems so long, girl, since you've been gone\nI just can't go on\nIf you won't see me, you won't see me\nYou won't see me, you won't see me\n                                                  \n                                                  Writer/s: John Lennon, Paul McCartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}