{
  "Artist": "The Beatles",
  "Album": "Magical Mystery Tour",
  "Title": "Your Mother Should Know",
  "URL": "https://www.songfacts.com/facts/the-beatles/your-mother-should-know",
  "Confidence": 1.0,
  "youtube-id": "tCXsFjzMKdc",
  "facts": [
    "As detailed in Beatles In They're Own Words by Barry Miles, Paul McCartney wrote this at his place on Cavendish Avenue in London on the harmonium in the dining room. His Aunty Jin, Uncle Harry, and other relatives were there, and he just sat and wrote it for a few hours with the door opened so they could all listen from another room. Paul said, \"I was basically trying to say your mother might know more than you think she does. Give her credit.\" He also said that the family atmosphere and his Aunty Jin being there influenced it and its music-hall idea. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Julia - OH\n                                                  \n                                                  ",
    "This was used in the last scene of the movie Magical Mystery Tour, where the four Beatles dance in tuxedos. Paul McCartney wore a black carnation while the others wore red, fueling rumors that Paul was dead.",
    "Every Mother's Day, this is still a very popular song. There are surprisingly few contemporary songs with the word \"Mother\" in the title that are actual tributes to mothers.",
    "The vocals are on the left channel for the first verse, move to the right for the second, then back to the left for the third. The song has an old-fashioned sound to fit with the idea that it's a favorite of a past generation."
  ],
  "lyrics": "Let's all get up and dance to a song\nThat was a hit before your mother was born\nThough she was born a long long time ago\nYour mother should know (your mother should)\nYour mother should know\n\nSing it again\n\nLet's all get up and dance to a song\nThat was a hit before your mother was born\nThough she was born a long long time ago\nYour mother should know (your mother should)\nYour mother should know\n\nLift up your hearts and sing me a song\nThat was a hit before your mother was born\nThough she was born a long long time ago\nYour mother should know (your mother should)\nYour mother should know\n\nYour mother should know (your mother should)\nYour mother should know\n\nSing it again\n\nDa da dada da da da dada dada dada da da\nDa dada da da\nThough she was born a long long time ago\nYour mother should know (your mother should)\nYour mother should know\n\nYour mother should know (your mother should)\nYour mother should know\n\nYour mother should know (your mother should)\nYour mother should know, yeah\n                                                  \n                                                  Writer/s: John Lennon, Paul Mccartney \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}