{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "A Kind Of Magic",
  "URL": "https://www.songfacts.com/facts/queen/a-kind-of-magic",
  "Confidence": 1.0,
  "youtube-id": "0p_1QSUsbsM",
  "facts": [
    "Roger Taylor wrote the melody and chords of this song for the Highlander film, then Freddie Mercury wrote a new bass line, added some instrumental spacers, changed the order and produced a new mix with David Richards. Taylor was reportedly very annoyed that Mercury had almost completely re-written the song behind his back (reportedly whilst he was on holiday!), so perhaps that explains why the song was still credited only to Taylor. Roger's version is at the end of the film; Freddie's version is on the album. \nNot only was this song used in the Highlander film, but 2/3rds of the songs from A Kind Of Magic appear as well, making it the unofficial soundtrack of the film. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Sebas - Tokyo, Japan\n                                                  \n                                                  ",
    "At the Highlander film's climax, when MacLeod (Christopher Lambert) leaves Rachel (Sheila Gish), his parting words are, \"Hey, it's a kind of magic.\" The phrase \"A kind of magic\" was the starting point for Roger Taylor to write this song. Other references to the film in the lyrics include \"One prize, one goal\" and \"No mortal man.\"",
    "The album A Kind of Magic is Queen's twelfth studio album but the first to include a title track.",
    "This was a big song on Queen's 1986 Magic tour, which was their last with the original members, since Freddie Mercury would be diagnosed with AIDS the following year and was too sick to tour after that. \nRoger Taylor noted in the Days of our Lives documentary that \"you just got a sense that he (Mercury) felt that he would not be able to do any more shows,\" which raises the question of whether Mercury had already been diagnosed with AIDS in 1986 but chose to make the Magic tour his final live shows. This was also the tour where Mercury wore his white slacks and yellow jacket combo, which has since become his signature get-up. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The album was also the first by Queen to be digitally recorded.",
    "Not many fans even note this, but all four original members wrote songs for the band, obeying their own self-stated \"no passengers\" policy. Freddie Mercury did most of their ballads and experimental, innovative pieces (\"Love Of My Life,\" \"Bohemian Rhapsody,\" \"Killer Queen\"), Brian May did the guitar-hooked hard-rock numbers, (\"Tie Your Mother Down,\" \"We Will Rock You\"), Roger Taylor wrote classic-style rock (\"I'm In Love With My Car,\" \"Radio Ga Ga\"), and John Deacon was more into the soul and funk style (\"Another One Bites The Dust\"). Additionally, all four styles blended when the band members collaborated.",
    "For the un-fans, Highlander kicked off a fantasy series with the basic premise: There are these Immortals, see, but they can be killed only by being beheaded, and the executioner to do so becomes the new Immortal - and hence the next target for the next challenger. Some have called it \"Interview with the Vampire for men.\" That's really all there is to this, along with some Scottish mythology. The franchise has since been mired in squabbling versions, sequels, spin-offs, and interpretations all conflicting with each other, rather like the Batman franchise.",
    "This song has remained a live favorite, often with Roger Taylor handling lead vocals (as he did on the Queen+Adam Lambert tour)."
  ],
  "lyrics": "(It's a kind of magic)\n(It's a kind of magic)\n(A kind of magic)\n\nOne dream, one soul, one prize, one goal\nOne golden glance of what should be\n(It's a kind of magic)\nOne shaft of light that shows the way\nNo mortal man can win this day\n\n(It's a kind of magic)\nThe bell that rings inside your mind\nIt's a challenging the doors of time\n(It's a kind of magic)\n\nThe waiting seems eternity\nThe day will dawn of sanity\nIt's a kind of magic\n(It's a kind of magic)\nThere can be only one\n\nThis rage that lasts a thousand years\nWill soon be gone\nThis flame that burns inside of me\nI'm hearing secret harmonies\n\n(It's a kind of magic)\nThe bell that rings inside your mind\nIs challenging the doors of time\n(It's a kind of magic)\n(It's a kind of magic)\n\nThis rage that lasts a thousand years\nWill soon be, will soon be\nWill soon be gone\n\nThis is a kind of magic\nThere can only be one\nThis rage that lasts a thousand years\nWill soon be gone (gone)\n\nMagic, it's a kind of magic\nIt's a kind of magic\nMagic, magic, magic, magic\nMagic, ha ha ha ha it's magic\n\nHa ha\nYeah, yeah\n\nIt's a kind of magic\n                                                  \n                                                  Writer/s: Roger Meddows Taylor \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, BMG Rights Management\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}