{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Another One Bites The Dust",
  "URL": "https://www.songfacts.com/facts/queen/another-one-bites-the-dust",
  "Confidence": 1.0,
  "youtube-id": "rY0WxgSXdEE",
  "facts": [
    "This is one of the hardest Queen songs to understand. The opening line reads, \"Steve walks warily down the street, his brim pulled way down low. Ain't no sound but the sound of his feet, machine gun ready to go...\" Also, the last phrase spoken in the song is not \"Shoot Her\" or \"Shooter,\" but \"Shoot Out.\"",
    "Though probably not intentional unless someone did an excellent splicing job, the \"another one bites the dust\" line quite clearly says \"decide to smoke marijuana\" when played backwards. This is especially clear toward the end of the track when Mercury repeats the line with only the drums playing. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Brandon - Mauriceville, TX, for above 2\n                                                  \n                                                  ",
    "Queen bass player John Deacon wrote this song. All four members of Queen wrote songs, and each wrote at least one hit. Deacon also wrote \"You're My Best Friend.\"\nDeacon was influenced by the Chic song Good Times. In an interview with the New Musical Express, Chic bass player Bernard Edwards said: \"Well, that Queen record came about because that bass player spent some time hanging out with us at our studio. But that's OK. What isn't OK is that the press started saying that we had ripped them off! Can you believe that? 'Good Times' came out more than a year before, but it was inconceivable to these people that black musicians could possibly be innovative like that. It was just these dumb disco guys ripping off this rock 'n' roll song.\"",
    "Deacon played most of the instruments on the track: lead and rhythm guitars, bass, reversed piano and additional percussion. Brian May did some guitar effects with harmoniser (in the interlude), and Roger Taylor played the drum loop. Surprisingly, there are no synthesizers.",
    "The drum track and the hand claps were looped. They repeat throughout the song.",
    "While the band and producer Reinhold Mack were mixing the track, Brian May's roadie suggested it to be released as single; the band didn't like the idea but were finally talked into doing it when Michael Jackson, after a concert, suggested the same idea. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n sebas - Tokyo, Japan, for above 2\n                                                  \n                                                  ",
    "John Deacon claimed in a 1980 interview that Roger Taylor opposed the song's drum beat. This is backed up by the comments of several figures in the Days of our Lives documentary, who noted that Taylor hated having tape put on his drums to deaden the sound. \nHowever, the drummer denied this in an interview with Mojo magazine October 2008. He insisted: \"I'd already had an ineffectual pop at that kind of music with 'Fun It,' on the Jazz album. I was never against 'Another One Bites The Dust,' but I was against releasing it as a single.\"",
    "In 1998, this was used in a commercial for AIWA sound systems. In the ad, a guy drives around with this blaring from his car stereo. At the end of the commercial, we realize he is driving a hearse.",
    "Freddie Mercury loved this track. Brian May recalled to Mojo: \"Freddie sung until his throat bled on Another One Bites The Dust. He was so into it. He wanted to make that song something special.\"",
    "During production of the movie Rocky III, this was used in a key scene where Rocky is training for a fight. Producers could not get permission to use the song, so Sylvester Stallone hired Survivor to write an original song instead, which turned out to be \"Eye Of The Tiger.\"",
    "Queen were originally reluctant to release this as a single, but backstage after a Queen gig at the Los Angeles forum, a visiting Michael Jackson convinced them it would be a hit. \"Michael and all his brothers were all going, 'That's a fantastic track. You must release it,'\" recalled Queen drummer Roger Taylor to Q magazine December 2009.\nThis meeting lead to several recordings and collaborations between Freddie Mercury and Jackson, all of which remain unreleased.",
    "Weird Al Yankovic got his first chart placing with his parody of this song: \"Another One Rides The Bus.\" It bubbled under on the Hot 100, placing at #104 in 1981. After a few more minor hits, he landed \"Eat It\" at #12 in 1984. Even then, Al was getting permission from the artists he parodied before releasing his songs.",
    "This was the single that really broke the band in America, and it garnered a huge following amongst American disco audiences, with many fans and journalists convinced it was a black man singing lead vocals (these people obviously hadn't heard of Queen before so didn't know what Freddie looked like). The band occasionally were unsure of how to deal with this - Roger Taylor jokes in the Days of our Lives documentary of having fans shouting \"you guys are bad!\" in the street, and he had to ask \"does that mean good or what?\"",
    "This was used in a 2016 commercial for the Hyundai Genesis that first aired on the Super Bowl. In the spot, Kevin Hart uses the Car Finder app to track down the guy who is using it to take his daughter on a date. After tormenting her suitor, Hart says, \"A dad's gotta do what a dad's gotta do.\"",
    "This is used for CPR training because its bassline has close to 110 beats per minute, which matches the recommended chest compression rate."
  ],
  "lyrics": "Oh, let's go\n\nSteve walks warily down the street\nWith the brim pulled way down low\nAin't no sound but the sound of his feet,\nMachine guns ready to go\n\nAre you ready, hey, are you ready for this? \nAre you hanging on the edge of your seat? \nOut of the doorway the bullets rip\nTo the sound of the beat\n\nAnother one bites the dust\nAnother one bites the dust\nAnd another one gone, and another one gone\nAnother one bites the dust\nHey, I'm gonna get you, too\nAnother one bites the dust\n\nHow do you think I'm going to get along\nWithout you when you're gone? \nYou took me for everything that I had\nAnd kicked me out on my own\n\nAre you happy, are you satisfied? \nHow long can you stand the heat? \nOut of the doorway the bullets rip\nTo the sound of the beat\n\nAnother one bites the dust\nAnother one bites the dust\nAnd another one gone, and another one gone\nAnother one bites the dust\nHey, I'm gonna get you, too\nAnother one bites the dust\n\nHey\nOh take it\nBite the dust\nBite the dust\nHey\nAnother one bites the dust\nAnother one bites the dust oww\nAnother one bites the dust hey hey\nAnother one bites the dust eh eh\n\nOh shooter\nThere are plenty of ways that you can hurt a man\nAnd bring him to the ground\nYou can beat him, you can cheat him\nYou can treat him bad and leave him when he's down\n\nBut I'm ready, yes, I'm ready for you\nI'm standing on my own two feet\nOut of the doorway the bullets rip\nRepeating to the sound of the beat oh yeah\n\nAnother one bites the dust\nAnother one bites the dust\nAnd another one gone, and another one gone\nAnother one bites the dust\nHey, I'm gonna get you, too\nAnother one bites the dust\n\nOh shooter hey hey, all right\n                                                  \n                                                  Writer/s: John Richard Deacon \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}