{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Bicycle Race",
  "URL": "https://www.songfacts.com/facts/queen/bicycle-race",
  "Confidence": 1.0,
  "youtube-id": "aWWR3Ssd0EQ",
  "facts": [
    "Freddie Mercury wrote this in France after watching the Tour de France bicycle race ride by his hotel. The band were recording Jazz in the French countryside mainly as a tax break - Roger Taylor claimed in the Days of our Lives documentary that they were being taxed as much as 98% on royalties on previous albums, hence why they defected to France and later Montreux in Switzerland to record future albums.",
    "This was released as a double A-side single with \"Fat Bottomed Girls.\" They ran back to back on the album, and many radio stations played them together. The \"Fat Bottomed Girls\" are mentioned in this song's lyrics.",
    "Wherever Queen played, bicycle shops sold out of bells bought by fans who brought them to the show to ring them during this song.",
    "Queen staged a bicycle race around Wimbledon stadium in England to promote the single. Sixty-five professional models were hired to race nude, with special effects hiding the nudity in the original video; a photo from the race was used on the cover of the single and images from the race were used for the video.\nQueen rented 65 bicycles for the race. In a possibly apocryphal but often-repeated story, when the rental company found out what they were used for, they refused to take the bikes back unless the band paid for new seats.\nThe album contained a poster of the women in the bicycle race. It was left out of some copies for stores that did not want to carry it, but fans could mail order the poster if they desired. A bikini bottom was added to cover the bum on the cover of the single, and on some US releases a bra was also added.",
    "At a 1978 concert in Madison Square Garden, Queen re-created the video by having women with very little clothing ride bicycles around the stage.",
    "Queen had a lot of success the year before with another double A-side, \"We Will Rock You\" and \"We Are The Champions.\"",
    "Be Your Own Pet covered this for the 2005 Queen tribute album Killer Queen. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Rachel - South Point, OH\n                                                  \n                                                  ",
    "The song features surprisingly complex instrumentation, and the Jazz album as a whole perhaps represents the apex of Queen's experimentation. It features an imaginative solo played exclusively on bicycle bells, unusual chord progressions, shifts in time signature (from 4/4 to 6/8) and a whole host of pop culture references in the lyrics, including mentions of religion, the Watergate scandal, drugs, Jaws, Star Wars and Frankenstein."
  ],
  "lyrics": "Bicycle, bicycle, bicycle\nI want to ride my bicycle, bicycle, bicycle\nI want to ride my bicycle\nI want to ride my bike\nI want to ride my bicycle\nI want to ride it where I like\n\nYou say black, I say white\nYou say bark, I say bite\nYou say shark, I say hey man\nJaws was never my scene\nAnd I don't like Star Wars\n\nYou say Rolls, I say Royce\nYou say God give me a choice\nYou say Lord, I say Christ\nI don't believe in Peter Pan\nFrankenstein or Superman\nAll I wanna do is\n\nBicycle, bicycle, bicycle\nI want to ride my bicycle, bicycle, bicycle\nI want to ride my bicycle\nI want to ride my bike\nI want to ride my bicycle\nI want to ride my bicycle, races are coming your way\n\nSo forget all your duties, oh yeah\nFat bottomed girls, they'll be riding today\nSo look out for those beauties, oh yeah\n\nOn your marks, get set, go\n\nBicycle race, bicycle race, bicycle race\nBicycle, bicycle, bicycle\nI want to ride my bicycle, bicycle, bicycle, bicycle\n(I want a) bicycle race\n\nYou say coke, I say 'caine\nYou say John, I say Wayne\nHot dog, I say cool it man\nI don't wanna be the President of America\n\nYou say smile, I say cheese\nCartier, I say please\nIncome tax, I say Jesus\nI don't wanna be a candidate\nFor Vietnam or Watergate\n'Cause all I want to do is\n\nBicycle, bicycle, bicycle\nI want to ride my bicycle, bicycle (c'mon), bicycle\nI want to ride my bicycle\nI want to ride my bike\nI want to ride my bicycle\nI want to ride it where I like\n                                                  \n                                                  Writer/s: Freddie Mercury \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}