{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Bohemian Rhapsody",
  "URL": "https://www.songfacts.com/facts/queen/bohemian-rhapsody",
  "Confidence": 1.0,
  "youtube-id": "fJ9rUzIMcZQ",
  "facts": [
    "Freddie Mercury wrote the lyrics, and there has been a lot of speculation as to their meaning. Many of the words appear in the Qu'ran. \"Bismillah\" is one of these and it literally means \"In the name of Allah.\" The word \"Scaramouch\" means \"A stock character that appears as a boastful coward.\" \"Beelzebub\" is one of the many names given to The Devil.\nMercury's parents were deeply involved in Zoroastrianism, and these Arabic words do have a meaning in that religion. His family grew up in Zanzibar, but was forced out by government upheaval in 1964 and they moved to England. Some of the lyrics could be about leaving his homeland behind. Guitarist Brian May seemed to suggest this when he said in an interview about the song: \"Freddie was a very complex person: flippant and funny on the surface, but he concealed insecurities and problems in squaring up his life with his childhood. He never explained the lyrics, but I think he put a lot of himself into that song.\" \nAnother explanation is not to do with Mercury's childhood, but his sexuality - it was around this time that he was starting to come to terms with his bisexuality, and his relationship with Mary Austin was falling apart. \nWhatever the meaning is, we may never know - Mercury himself remained tight-lipped, and the band agreed not to reveal anything about the meaning. Mercury himself stated, \"It's one of those songs which has such a fantasy feel about it. I think people should just listen to it, think about it, and then make up their own minds as to what it says to them.\" He also claimed that the lyrics were nothing more than \"Random rhyming nonsense\" when asked about it by his friend Kenny Everett, who was a London DJ. \nThe band were always keen to let listeners interpret their music in a personal way to them, rather than impose their own meaning on songs, and May stated that the band agreed to keep the personal meaning behind the song private out of respect for Mercury.",
    "Mercury may have written \"Galileo\" into the lyrics for the benefit of Brian May, who is an astronomy buff and in 2007 earned a PhD in astrophysics. Galileo is a famous astronomer known for being the first to use a refracting telescope.",
    "The backing track came together quickly, but Queen spent days overdubbing the vocals in the studio using a 24-track tape machine. The analog recording technology was taxed by the song's multitracked scaramouches and fandangos: by the time they were done, about 180 tracks were layered together and \"bounced\" down into sub-mixes. Brian May recalled in various interviews being able to see through the tape as it was worn so thin with overdubs. Producer Roy Thomas Baker also recalls Mercury coming into the studio proclaiming, \"oh, I've got a few more 'Galileos' dear!\" as overdub after overdub piled up.",
    "Was Freddie Mercury coming out as gay in this song? Lesley-Ann Jones, author of the biography Mercury, thinks so.\nJones says that when she posed the question to Mercury in 1986, the singer didn't give a straight answer, and that he was always very vague about the song's meaning, admitting only that it was \"about relationships.\" (Mercury's family religion, Zoroastrianism, doesn't accept homosexuality, and he made efforts to conceal his sexual orientation, possibly so as not to offend his family.)\nAfter Mercury's death, Jones says she spent time with his lover, Jim Hutton, who told her that the song was, in fact, Mercury's confession that he was gay. Mercury's good friend Tim Rice agreed, and offered some lyrical analysis to support the theory:\n\"Mama, I just killed a man\" - He's killed the old Freddie he was trying to be. The former image.\n\"Put a gun against his head, pulled my trigger, now he's dead\" - He's dead, the straight person he was originally. He's destroyed the man he was trying to be, and now this is him, trying to live with the new Freddie.\n\"I see a little silhouetto of a man\" - That's him, still being haunted by what he's done and what he is.",
    "Queen made a video for the song to air on Top Of The Pops, a popular British music show, because the song was too complex to perform live - or more accurately, to be mimed live - on TOTP. Also, the band would be busy on tour during the single's release and thus unable to appear.\nThe video turned out to be a masterstroke, providing far more promotional punch than a one-off live appearance. Top Of The Pops ran it for months, helping keep the song atop the charts. This started a trend in the UK of making videos for songs to air in place of live performances.\nWhen the American network MTV launched in 1981, most of their videos came from British artists for this reason. In the December 12, 2004 issue of the Observer newspaper, Roger Taylor explained: \"We did everything we possibly could to avoid appearing in Top Of The Pops. It was one, the most boring day known to man, and two, it's all about not actually playing - pretending to sing, pretending to play. We came up with the video concept to avoid playing on Top Of The Pops.\"\nThe group had previously appeared on the show twice, to promote the \"Seven Seas of Rhye\" and \"Killer Queen\" singles.",
    "The video was very innovative, the first where the visual images took precedence over the song. The look, with the four band members peering up into the shadows, was based on their 1974 Queen II album cover shot by Mick Rock, who got the idea from a publicity photo of Marlene Dietrich striking a similar pose in the movie Shanghai Express. (Rock told Songfacts: \"I showed it to Freddie and said, 'Freddie, you could be Marlene Dietrich! How do you fancy that?' And he loved it.\")\nDirected by Bruce Gowers, the video was shot in three hours for £3,500 at the band's rehearsal space. Gowers got the gig because he was one of the few people who had experience working on music videos - he ran a camera on a few Beatles promotional clips, including the one for \"Paperback Writer.\" \nThe two big effects used in the video are the multiple images that appear in the \"thunderbolts and lightning section,\" created by putting a prism in front of the camera lens, and the feedback effect where the image of the singer travels to infinity, done by pointing a camera at a monitor (like audio feedback, this is something you usually tried to avoid, but when harnessed for artistic purposes, was quite effective). At the time, the video looked high-tech and futuristic. It was also one of the first music videos in the sense that it was shot on video instead of film, which allowed the feedback effect.",
    "This was Queen's first Top 10 hit in the US, peaking at #9 on April 24, 1976. In the UK, where Queen was already established, it went to #1 on November 29, 1975 and stayed for nine weeks, a record at the time.",
    "This got a whole new audience when it was used in the 1992 movie Wayne's World, starring Mike Myers and Dana Carvey. In the film, Wayne and his friends lip-synch to it in his car (the Mirth Mobile), spasmodically head-bobbing at the guitar solo. As a result of the movie, it was re-released as a single in the US and charted at #2 (\"Jump\" by Kris Kross kept it out of #1).\nIn America, this marked a turning point in Queen's legacy. The band's 1982 album Hot Space contained a side of disco-tinged tracks at a time when disco was anathema to rock fans. The album had disappointing sales in the US, and also cost Queen in credibility. Their tour to support the album would be Freddie Mercury's last with Queen in America, and the band was largely forgotten there for the rest of the decade. When Wayne's World revived \"Bohemian Rhapsody,\" American listeners remembered how cool Queen really was, and they the ringing endorsement from Wayne and Garth to back them up.",
    "At 5:55, this was a very long song for radio consumption. Queen's manager at the time, John Reid, played it to another artist he managed, Elton John, who promptly declared: \"are you mad? You'll never get that on the radio!\"\nAccording to Brian May, record company management kept pleading with the group to cut the single down, but Freddie Mercury refused. It got a big bump when Mercury's friend Kenny Everett played it on his Capital Radio broadcast before the song was released (courtesy of a copy Mercury gave him). This helped the single jump to #1 in the UK shortly after it was released.\nThere was a single version released only in France on a 7\", cut down to 3:18, edited by John Deacon, but beyond the initial pressing of this French single, the only version recognized is the album version, at 5:55. This little-heard French single started right at the piano intro, and edited out the operetta part. Brian May admitted that there may have been additional parts for the song on Freddie's notes, but they were apparently never recorded. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Ryan - Eaton, IN\n                                                  \n                                                  ",
    "Brian May recalled recording \"Bohemian Rhapsody\" in Q Magazine March 2008: \"That was a great moment, but the biggest thrill for us was actually creating the music in the first place. I remember Freddie coming in with loads of bits of paper from his dad's work, like Post-it notes, and pounding on the piano. He played the piano like most people play the drums. And this song he had was full of gaps where he explained that something operatic would happen here and so on. He'd worked out the harmonies in his head.\"",
    "In 1991, this was re-released in the UK shortly after Freddie Mercury's death. It again went to #1, with proceeds going to the Terrence Higgins Trust, which Mercury supported.",
    "Elton John performed this with Axl Rose at the 1992 \"Concert For Life,\" held in London at Wembley Stadium. It was a tribute to Freddie Mercury, who died of AIDS the year before. In 2001, Elton John got together with Eminem, who like Axl Rose, was often accused of being intolerant and homophobic. They performed Eminem's \"Stan\" at the Grammys.",
    "When this was re-released in the US, proceeds from the single went to the Magic Johnson AIDS Foundation. Johnson and Freddie Mercury were two of the first celebrities to get AIDS. Rock Hudson, who succumbed to the disease on October 2, 1985, was another.",
    "Thanks to this track, A Night At The Opera was the most expensive album ever made at the time. They used six different studios to record it, including Rockfield, a residential studio in the Welsh countryside where they also recorded most of the song \"Killer Queen.\" Queen did not use any synthesizers on the album, which is something they were very proud of.",
    "In an interview with Brian May and Roger Taylor on the Queen Videos Greatest Hits DVD, Brian said: \"What is Bohemian Rhapsody about, well I don't think we'll ever know and if I knew I probably wouldn't want to tell you anyway, because I certainly don't tell people what my songs are about. I find that it destroys them in a way because the great thing about about a great song is that you relate it to your own personal experiences in your own life. I think that Freddie was certainly battling with problems in his personal life, which he might have decided to put into the song himself. He was certainly looking at re-creating himself. But I don't think at that point in time it was the best thing to do so he actually decided to do it later. I think it's best to leave it with a question mark in the air.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Callum - Bendigo, Australia\n                                                  \n                                                  ",
    "A Night At The Opera was re-released as an audio DVD in 2002 with the original video included on the disc. Commentary from the DVD reveals that this song had started taking shape in the song \"My Fairy King\" on Queen's debut album. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n nathan - l-burg, KY\n                                                  \n                                                  ",
    "In 2002, this came in #1 in a poll by Guinness World Records as Britain's favorite single of all time. John Lennon's \"Imagine\" was #2, followed by The Beatles' \"Hey Jude.\"",
    "The name \"Bohemian\" in the song title seems to refer not to the region in the Czech republic, but to a group of artists and musicians living roughly 100 years ago, known for defying convention and living with disregard for standards. A \"Rhapsody\" is a piece of Classical music with distinct sections that is played as one movement. Rhapsodies often have themes. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n George - Dusseldorf, Germany\n                                                  \n                                                  ",
    "Roger Taylor (from 1000 UK #1 Hits by Jon Kutner and Spencer Leigh): \"Record companies both sides of the Atlantic tried to cut the song, they said it was too long and wouldn't work. We thought, 'Well we could cut it, but it wouldn't make any sense,' it doesn't make much sense now and it would make even less sense then: you would miss all the different moods of the song. So we said no. It'll either fly or it won't. Freddie had the bare bones of the song, even the composite harmonies, written on telephone books and bits of paper, so it was quite hard to keep track of what was going on.\"\nKutner and Leigh's book also states that, the recording included 180 overdubs, the operatic parts took over 70 hours to complete and the piano Freddie played was the same one used by Paul McCartney on \"Hey Jude.\"",
    "Ironically, the song that knocked this off the #1 chart position in the UK was \"Mama Mia\" by Abba. The words \"Mama mia\" are repeated in this in the line \"Oh mama mia, mama mia, mama mia let me go.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n James - St Albans, England\n                                                  \n                                                  ",
    "The story told in this song is remarkably similar to that in Albert Camus' book The Stranger. Both tell of a young man who kills, and not only can he not explain why he did it, he can't even articulate any feelings about it. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bob - Santa Barbara, CA\n                                                  \n                                                  ",
    "You can make the case that the song title is actually a parody, and a clever one at that. There is a rhapsody by the composer Franz Liszt called \"Hungarian Rhapsody,\" and \"Bohemia\" is a kingdom that is near Hungary and was part of the Austro-Hungarian Empire. Furthermore, \"Bohemian\" is an adjective for something unusual or against convention, and the song is just that.\nSo, \"Bohemian Rhapsody\" could be a clever title that not only parodies a famous work but also describes the song. In a nod to the Liszt composition, Queen would go on to release a live DVD/CD package in 2012 titled \"Hungarian Rhapsody,\" featuring their famous shows behind the Iron Curtain in Budapest on the Magic tour in 1986.",
    "This song was covered by Constantine M. (featuring the cast of We Will Rock You) and also by The Flaming Lips for the 2005 Queen Tribute album Killer Queen. Another popular cover is by Grey DeLisle, who did it as an acoustic ballad for her album Iron Flowers.",
    "Queen fans, and also Brian May, often colloquially refer to the song as \"Bo Rhap\" (or \"Bo Rap\").",
    "The name \"Bohemian Rhapsody\" makes many appearances in popular culture:\nSession 14 of the popular anime series Cowboy Bebop is named \"Bohemian Rhapsody.\"\nThe Jones Soda Company has a drink named \"Bohemian Raspberry\" in honor of this song.\nIn one of the episodes of the TV miniseries Dinotopia, a character cheats on a poem project by using the first part of the song as his entire project. The inhabitants, having never heard the song before, are amazed at the sound of it. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jonathon - Clermont, FL, for above 2\n                                                  \n                                                  ",
    "Neil Gaiman and Terry Pratchett used some of the lyrics in their book Good Omens. The main character (Crowley) plays it in his car all the time. They also refer to other Queen songs, but mostly \"Bohemian Rhapsody.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bella - Pretoria, South Africa\n                                                  \n                                                  ",
    "The Mexican group Molotov sampled the chorus for their Spanish-language rap version of this song called \"Rap, Soda and Bohemias.\" It appears on their 1998 album Molomix. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Juan - Brownsville, TX\n                                                  \n                                                  ",
    "In 2009, The Muppets Studio released a video featuring the Muppets performing this song. It was first web video for The Muppets, and it was extremely popular: the video was viewed over 7 million times the first week it was up. The furry ones changed the song a bit, omitting the lyrics that begin, \"Mama, just killed a man\" with Animal screaming \"Mama!\"",
    "In an interview with Q magazine March 2011, Roger Taylor was asked if this seemed like a peculiar song when Mercury first suggested it? He replied: \"No, I loved it. The first bit that he played to me was the verse. 'Mama, just killed a man, dah-dah-la-dah-daah, gun against his…' All that. I thought, 'That's great, that's a hit.' It was, in my head, a simpler entity then; I didn't know it was going to have a wall of mock Gilbert and Sullivan stuff, you know, some of which was written on the fly. Freddie would write these huge blocks of mass harmonies in the backs of phone books.\"",
    "The song is one of Freddie Mercury's great mysteries - according to everyone in the band, only he knew truly how it would come together, and according to some sources, its genesis could have come many years earlier. Chris Smith, the keyboard player in Mercury's first band Smile, claimed that Freddie would play several piano compositions at rehearsals, including one called \"The Cowboy Song,\" which started with the line, \"mama, just killed a man.\"",
    "In sharp contrast to the rest of the song's recording and composition, Brian May's signature solo before the opera section was recorded on only one track, with no overdubbing. He stated that he wanted to play \"a little tune that would be a counterpart to the main melody; I didn't just want to play the melody.\"\nIt is one of his finest examples of creating a solo in his mind before playing it on guitar; something he did many times throughout Queen's career. His reasoning was always that \"the fingers tend to be predictable unless being led by the brain.\"",
    "Weird Al Yankovic took the entire song and sung it to a polka tune, called simply \"Bohemian Polka,\" which is on his 1993 album Alapalooza. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Steph - SoCal, CA\n                                                  \n                                                  ",
    "Panic! At The Disco covered the song in 2016 for the Suicide Squad soundtrack, having previously played Queen's epic tune during their live shows. Frontman Brendon Urie told Beats 1's Zane Lowe: \n\"I know right that's a monster to tackle but it was so much fun. I love that song so much. We've been playing it live for a few years and it just made so much sense to try it. \nIt really just gave me a bigger respect for how that song was written. I mean the song was there, all the pieces were there. It was just figuring out each harmony piece by piece. But man, what a monster of a vocal song. It's so crazy there's just like thirty-four vocals stacked on top of each other. It's incredible. I know right that's a monster to tackle but it was so much fun. I love that song so much. We've been playing it live for a few years and it just made so much sense to try it.\"",
    "Panic! at the Disco's cover peaked at #64 on the Hot 100. It was the fourth version to reach the chart following Queen's original, The Braids from the High School High movie soundtrack (#42, 1996), and the Cast of Glee (#84, 2010).",
    "In the 2018 film Bohemian Rhapsody, Rami Malek stars as Freddie Mercury. In May, the trailer was released, showing some scenes where the song is discussed, including a part where they record \"the operatic section.\" There is also this exchange:\nRecord company executive: \"It goes on forever! It's six bloody minutes!\"\nMercury: \"I pity your wife if you think six minutes is forever.\"\nThat record company executive is played by Mike Myers, who revived the song in Wayne's World.",
    "The song made its third visit to the top 40 of the Hot 100 in November 2018 when it zoomed in at #33 following the release of the Bohemian Rhapsody soundtrack. This meant that \"Rhapsody\" had reached the Top 40 in three different decades ('70s, '90s and '10s), something only Prince has done before, with \"1999.\"",
    "Thanks to the film Bohemian Rhapsody, Queen had a big role at the 2019 Oscars ceremony. The band (with Adam Lambert on vocals) opened the show, performing \"We Will Rock You\" and \"We Are The Champions\"; Mike Myers and Dana Carvey introduced a tribute to the film with their scene from Wayne's World. The film was nominated for five awards, winning four: Leading Actor (Rami Malek), Film Editing, Sound Editing and Sound Mixing. It lost Best Picture to Green Book.",
    "Asked by Mojo magazine to account for the song's long-term appeal, Roger Taylor said: \"Like many operatic librettos, it's a universal story, dealing in tragedy. He's gonna be executed for murder, and he regrets it. But in the end he's philosophical about it.\""
  ],
  "lyrics": "Is this the real life?\nIs this just fantasy?\nCaught in a landslide\nNo escape from reality\nOpen your eyes\nLook up to the skies and see\nI'm just a poor boy\nI need no sympathy\nBecause I'm easy come, easy go\nLittle high, little low\nAny way the wind blows doesn't really matter to me, to me\n\nMama, just killed a man\nPut a gun against his head\nPulled my trigger, now he's dead\nMama, life had just begun\nBut now I've gone and thrown it all away\n\nMama, ooh\nDidn't mean to make you cry\nIf I'm not back again this time tomorrow\nCarry on, carry on\nAs if nothing really matters\n\nToo late, my time has come\nSends shivers down my spine\nBody's aching all the time\nGoodbye everybody, I've got to go\nGotta leave you all behind and face the truth\n\nMama, ooh (any way the wind blows)\nI don't wanna die\nI sometimes wish I'd never been born at all\n\nI see a little silhouetto of a man\nScaramouche, Scaramouche, will you do the Fandango?\nThunderbolt and lightning very very frightening me\nGallileo, Gallileo\nGallileo, Gallileo\nGallileo Figaro, magnifico\nI'm just a poor boy, nobody loves me\nHe's just a poor boy from a poor family\nSpare him his life from this monstrosity\nEasy come easy go, will you let me go?\nBismillah! No, we will not let you go (let him go)\nBismillah! We will not let you go (let him go)\nBismillah! We will not let you go (let me go)\nWill not let you go (let me go)\nNever, never, never, never let me go\nNo, no, no, no, no, no, no\nOh, mama mia, mama mia\nMama mia, let me go\nBeelzebub has a devil put aside for me\nFor me\nFor me\n\nSo you think you can stone me and spit in my eye?\nSo you think you can love me and leave me to die?\nOh, baby\nCan't do this to me, baby\nJust gotta get out, just gotta get right outta here\n\nOoooh, ooh yeah, ooh yeah\n\nNothing really matters\nAnyone can see\nNothing really matters\nNothing really matters to me\n\nAny way the wind blows\n                                                  \n                                                  Writer/s: Freddie Mercury \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Tratore\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "place": {
    "name": "Aurora, Illinois",
    "facts": [
      "Life is cyclical; it comes and goes in ebbs and flows. Nobody understands this more than those involved in the entertainment industry.  On Friday, you’ve got your screenplay optioned by a major studio or your band signed to a major record label, but by Monday the deal’s fallen through and the execs won’t even cross the street to shake your hand, let alone look at you. Although since its inception in 1970 through lead singer Freddie Mercury's death in 1991, Queen was mostly on the upswing as opposed to the other side of it, and 1992 saw a resurgence of popularity for the surviving members of the band that they never saw coming.",
      "From the small town of Aurora, Illinois, the fictitious characters of Wayne Campbell and Garth Algar, the hosts of the equally-fictitious cable-access show,",
      "blasted onto theater screens across the country. They came bearing gifts. Or one gift in particular: a killer scene of the main characters lip syncing along with Queen’s mega-hit from 17 years earlier, \"Bohemian Rhapsody.\" That summer, the song reached the No. 1 spot on the charts for the third time since its release, the previous two occurrences being in 1976 and 1991.",
      "Long before anyone ever heard of Wayne and Garth, the world was introduced to Brian May and Freddie Mercury.  Mercury joined Queen in 1970 after their previous lead singer left the group. He quickly took the reins, shifting the band’s direction toward a much more dramatic and flamboyant act (as well as their name). He insisted that the path to fame would be found in being the best performers in rock & roll. With his painted nails and crazy costumes, Mercury exuded a confidence and swagger on stage bringing Queen to the pinnacle of success by the time their third album,",
      ", hit the shelves in record stores.",
      "However, it was 1975’s",
      "that took the world by storm. Named after the Marx Brothers film of the same title,",
      "was the most expensive album ever produced at the time. A concept album to end all concept albums, Mercury strove to break all boundaries in both the composition and performance of the entire work. From \"The Prophet’s Song\" (and 8 minute epic) to \"Bohemian Rhapsody,\" the album was hailed as a masterpiece by most fans and critics.",
      "\"Rhapsody\" rested at #1 for nine weeks (the first time) and has since been voted the greatest song of all time more than once, not to mention the most expensive single ever made (at that time). The song itself is comprised of several sections as influenced by the multiple movements found in classical compositions. The opening \"ballad\" segment leads directly into the operatic section and the song is finished off with a heavy rock bit before a quick denouement that reprises the initial ballad. Mercury most likely intended the song to be a mock opera, and his use of double lyrical meaning has aided to the song’s popularity, as fans can interpret various subjects veiled and hidden between the lines.",
      "Mercury said (to",
      "magazine), “It’s one of those songs which has such a fantasy feel about it. I think people should just listen to it, think about it, and then make up their own minds as to what it says to them. 'Bohemian Rhapsody' didn’t just come out of thin air. I did a bit of research, although it was tongue-in-cheek. Why not?” On the surface, the tune’s guilt-ridden narrator is a young man who’s accidentally killed someone and sold his soul to the devil. On the night before his execution, he repents, appealing to God and the angels, who regain his soul and bring him to Heaven. Some interpret that Mercury embedded his own personal traumas into the lyrics, and they’re less about the Faustian narrator and more a vulnerable confession.",
      "Mercury and May rode out the song’s success for the next 10 years until they suddenly stopped touring in 1986. Many close friends began to notice Freddie’s gaunt appearance and the rumor began to spread. On November 23, 1991 Mercury confirmed on his deathbed that he had AIDS, and within 24 hours he’d died of bronchial pneumonia. The music world lost a giant that day and Mercury’s legacy continues over 20 years after his death and almost 40 since the initial release of \"Bohemian Rhapsody,\" which seems to rise up the charts with every new generation.",
      "And to parody the hosts of the fictional cable-access television show broadcasting out of Aurora, Illinois would say: \"Party on Freddie… Party on.\"",
      "~"
    ]
  },
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-685.jpg",
    "facts": "In 2006, Ben & Jerry's released a limited edition ice cream flavor called \"Bohemian Raspberry.\" With the tag line, \"I see a little silhouetto of a tub,\" and a crowned cow mooing \"Galileo, Galileo!\" on the label (but oddly, not \"Scaramoooooch\"). The Queen-inspired pint was filled with vanilla ice cream, fudge brownies, and raspberry swirls. Proceeds went to the Mercury Phoenix Trust, which was founded in honor of Freddie Mercury to support the global battle against HIV/AIDS."
  }
}