{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "Breakthru",
  "URL": "https://www.songfacts.com/facts/queen/breakthru",
  "Confidence": 1.0,
  "youtube-id": "CEjU9KVABao",
  "facts": [
    "\"Breakthru\" is two songs joined together. The slow vocal harmony during the first half minute was originally \"A New Life Is Born,\" an unreleased song written by Freddie Mercury. The remainder of the song is \"Breakthru,\" written by Roger Taylor with some contributions from the rest of the band. Freddie Mercury said, \"Breakthru stemmed from Roger, really; it's basically his track.\"",
    "In the music video the boys are riding a train while performing. Brian May said on Queen's Greatest Video Hits 2 that he'd been feeling sick and depressed that week and making the video had lifted his spirits. The band agreed that it was a nice interlude from studio work. Roger Taylor's girlfriend Debbie appears in the clip. \nThe loco used is a preserved ex-Great Western Railway, number 3822, from the Nene Valley Railway, which also was the setting for the video - except for segments on the platform, which were filmed at Didcot Railway Centre. The train traveled anywhere between 30 and 60 MPH during filming, which meant the band had to be insured (to the tune of £2 million!) against bodily damage in event of an accident, especially considering they were filming on an open-top carriage."
  ],
  "lyrics": "When love breaks up\nWhen the dawn light wakes up\nA new life is born\nSomehow I have to make this final breakthrough\nNow\n\nI wake up\nFeel just fine\nYour face\nFills my mind\nI get religion quick\n'Cause you're looking divine\nHoney, you're touching something; you're touching me\nI'm under your thumb, under your spell, can't you see?\n\nIf I could only reach you\nIf I could make you smile\nIf I could only reach you\nThat would really be a breakthrough, oh yeah\n\nBreak through these barriers of pain\nBreak through to the sunshine from the rain\nMake my feelings known towards you\nTurn my heart inside and out for you now\nSomehow I have to make this final breakthrough\nNow, oh yeah\n\nYour smile speaks books to me\nI break up\nWith each and every one of your looks at me\nHoney, you're starting something deep inside of me\nHoney, you're sparking something this fire in me\nI'm outta control\nI want to rush headlong into this ecstasy\n\nIf I could only reach you\nIf I could make you smile\nIf I could only reach you\nThat would really be a breakthrough\n\nIf I could only reach you\nIf I could make you smile\nIf I could only reach you\nThat would really be a breakthrough\nOh yeah\nBreakthrough, breakthrough\n\nIf I could only reach you\nIf I could make you smile\nIf I could only reach you\nThat would really be a breakthrough\n\nIf I could only reach you\nIf I could make you smile\nIf I could only reach you\nThat would really be a breakthrough\n\nBreakthrough\n                                                  \n                                                  Writer/s: BRIAN MAY, FREDDIE MERCURY, JOHN DEACON, ROGER TAYLOR \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}