{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Crazy Little Thing Called Love",
  "URL": "https://www.songfacts.com/facts/queen/crazy-little-thing-called-love",
  "Confidence": 1.0,
  "youtube-id": "zO6D_BAuYCI",
  "facts": [
    "Freddie Mercury wrote this while Queen were recording The Game in Germany. He wrote it while taking a bubble bath in his room at the Munich Hilton. Peter Hince, the head of Queen's road crew, recalled to Mojo magazine September 2009: \"The idea for the song came to him while he was in the bath. He emerged, wrapped in a towel, I handed him the guitar and he worked out the chords there and then. Fred had this knack of knowing a great pop song.\" \nFreddie acknowledged that perhaps his limited talent on the guitar helped shape the song: \"'Crazy Little Thing Called Love' took me five or ten minutes. I did that on the guitar, which I can't play for nuts, and in one way it was quite a good thing because I was restricted, knowing only a few chords. It's a good discipline because I simply had to write within a small framework. I couldn't work through too many chords and because of that restriction I wrote a good song, I think.\"",
    "This sounded a lot more like Elvis Presley than Queen. It was a different sound for the group, but their fans loved it.",
    "This was the first song on which Freddie Mercury played rhythm guitar. He was keen to keep the song minimal, despite his limited guitar knowledge, and producer Mack claimed that he rushed into the studio to record it \"before Brian could get there!\"\nHe also played the guitar solo on the original recording, but the tapes were lost so Brian May played the solo instead, using a Fender Telecaster to achieve the period sound. May didn't seem to like playing another guitar, and even when playing live, after performing the solo on the Telecaster he would immediately switch back to his Red Special.",
    "At first, this was not released in the US. Since the album was not out yet, radio stations there started playing import copies of the single. This led Queen's record company to release it in America, about 3 months after it came out in England.",
    "Mercury's name is in the lyrics. He sings, \"Are you ready,\" and the band sings, \"Ready Freddie.\"\nThis section took on a poignant edge after Mercury's death when the song was performed with guest singers, as the lyric was never altered regardless of the vocalist. Fans would take this opportunity to bellow the 'Ready, Freddie!' lyric back at the band in remembrance of the singer.",
    "On stage, this was an important part of the show. Brian May often used three different guitars during the song: the first verse was played by Freddie alone with his guitar, then Brian joined with another Ovation Acoustic; before the third verse he had already switched to a Telecaster on which he performed the solo. During the singalong part (famous for its \"ready Freddie\" line) Brian again changed instruments to his homemade Red Special. From 1984 onwards Mercury replaced the acoustic with another Telecaster.",
    "The single was very successful for the band, hitting #2 in the UK and becoming their first US #1 hit, There's an unconfirmed legend (commented on by Roger Taylor on the radio show In The Studio, and by Brian May on his website) that declares John Lennon was inspired by this song to go back to the music business. Whether it's true or false is still unknown, but it is a fact that Lennon listened to Queen and he did try new influences on his Double Fantasy album. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Sebas - Tokyo, Japan, for above 2\n                                                  \n                                                  ",
    "Josh Kelley recorded this for the 2005 Queen tribute album Killer Queen. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Rachel - South Point, OH\n                                                  \n                                                  "
  ],
  "lyrics": "This thing called love, I just can't handle it\nThis thing called love, I must get round to it\nI ain't ready\nCrazy little thing called love\n\nThis thing (this thing)\nCalled love (called love)\nIt cries (like a baby)\nIn a cradle all night\nIt swings (woo woo)\nIt jives (woo woo)\nIt shakes all over like a jelly fish\nI kinda like it\nCrazy little thing called love\n\nThere goes my baby\nShe knows how to rock 'n' roll\nShe drives me crazy\nShe gives me hot and cold fever\nThen she leaves me in a cool cool sweat\n\nI gotta be cool, relax, get hip\nAnd get on my track's\nTake a back seat, hitch-hike\nAnd take a long ride on my motorbike\nUntil I'm ready\nCrazy little thing called love\n\nI gotta be cool, relax, get hip\nAnd get on my track's\nTake a back seat (ah hum), hitch-hike (ah hum)\nAnd take a long ride on my motorbike\nUntil I'm ready (ready Freddie)\nCrazy little thing called love\n\nThis thing called love, I just can't handle it\nThis thing called love, I must get round to it\nI ain't ready\nOoh ooh ooh ooh\n\nCrazy little thing called love\nCrazy little thing called love, yeah, yeah\nCrazy little thing called love, yeah, yeah\nCrazy little thing called love, yeah, yeah\nCrazy little thing called love, yeah, yeah\nCrazy little thing called love, yeah, yeah\nCrazy little thing called love, yeah, yeah\nCrazy little thing called love, yeah, yeah\nCrazy little thing called love, yeah, yeah\nCrazy little thing called love, yeah, yeah\n                                                  \n                                                  Writer/s: Freddie Mercury \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}