{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Don't Stop Me Now",
  "URL": "https://www.songfacts.com/facts/queen/dont-stop-me-now",
  "Confidence": 1.0,
  "youtube-id": "HgzGwKwLmgM",
  "facts": [
    "Freddie Mercury wrote this song - both words and music - in Montreux, Switzerland. It finds him feeling unstoppable: he's \"floating around in ecstasy,\" \"like a tiger defying the laws of gravity,\" and \"traveling at the speed of light.\"\nThe song is quite empowering, but it's also clear that Mercury is throwing caution to the wind and putting himself in danger:\nI am a satellite, I'm out of control\nI am a sex machine ready to reload\nAfter Mercury died of AIDS-related causes in 1991, it became clear that his hedonism during this period caught up with him. Brian May told Mojo that he struggled with the lyrics because it was about a detrimental time in Mercury's life, when he was \"taking lots of drugs and having sex with lots of men.\"",
    "Brian May shared his thoughts on this song when he spoke with Absolute Radio in 2011: \"I thought it was a lot of fun, but I did have an undercurrent feeling of, 'aren't we talking about danger here,' because we were worried about Freddie at this point. That feeling lingers, but it's become almost the most successful Queen track as regards to what people play in their car or at their weddings. It's become a massive, massive track and an anthem to people who want to be hedonistic. It was kind of a stroke of genius from Freddie.\"",
    "The song is a plot point in the 2004 movie Shaun of the Dead. During a zombie attack, it plays on the jukebox at an inopportune time. While some of the characters try to fight off a zombie, another attempts to \"kill the Queen\" to silence the song.\nOther films that have used \"Don't Stop Me Now\" include:\nBlackball (2003)\nAmigos... (2011)\nHardcore Henry (2015)",
    "In 2005, viewers of the BBC television program Top Gear named this \"Greatest Driving Song Ever.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The Jazz album had a mix of many different styles of music, although none of them were actually jazz. It got to #6 on the US Albums chart and made #2 in the UK.",
    "In 2006 a cover by McFly for the Sport Relief telethon was a #1 hit in the UK. It was notionally the lead track on the single. However though it was indeed the lead track on the 2-track CD single, on the other formats, maxi CD and DVD, \"'Please Please\" was featured as Track 1. The latter song was rumored to be about actress Lindsay Lohan. ",
    "At the beginning of 2007, the UK chart rules changed allowing all digital downloads, whether or not they had a physical equivalent, to chart. This song was one of the beneficiaries of the new rules, maintaining a Top 200 presence all the way through 2007. Despite the fact it never made the Top 75 in all that time, \"Don't Stop Me Now\" still sold 53,000 copies and was the 160th best-selling single of 2007. Incredibly, this was 3,000 copies more than McFly's #1 hit \"Baby's Coming Back.\"",
    "Numerous TV series have used this song. Among them:\nAmerican Dad! (\"Roger 'n' Me\" - 2006)\nSkins (\"Cook\" - 2009)\nNip/Tuck (\"Dan Daly\" - 2010)\nGlee (\"Diva\" - 2013)\nDoctor Who (\"Mummy on the Orient Express\" - 2014, \"Hell Bent\" - 2015)",
    "This is used as the theme song of the UK TV show Al Murray's Happy Hour, which ran 2007-2009. On the show, Al Murray had a band on each week that would perform a Queen song at the end of the show. On the fourth show, McFly sang \"Don't Stop Me Now.\"",
    "This returned to the UK charts in 2008 after being featured in the Cadbury's Dairy Milk truck race advert.",
    "This song was used in a commercial for the Google Photos App that aired during the 2016 Rio Olympics. In the spot, memorable moments are interrupted by an error message saying \"Storage Full.\" Google offers to solve the problem by backing up photos to free up space.",
    "Freddie Mercury wrote \"Don't Stop Me Now\" on the piano. Roger Taylor told Mojo magazine in 2019:  \"I don't necessarily think it's one of our best songs, but I love the sentiment 'call me Mr. Fahrenheit.' It's hilarious and it's become a sort of rallying cry.\"",
    "In 2011, Queen fans voted the chorus of \"Don't Stop Me Now\" as the band's best ever lyric. The survey, conducted by HMV, found they liked the lyric \"Don't stop me now, I'm having such a good time, I'm having a ball\" best. The second favorite lyric came from \"The Show Must Go On\" and was \"My soul is painted like the wings of butterflies, fairy tales of yesterday will grow but never die, I can fly my friends.\""
  ],
  "lyrics": "Tonight\nI'm gonna have myself a real good time\nI feel alive\nAnd the world, I'll turn it inside out, yeah\nAnd floating around\nIn ecstasy\n\nSo, don't stop me now\nDon't stop me\n'Cause I'm having a good time\nHaving a good time\n\nI'm a shooting star leaping through the sky\nLike a tiger defying the laws of gravity\nI'm a racing car passing by\nLike Lady Godiva\nI'm gonna go go go\nThere's no stopping me\n\nI'm burning through the sky, yeah\n200 degrees\nThat's why they call me Mr. Fahrenheit\nI'm travelling at the speed of light\nI wanna make a supersonic man out of you\n\nDon't stop me now\nI'm having such a good time\nI'm having a ball\nDon't stop me now\nIf you wanna have a good time\nJust give me a call\n\nDon't stop me now\n'Cause I'm having a good time\nDon't stop me now\nYes, I'm having a good time\nI don't want to stop at all, yeah\n\nI'm a rocket ship on my way to Mars\nOn a collision course\nI am a satellite, I'm out of control\nI am a sex machine ready to reload\nLike an atom bomb about to oh oh oh oh oh explode\n\nI'm burning through the sky, yeah\n200 degrees\nThat's why they call me Mister Fahrenheit\nI'm travelling at the speed of light\nI wanna make a supersonic woman of you\n\nDon't stop me, don't stop me\nDon't stop me, hey hey hey\nDon't stop me, don't stop me\nOoh ooh ooh, I like it\nDon't stop me, don't stop me (alright)\nHave a good time, good time\nDon't stop me, don't stop me\nAh, let loose, honey, alright\n\nOh, I'm burning through the sky, yeah\n200 degrees\nThat's why they call me Mister Fahrenheit (hey)\nI'm travelling at the speed of light\nI wanna make a supersonic man out of you (hey hey)\n\nDon't stop me now\nI'm having such a good time\nI'm having a ball\nDon't stop me now\nIf you wanna have a good time (alright)\nJust give me a call\n\nDon't stop me now\n'Cause I'm having a good time (hey hey)\nDon't stop me now\nYes, I'm having a good time\nI don't wanna stop at all\n\nHa da da da dah\nDa da da ha\nHa da da ha ha ha\nHa da da, ha da da ahh\n                                                  \n                                                  Writer/s: Mentor R. Williams \n\n                                                   Publisher: Universal Music Publishing Group\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}