{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Fat Bottomed Girls",
  "URL": "https://www.songfacts.com/facts/queen/fat-bottomed-girls",
  "Confidence": 1.0,
  "youtube-id": "VMnjF1O4eH0",
  "facts": [
    "Queen guitarist Brian May wrote this song, which is about a young man who comes to appreciate women of substantial girth. May told Mojo magazine October 2008: \"I wrote it with Fred in mind, as you do especially if you've got a great singer who likes fat bottomed girls… or boys.\"",
    "This was released as a double A-side single with \"Bicycle Race.\" The songs ran together on the album, and were often played that way by radio stations. The year before, Queen released \"We Will Rock You\" and \"We Are The Champions\" as a double A-side. They are still usually played together by radio stations.\nEach song has a reference to the other in the lyrics: in \"Bicycle Race,\" a lyric runs: \"Fat bottomed girls, they'll be riding today, so look out for those beauties, oh yeah.\" In \"Fat Bottomed Girls\" the closing call shouts \"get on your bikes and ride!,\" linking the two songs together.",
    "The cover of the single featured a nude woman riding a bicycle, and was altered after many stored refused to stock it. The new version was the same image with panties drawn over the woman.",
    "This song was covered by Antigone Rising for the 2005 Queen tribute album Killer Queen. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Rachel - South Point, OH\n                                                  \n                                                  ",
    "The song was used as the opening theme for Morgan Spurlock's 2004 documentary Super Size Me.",
    "This was used in episodes of the US TV shows Nip/Tuck and My Name is Earl, and also in the UK show Father Ted. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France, for above 2\n                                                  \n                                                  ",
    "A funny incident involving this song occurred on the Daily Politics show on UK TV in January 2014, when respectable political editor Nick Robinson's iPad suddenly started to play the song midway through a panel discussion between several politicians. Robinson hastily turned the device off before - in his words - \"the really embarrassing lyrics start.\"",
    "This is one of a very small number of Queen songs composed and performed in an alternative tuning to standard. Brian May used a Dropped D tuning for this song.",
    "Surprisingly for such a popular song, it only features on one Queen live compilation from the original lineup: On Fire Live at the Bowl, from Milton Keynes 1982. On the Queen + tours, it has been a regular staple, with both Paul Rogers and Adam Lambert handling the lyrics with gusto. Versions featuring Paul Rogers on vocals appear on Return of the Champions (2005), Super Live in Japan (2006) and Live in Ukraine (2008).",
    "Kevin Fowler did his rendition of the classic Queen song on his 2002 album High on the Hog. Fowler's version is a lighthearted take and encourages the crowd to partake in the fun. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jesse - Dallas, TX\n                                                  \n                                                  ",
    "Mojo asked Brian May how gay icon Freddie Mercury could deliver such a convincing heterosexual performance on this song. He replied:\n\"On the face of it, it's a heterosexual song because it's called 'Fat Bottomed Girls,' but I was totally aware of Freddie's proclivities and the fact he was going to sing it. Plus, some of the inspiration for the song came from stuff that I saw in Freddie's life as well as my own. So it's actually not so much of a heterosexual song as you might think (laughs). It's a sort of pansexual song. There are so many ways you can take it.\""
  ],
  "lyrics": "Oh, are you gonna take me home tonight?\nOh, down beside that red firelight\nOh, are you gonna let it all hang out?\nFat bottomed girls, you make the rocking world go 'round\n\nHey\nI was just a skinny lad\nNever knew no good from bad\nBut I knew life before I left my nursery, huh\nLeft alone with big fat Fanny\nShe was such a naughty nanny\nHeap big woman, you made a bad boy out of me\n\nHey hey\nI've been singing with my band\nAcross the wire, across the land\nI seen every blue eyed floozy on the way, hey\nBut their beauty and their style\nWent kind of smooth after a while\nTake me to them dirty ladies every time\n\nC'mon\nOh, won't you take me home tonight?\nOh, down beside your red firelight\nOh, and you give it all you got\nFat bottomed girls, you make the rocking world go 'round\nFat bottomed girls, you make the rocking world go 'round\n\nHey, listen here\nNow I got mortgages on homes\nI got stiffness in my bones\nAin't no beauty queens in this locality, I tell you\nOh, but I still get my pleasure\nStill got my greatest treasure\nHeap big woman, you done made a big man of me\n\nNow, get this\nOh, (I know)\nYou gonna take me home tonight? (please)\nOh, down beside that red firelight\nOh, are you gonna let it all hang out?\nFat bottomed girls, you make the rocking world go 'round, yeah\nFat bottomed girls, you make the rocking world go 'round\n\nGet on your bikes and ride\nOoh yeah, oh yeah, them fat bottomed girls\nFat bottomed girls\nYeah yeah yeah\nAlright, ride 'em, come on\nFat bottomed girls, yes yes\n                                                  \n                                                  Writer/s: Brian Harold May \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}