{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Flash",
  "URL": "https://www.songfacts.com/facts/queen/flash",
  "Confidence": 1.0,
  "youtube-id": "LfmrHTdXgK4",
  "facts": [
    "This was the theme tune for the 1980 comic-book movie Flash Gordon. It captured perfectly the tongue-in-cheek element of the film. Among the snippets of dialogue that can be heard is the actor Brian Blessed delivering the line, \"Gordon's alive!\"",
    "This was sung as a duet between Freddie Mercury and Brian May with drummer Roger Taylor supplying the high harmonies.",
    "This song was used as the basis for Will Ferrell and Jon Heder's final routine in the 2007 comedy Blades of Glory.",
    "Queen wrote the entire soundtrack to the movie. Drummer Roger Taylor explained to Mojo magazine October 2008: \"We wanted to write the first rock 'n' roll soundtrack to a non-music film. At the time, rock 'n' roll was not used in movies unless they were specifically about music.\"\nBrian May added: \"We wanted a soundtrack album that made you feel like you'd watched the film so we shipped in all the dialogue and effects and wove it together like tapestry.\"\nThis approach has influenced the way soundtrack albums are released, as now it is commonplace to include dialogue lines from the film and other quotes on soundtrack albums. Good examples are the soundtracks to Life on Mars, Ashes to Ashes, Pulp Fiction, Reservoir Dogs, Shaun of the Dead and Hot Fuzz.",
    "Initial live performance versions of the song were performed sporadically across 1981, and a fully live version appears on the Rock Montreal live CD/DVD package, played back to back with \"The Hero\" - also from the Flash Gordon soundtrack. After that the song wasn't played live as such, but was often used as a way of introducing the band onstage; \"Flash\" would play on tape and the band would come crashing in as the curtain raised around the \"He save with a mighty hand, every man, every woman, every child, with a mighty Flash!\" lines.\nThis was the case during 1982 (and is shown to great effect on the On Fire: Live at the Bowl live release), and Queen revived this intro for their first tour with Adam Lambert in 2012.",
    "This song was used in 2016 commercials for the Supercell game Clash Royale that aired during the Rio Olympics. In the spot, an '80s looking guy at a keyboard explains that all duels must have \"appropriately epic music.\" We then see game play over a version of this song with the lyric altered to \"Clash Royale.\"",
    "Not everybody liked Queen's recording. Brian May recalled the story of the song to The Independent March 23, 2012: \n\"We were engaged to do the job by Mike Hodges who was the director of Flash [Gordon] and Dino De Laurentiis, who was that famous Italian film producer who always thought big and some people would have said didn't have any subtlety. But, in fact, he had a sense of something unusual. He made that huge remake of King Kong – billions of dollars – but the combination of him and Mike Hodges was very odd because for Dino it was a very serious film engaging the top-level talent in Italy and to Mike it was a spoof.\nSo there was this clash, and I'm pretty sure it was Mike's idea to engage us for the job and what happened was we went in and saw some of the rushes of the film and loved it, and we all went away and made some demos separately, Roger, John, Freddie and me, and there came a day when we all got in the studio and played them back to Mike and to Dino and asked: 'This is what we've come up with. What do you think?' There was a horrible moment when Mike jumped up and down saying, 'it's brilliant, it's brilliant', and Dino sat there with a face ashen and white as a sheet and obviously didn't enjoy it, and when it came to the theme I had written – you know, 'Flash' – well, Dino said: 'It's very good but it is not for my movie.'\nSo we all got a bit glum and went away. But what I think happened was Mike went to Dino and said: 'You got to have faith here. This is something that is going to work and Brian has actually captured the essence of the movie in this piece of music.' But it was a big adventure in those days. I don't think there had ever been a feature film with background music done by a rock band before – it was a real dangerous departure. You had to have your base of strings to create emotion. It had never been done. And to his credit, Dino did come around and was very supportive.\""
  ],
  "lyrics": "Flash! Ah-ah\nSavior of the universe\n\nFlash! Ah-ah\nHe'll save everyone of us\n\n(Seemingly, there is no reason for these extraordinary intergalactical upsets)\n(What's happening, Flash?)\n(Only Doctor Hans Zarkov, formerly at NASA, has provided any explanation)\n\nFlash! Ah-ah\nHe's a miracle\n\n(This morning's unprecedented solar eclipse is no cause for alarm)\n\nFlash! Ah-ah\nKing of the impossible\n\nHe's for every one of us\nStand for every one of us\nHe saves with a mighty hand\nEvery man, every woman\nEvery child, it's the mighty Flash\n\n(General Kala, Flash Gordon approaching)\n(What do you mean Flash Gordon approaching?\n(Open fire! All weapons!)\n(Dispatch war rocket Ajax to bring back his body)\n\nFlash! Ah-ah\n(Gordon's alive!)\n\nFlash! Ah-ah\nHe'll save every one of us\n\nJust a man with a man's courage\nYou know he's nothing but a man\nAnd he can never fail\nNo one but the pure at heart\nMay find the Golden Grail\nOh-oh, oh-oh\n\n(Flash, Flash, I love you, but we only have fourteen hours to save the Earth!)\nFlash\n                                                  \n                                                  Writer/s: Brian Harold May \n\n                                                   Publisher: Warner Chappell Music, Inc.\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}