{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Good Old-Fashioned Lover Boy",
  "URL": "https://www.songfacts.com/facts/queen/good-old-fashioned-lover-boy",
  "Confidence": 1.0,
  "youtube-id": "PI3LAgGBxqU",
  "facts": [
    "This song, which was written by Freddie Mercury, features sound engineer and co-producer Mike Stone taking over the lead vocals for one line: \"Hey, boy, where'd you get it from? Hey, boy, where did you go?\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Gian Maria - Udine, Italy\n                                                  \n                                                  ",
    "Discussing the song in an interview with Kenny Everett on his radio show, Freddie Mercury described the song thus: \"It's in my 'ragtime' mood that I get a chance to, [Laughs] to do on every album and this time, this is something I've come up with this time around.\" \nThis links to his comments about \"Seaside Rendezvous\" about wanting to do more 'vaudeville' style songs in the future (\"Seaside Rendezvous was featured on previous album A Night At The Opera). Everett described it as \"a little frilly number from the pen of Fred.\"\nOn an aside, Everett is an important part of Queen history - when \"Bohemian Rhapsody\" was first proposed as a single, Queen's record company refused to put it out, and demanded a cut-down version be produced. One was actually made, but the band eventually stood firm and insisted they wanted the full-length version to go out, and were backed by manager John Reid. Everett visited the studio where they were recording, heard \"Bohemian Rhapsody\" and fell in love with it. He then stole a copy (stories vary on whether he was given a copy or stole one) of the song, and played it intensely on his radio show across one weekend - which helped break the song and make it a huge hit before it was even officially released."
  ],
  "lyrics": "I can dim the lights and sing you songs full of sad things\nWe can do the tango just for two\nI can serenade and gently play on your heart strings\nBe your Valentino just for you\n\nOoh love ooh loverboy\nWhat're you doin' tonight, hey boy\nSet my alarm, turn on my charm\nThat's because I'm a good old-fashioned lover boy\n\nOoh let me feel your heartbeat (grow faster, faster)\nOoh ooh can you feel my love heat, ooh\nCome on and sit on my hot-seat of love\nAnd tell me how do you feel right after-all\nI'd like for you and I to go romancing\nSay the word, your wish is my command\n\nOoh love ooh loverboy\nWhat're you doin' tonight, hey boy\nWrite my letter\nFeel much better\nAnd use my fancy patter on the telephone\n\nWhen I'm not with you\nI think of you always\n(I miss those long hot summer nights) I miss you\nWhen I'm not with you\nThink of me always\nLove you, love you\n\nHey boy where do you get it from\nHey boy where did you go?\nI learned my passion in the good old fashioned school of loverboys\n\nDining at the Ritz, we'll meet at nine precisely\n(One two three four five six seven eight nine o' clock)\nI will pay the bill, you taste the wine\nDriving back in style, in my saloon will do quite nicely\nJust take me back to yours that will be fine (come on and get it)\n\nOoh love, (there he goes again just like a good old-fashioned lover boy)\nOoh loverboy\nWhat're you doin' tonight, hey boy\nEverything's all right\nJust hold on tight\nThat's because I'm a good old-fashioned fashioned lover boy\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}