{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "Hammer To Fall",
  "URL": "https://www.songfacts.com/facts/queen/hammer-to-fall",
  "Confidence": 1.0,
  "youtube-id": "JU5LMG3WFBw",
  "facts": [
    "Queen guitarist Brian May wrote this song, and it is often speculated by those in the Queen camp that he wrote heavy rockers like this and \"Tear It Up\" in response to the band experimenting with synths more on tracks like \"I Want to Break Free,\" where notably he was forced to back down and have a synth solo rather than a guitar solo. Perhaps in frustration he wrote such straightforward rock songs like \"Hammer To Fall.\"",
    "It's easy to assume the song is purely about the end of the world and the Cold War escalating (with the \"hammer\" of the title referring to the hammer and sickle of the USSR emblem, and references to \"in the shadow of the mushroom cloud\"), but in fact the song is more about life and death in general, and how it comes to us all and does not discriminate (\"Rich or poor or famous, for your truth is all the same\", \"Comes to you as to us all, now it's time for the Hammer to Fall\"). \nBrian May confirmed the meaning on his website in 2004, when he noted, \"The hammer coming down is only a symbol of the Grim Reaper doing his job!\"",
    "A wildly energetic rocker, this song quickly became a fan favorite live and settled into the band's lineup alongside similar songs like \"Tear It Up,\" \"Seven Seas of Rhye,\" \"Fat Bottomed Girls\" and \"Tie Your Mother Down.\" It featured prominently on the Works and Magic tours, and was the third song in their six-song setlist at Live Aid in 1985. A highlight for many of Queen's Live Aid performance is Freddie Mercury breaking off halfway through the second verse to do an impromptu ballet dance with a BBC cameraman.\nThe song also featured in many of Brian May's solo sets in the 1990s, being a set closer on his 1993 Live at Brixton Academy album, and made a strong return during the Queen+Paul Rodgers tours, with the powerful rock vocals suiting Rodgers' bluesy style. On the Return of the Champions tour in 2005, the first 2/3s of the song were performed in a bluesy ballad style, with May kicking back into the original rock arrangement just before the \"Rich or poor or famous...\" bridge.",
    "This plays in the season 2 Stranger Things episode \"The Spy\" when Steve and Dustin are en route to capture Dustin's unusual pet."
  ],
  "lyrics": "\"Hey, hey, hey, hey, hey\nHammer To Fall\"\n\nHere we stand, here we fall\nHistory don't care at all\nMade the bed, light the light\nLady Mercy won't be home tonight\n\nYou don't waste no time at all\nDon't hear the bell but you answer the call\nIt comes to you as to us all\nYeah, and it's time for the hammer to fall\n\nOh every night, and every day\nA little piece of you is falling away\nBut lift your face the Western way\nBuild your\n\nTow the line and play their game\n'Til the anesthetic covers it all\n'Til one day they call your name\nWhen it's time for the hammer to fall\n\nRich or poor or famous \nFor your truth it's all the same\n(Oh no, oh no)\nLock your door 'cause rain is pouring\nThrough your window pane\n(Oh no)\nBaby, now your trouble's all in vain, yeah\n\nFor you who grew up tall and proud\nIn the shadow of the mushroom cloud\nConvinced our voices can't be heard\nJust wanna scream it louder and louder and louder\n\nWhat the hell are we fighting for?\nJust surrender and it won't hurt at all\nJust got time to say your prayers\nThen it's time for the hammer to, hammer to fall\n\nYeah, to fall\n\nHey, hey\nHey, hey\nHey, yeah\nOne more time\n\nWaiting for the hammer to fall\n\nGive it to me one more time\n                                                  \n                                                  Writer/s: Brian May \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}