{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "Headlong",
  "URL": "https://www.songfacts.com/facts/queen/headlong",
  "Confidence": 1.0,
  "youtube-id": "zhyaAPsT1LU",
  "facts": [
    "Guitarist Brian May wrote this for his solo album, but when he listened to Freddie Mercury singing it, he decided to record it with Queen. He and his bandmates re-wrote the song, each earning a songwriting credit.",
    "This song is about rushing into things without proper preparation. Rushing into something headlong is like jumping into something head first without thinking about consequences. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "And you're rushing headlong you've got a new goal\nAnd you're rushing headlong out of control\nAnd you think you're so strong\nBut there ain't no stopping and there's nothin'\nYou can do about it\nNothin' you can do\nNo there's nothin' you can do about it\nNo there's nothin' you can, nothin' you can\nNothin' you can do about it\n\nAnd you're rushing headlong you've got a new goal\nAnd you're rushing headlong out of control\nAnd you think you're so strong\nBut there ain't no stopping no there's nothin'\nYou can do about it\nYeah\n\nHey, he used to be a man with a stick in his hand\nHoop diddy diddy hoop diddy do\nShe used to be a woman with a hot dog stand\nHoop diddy diddy hoop diddy do\nNow you've got soup in the laundry bag\nNow you've got strings, you're gonna lose your rag\nYou're gettin' in a fight\nThen it ain't so groovy when you're screaming in the night\nLet me out of this cheap 'B' movie\nHeadlong down the highway and you're rushing\nHeadlong out of control\nAnd you think you're so strong\nBut there ain't no stopping and you can't stop rockin'\nAnd there's nothin' you can, nothin' you can\nNothin' you can do about it\n\nWhen a red hot man meets a white hot lady\nHoop diddy diddy hoop diddy do (ho)\nSoon the fire starts a raging gets 'em more than half crazy\nHoop diddy diddy hoop diddy do\nOh, now they start freaking everyway you turn\nYou can't start walking 'cause your feet got burned\nIt ain't no time to figure wrong from right\n'Cause reasons out the window\nBetter hold on tight, you're rushing headlong\nHeadlong out of control, yeah\nYou think you're so strong\nThere ain't no stopping and there's nothin' you, nothin' you\nNothin' you can do about it at all\nYeah yeah alright go\nAnd you're rushing headlong down the highway\nAnd you're rushing headlong out of control\nAnd you think you're so strong\nBut there ain't no stopping\nThere's nothin', nothin', nothin' you can do about it, yeah\nOoh ooh ooh ooh ooh\nHa ha\nHeadlong\nYeah yeah\nHeadlong\nYeahaw\nHeadlong\nGnoldaeh gnoldaeh gnoldaeh gnoldaeh\n                                                  \n                                                  Writer/s: BRIAN MAY, FREDDIE MERCURY, JOHN DEACON, ROGER TAYLOR \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}