{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "I'm Going Slightly Mad",
  "URL": "https://www.songfacts.com/facts/queen/im-going-slightly-mad",
  "Confidence": 1.0,
  "youtube-id": "Od6hY_50Dh0",
  "facts": [
    "Queen frontman Freddie Mercury wrote this song in which he describes a descent into madness. It has a lighthearted feel, as if turning daffy might not be such a bad thing.\nWhen he recorded it, Mercury had his wits about him, but he was nearing the end of his life, suffering from AIDS. He was in ill-health when he worked on the Innuendo album, but determined to keep making music. The album was released in February 1991; Mercury died that November and didn't announce his sickness until the day before. News of his death put the song in a different context, as the madness he sang about was likely related to his impending death.",
    "Freddie Mercury wrote this in London with some help from his friend, the actor Peter Straker, who suggested some of the lyrics. The pair traded lines back and forth, developing the various idioms for insanity (\"You're missing that one final screw,\" \"One wave short of a shipwreck,\" etc.).",
    "The song was released as a single in the UK and a video was made to promote it. Shot in black and white and directed by the Austrian team of Rudi Dolezal and Hannes Rossacher, Mercury appears as kind of a deranged Charlie Chaplin, with his Queen bandmates showing up in other absurd guises. It was one of his last on-camera performances."
  ],
  "lyrics": "When the outside temperature rises\nAnd the meaning is oh so clear\nOne thousand and one yellow daffodils\nBegin to dance in front of you, oh dear\nAre they trying to tell you something?\nYou're missing that one final screw\nYou're simply not in the pink my dear\nTo be honest you haven't got a clue\nI'm going slightly mad\nI'm going slightly mad\nIt finally happened, happened\nIt finally happened, ooh woh\nIt finally happened, I'm slightly mad\nOh dear \n\nI'm one card short of a full deck\nI'm not quite the shilling\nOne wave short of a shipwreck\nI'm not my usual top billing\nI'm coming down with a fever\nI'm really out to sea\nThis kettle is boiling over\nI think I'm a banana tree\nOh dear\nI'm going slightly mad\nI'm going slightly mad (I'm going slightly mad)\nIt finally happened, happened\nIt finally happened, uh huh\nIt finally happened, I'm slightly mad\nOh dear\n\nUh uh ah ah\nUh uh ah ah\n\nI'm knitting with only one needle\nUnraveling fast it's true\nI'm driving only three wheels these days\nBut my dear, how about you?\nI'm going slightly mad\nI'm going slightly mad\nIt finally happened\nIt finally happened, oh yes\nIt finally happened\nI'm slightly mad\nJust very slightly mad\nAnd there you have it\n                                                  \n                                                  Writer/s: JOHN DEACON, BRIAN MAY, FREDDIE MERCURY, SHAYE SMITH, MARK SPRINGER, MARK ALAN SPRINGER, ROGER TAYLOR \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}