{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "I Want To Break Free",
  "URL": "https://www.songfacts.com/facts/queen/i-want-to-break-free",
  "Confidence": 1.0,
  "youtube-id": "f4Mc-NYPHaQ",
  "facts": [
    "Queen bass player John Deacon wrote this from the male perspective of the women's liberation movement.",
    "This song became an anthem for the ANC in South Africa in the late '80s when Nelson Mandela was still in jail and the white government's apartheid policies were still in place.",
    "The video for this song parodies a popular British television soap, Coronation Street. The opening sequence features all the band members in drag (Mercury as a housewife, Deacon as grandmother, Taylor as a schoolgirl, and May as a housewife). This confused many people who didn't catch the reference. Brian May was asked in an interview with Q magazine March 2011 whether each band member's character in the video was an accurate reflection of their personalities? He replied: \"Of Course! Everybody thinks that was Freddie's idea because it looks like something that he would love to do but it actually came from Roger's girlfriend at the time, strangely enough. It was her idea to pastiche the Coronation Street women.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bryn - Blackburn, England and James - Vancouver, Canada\n                                                  \n                                                  ",
    "Singles are often edited down from the album version of songs, but this was the opposite, as the version on The Works is about 30 seconds shorter - the single has a longer synthesizer intro and a longer solo.",
    "Lisa Stansfield sang this at the 1992 Freddie Mercury Tribute Concert. She came on the Wembley Stadium stage wearing hair curlers and pushing a vacuum cleaner in tribute to the song's video. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France, for above 2\n                                                  \n                                                  ",
    "Sadly, for some the Coronation Street pastiche video didn't go over so well, and it was actually banned on MTV, meaning the single died in America. Fred Mandel, who played the synths and signature solo on the track, explained in the Days of our Lives documentary: \"It's a very British kind of humor, and I don't think it went over too well in the States. I'm Canadian, so I get it!\"\nRoger Taylor seemed visibly annoyed: \"In those days on MTV, it was Whitesnake, and f--king Whitesnake, and then another Whitesnake track! They must've thought men dressing up in drag wasn't 'rock' enough, I suppose.\" Brian May added, \"I think at that point we lost America, which is a shame, as it means there's a whole chunk of Queen songs which never got played or heard there.\"",
    "Many assume the solo is played on guitar. Actually it's not - it's a synth solo by talented keyboardist Fred Mandel. \"John did NOT want a guitar solo\" notes Roger Taylor. \"So he got Fred, who's a very brilliant keyboard player, to improvise something around the main tune, and Fred did this brilliant take.\"\nBrian May didn't seem to initially agree with it: \"I didn't exactly agree with it at the time, but I gave it my blessing... that's the deal.\" Mandel himself joked about how it clashed with Queen's previous no-synthesizers policy on their early 1970s records: \"All the old records used to say prominently \"no synthesizers\"... then I come in like another schmuck and put synthesizers on everything!\"",
    "Freddie Mercury was all set to shave off his trademark mustache for his turn as a woman in the video, but director David Mallet put a stop to it. He told the documentary series Video Killed the Radio Star: \"I said, 'No, the one thing you musn't do, the funny thing is that your mustache is there and you're in drag!' To this day, when he comes around the corner with that hoover I laugh.\" Mercury did ditch the 'stache for a later segment in the video, where he is surrounded by the Royal Ballet in a nod to the French ballet L'Après-midi d'un faune and its clean-shaven Russian star Vaslav Nijinsky.\nMallet, who directed several other Queen videos like \"Bohemian Rhapsody\" and \"Radio Ga Ga,\" said he had the most fun with this clip.",
    "This soundtracks a commercial for Doritos 3D that aired during the Super Bowl in 2021. In the ad, Matthew McConaughey is two-dimensional until he slips into a vending machine and eats one of the snacks."
  ],
  "lyrics": "I want to break free\nI want to break free\nI want to break free from your lies\nYou're so self satisfied I don't need you\nI've got to break free\nGod knows, God knows I want to break free\n\nI've fallen in love\nI've fallen in love for the first time\nAnd this time I know it's for real\nI've fallen in love, yeah\nGod knows, God knows I've fallen in love\n\nIt's strange but it's true, yeah\nI can't get over the way you love me like you do\nBut I have to be sure\nWhen I walk out that door\nOh, how I want to be free, baby\nOh, how I want to be free\nOh, how I want to break free\n\nBut life still goes on\nI can't get used to living without, living without\nLiving without you by my side\nI don't want to live alone, hey\nGod knows, got to make it on my own\n\nSo baby can't you see\nI've got to break free\nI've got to break free\nI want to break free, yeah\nI want, I want, I want, I want to break free\n                                                  \n                                                  Writer/s: John Deacon \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}