{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "I Want It All",
  "URL": "https://www.songfacts.com/facts/queen/i-want-it-all",
  "Confidence": 1.0,
  "youtube-id": "hFDcoX7s6rE",
  "facts": [
    "This song is about having ambition and a drive to get things done. Brian May wrote the song, which was inspired by his wife, Anita Dobson, who used to say, \"I want it all and I want it now.\" Dobson is an English television actress. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Anna - Ann Arbor, MI\n                                                  \n                                                  ",
    "For Brian May to write such a proud and powerful anthem at the time, especially based on something Dobson said, was a statement of intent - his first marriage had broken up partly due to the affair he was having with Dobson. This caused him a great deal of depression, which seemed to come out in songs like this.\nAlso considering this was one of the first singles off Miracle, which was around the time Mercury revealed to his bandmates that he was suffering declining health, it has all the marks of a band coming out fighting - the accompanying music video also backs this theme up. See \"Scandal\" (also on the album) for a similar feel, with lyrics more specifically targeted towards those 'against' Queen at that time - largely the mainstream media.",
    "Freddie Mercury takes lead vocals on this song, with May singing and duetting with Mercury in several lines in the pre-solo bridge (\"I'm a man with a one track mind, so much to do in one lifetime...\").",
    "This is one of a number of Queen singles released from 1987 onwards, when the band had stopped touring because of Mercury's declining health. As such, this is one of many songs that Freddie never sung live. Many others have, however, including Rodger Daltrey from The Who, who performed a show-stopping vocal on this song at the Freddie Mercury Tribute Concert in 1992, which also featured Tony Iommi from Black Sabbath on guitar.\nThe song remains a live favorite and has been a fixture on the \"Queen+\" tours, both with Paul Rodgers and Adam Lambert.",
    "This was used in the 2013 movie Despicable Me 2 and in the 2018 Cobra Kai episode \"Mercy.\""
  ],
  "lyrics": "Adventure seeker on an empty street\nJust an alley creeper, light on his feet\nA young fighter screaming, with no time for doubt\nWith the pain and anger can't see a way out\nIt ain't much I'm asking, I heard him say\nGotta find me a future move out of my way\nI want it all, I want it all, I want it all, and I want it now\nI want it all, I want it all, I want it all, and I want it now\n\nListen all you people, come gather round\nI gotta get me a game plan, gotta shake you to the ground\nBut just give me, huh, what I know is mine\nPeople do you hear me, just gimme the sign\nIt ain't much I'm asking, if you want the truth\nHere's to the future for the dreams of youth\n\nI want it all (give it all I want it all)\nI want it all (yeah)\nI want it all and I want it now\n\nI want it all (yes I want it all)\nI want it all hey\nI want it all and I want it now\n\nI'm a man with a one track mind\nSo much to do in one lifetime (people do you hear me)\nNot a man for compromise and where's and why's and living lies\nSo I'm living it all, yes I'm living it all\nAnd I'm giving it all, and I'm giving it all\nOh oh yeah yeah ha ha ha ha ha\nYeah yeah yeah yeah\nI want it all\n\nIt ain't much I'm asking, if you want the truth\nHere's to the future\nHear the cry of youth (hear the cry of youth) (hear the cry of youth)\nI want it all, I want it all, I want it all and I want it now\n\nI want it all yeah yeah yeah\nI want it all, I want it all and I want it now\nOh oh oh oh oh\n\nAnd I want it (now)\nI want it, I want it\nOh ha\n                                                  \n                                                  Writer/s: Roger Taylor, John Deacon, Brian May, Freddie Mercury \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Integrity Music\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}