{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "Innuendo",
  "URL": "https://www.songfacts.com/facts/queen/innuendo",
  "Confidence": 1.0,
  "youtube-id": "g2N0TkfrQhY",
  "facts": [
    "Freddie Mercury and Roger Taylor wrote the lyrics to this song as a tribute to Led Zeppelin. When Robert Plant joined the three surviving members of Queen at Freddie Mercury's memorial concert at Wembley Stadium, they played a full version of this song, which included parts of Led Zeppelin's \"Kashmir\" and \"Thank You.\"",
    "The music was started off by Brian May, Roger Taylor and John Deacon jamming in the studio in Montreux. From then on Freddie Mercury composed the song and added the long interlude. The melody is Mercury's as well. Lyrics were started off by Mercury but completed by drummer Roger Taylor.",
    "The orchestra in the middle part was completely done with synthesizers; by Freddie Mercury and the producer David Richards.",
    "Yes guitarist Steve Howe played the Spanish guitar solo in the middle because, admittedly, Brian May couldn't do it. Steve dropped by in the studio to say hi to producer David Richards, then Freddie invited him to join them on the track. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n sebas - Tokyo, Japan, for all above\n                                                  \n                                                  ",
    "This was Queen's third #1 in the UK after \"Bohemian Rhapsody\" and \"Under Pressure.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Paul - Redditch, England\n                                                  \n                                                  ",
    "Chris Daughtry performed this song on the fifth season of American Idol. Simon Cowell called his performance \"indulgent\" and asked why he didn't sing one of the great Queen songs instead. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jonathon - Clermont, FL\n                                                  \n                                                  "
  ],
  "lyrics": "One two three four\n\nOoh ooh\n\nWhile the sun hangs in the sky and the desert has sand\nWhile the waves crash in the sea and meet the land\nWhile there's a wind and the stars and the rainbow\nTill the mountains crumble into the plain\n\nOh yes, we'll keep on trying\nTread that fine line\nOh, we'll keep on trying\nYeah\nJust passing our time\n\nOh oh\n\nWhile we live according to race, colour or creed\nWhile we rule by blind madness and pure greed\nOur lives dictated by tradition, superstition, false religion\nThrough the eons and on and on\n\nOh, yes, we'll keep on trying, yeah\nWe'll tread that fine line\nOh oh we'll keep on trying\nTill the end of time\nTill the end of time\n\nThrough the sorrow all through our splendor\nDon't take offence at my innuendo\n\nDuh duh duh duh duh duh duh\nDuh duh duh duh duh duh duh duh duh duh duh\n\nYou can be anything you want to be\nJust turn yourself into anything you think that you could ever be\nBe free with your tempo, be free, be free\nSurrender your ego be free, be free to yourself\n\nOh oh, yeah\n\nIf there's a God or any kind of justice under the sky\nIf there's a point, if there's a reason to live or die\nHa, if there's an answer to the questions we feel bound to ask\nShow yourself destroy our fears release your mask\nOh yes, we'll keep on trying\nHey, tread that fine line\n(Yeah) yeah\nWe'll keep on smiling, yeah\n(Yeah) (yeah) (yeah)\nAnd whatever will be will be\nWe'll just keep on trying\nWe'll just keep on trying\nTill the end of time\nTill the end of time\nTill the end of time\n                                                  \n                                                  Writer/s: BRIAN MAY, FREDDIE MERCURY, JOHN DEACON, ROGER TAYLOR \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}