{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "It's A Hard Life",
  "URL": "https://www.songfacts.com/facts/queen/its-a-hard-life",
  "Confidence": 1.0,
  "youtube-id": "uHP-qgzUVLM",
  "facts": [
    "This is a song written by Freddie Mercury. It's about the hardships of maintaining any kind of significant relationship with somebody and have that person's complete trust and all the other things you give to somebody when together. Brian May did an excellent guitar solo on the track. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Adam - Boyce, VA\n                                                  \n                                                  ",
    "On Queen's Greatest Video Hits 2 collection, Roger Taylor said that this was one of his favorite songs that Freddie Mercury wrote, but he absolutely HATED the music video and being a part of it. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Blaze - Hendersonville, TN\n                                                  \n                                                  ",
    "Musically, the song harks back to classic Queen rock ballads like \"Play The Game\" and \"Save Me,\" and the piano parts sound strikingly similar in places to the classic first section from \"Bohemian Rhapsody.\"\nThe very high notes in the opening lines (\"I don't want my freedom, there's no reason for living with a broken heart\") proved problematic to sing live at times. Nevertheless, the emotion is palatable - and real, according to Brian May on the Greatest Hits 2-DVD commentary. \"To my mind this is one of the most beautiful songs that Freddie ever wrote. It's straight from the heart, and he really opened up during the creation of it, I sat with him for hours and hours and hours just trying pull it away and get the most out of it. It's one of his loveliest songs.\"",
    "The intro is based on an aria called \"Vesti La Giubba\" from the opera Pagliacci by Italian opera composer Ruggero Leoncavallo. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "I don't want my freedom\nThere's no reason for living with a broken heart\n\nThis is a tricky situation\nI've only got myself to blame\nIt's just a simple fact of life\nIt can happen to any one\n\nYou win, you lose\nIt's a chance you have to take with love\nOh yeah, I fell in love\nBut now you say it's over and I'm falling apart\n\nYeah yeah\nIt's a hard life\nTo be true lovers together\nTo love and live forever in each others hearts\nIt's a long hard fight\nTo learn to care for each other\nTo trust in one another right from the start\nWhen you're in love\n\nI try and mend the broken pieces\nOh, I try to fight back the tears\nOh, they say it's just a state of mind\nBut it happens to everyone\n\nHow it hurts (yeah) deep inside (oh yeah)\nWhen your love has cut you down to size\nLife is tough on your own\nNow I'm waiting for something to fall from the skies\nI'm waiting for love\n\nYes it's a hard life\nTwo lovers together\nTo love and live forever in each others hearts\nIt's a long hard fight\nTo learn to care for each other\nTo trust in one another right from the start\nWhen you're in love\n\nYes it's a hard life\nIn a world that's filled with sorrow\nThere are people searching for love in every way\nIt's a long hard fight\nBut I'll always live for tomorrow\nI'll look back at myself and say I did it for love (oh)\nYes I did it for love\nFor love\nOh I did it for love\n                                                  \n                                                  Writer/s: Freddie Mercury \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}