{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Killer Queen",
  "URL": "https://www.songfacts.com/facts/queen/killer-queen",
  "Confidence": 1.0,
  "youtube-id": "2ZBtPf7FOoM",
  "facts": [
    "In the New Musical Express November 2, 1974, the song's writer Freddie Mercury elucidated on this song: \"It's about a high class call girl. I'm trying to say that classy people can be whores as well. That's what the song is about, though I'd prefer people to put their interpretation upon it - to read into it what they like.\"",
    "Regarding the line, \"'Let them eat cake' she says, just like Marie Antoinette,\" according to legend, Marie Antoinette (the Queen of France) said \"Let them eat cake\" after hearing how the peasants had no bread to eat. It's more likely that the phrase was uttered by a French philosopher, not Antoinette. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Brentley - Gibbon, NE\n                                                  \n                                                  ",
    "The Marie Antoinette quote has gone down in history as justification for the French Revolution. It demonstrates how out of touch with the common folk the ruling class had become. According to legend, when informed that there was no bread for the people to eat, she replied, oblivious, \"then let them eat cake!\" It is said, that enraged by this incredibly ignorant response, the people revolted. In the song, it is used to demonstrate at what level this high priced prostitute sells her wares. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Kraeg Minett - London, Canada\n                                                  \n                                                  ",
    "The first single from Queen's third album, Sheer Heart Attack, \"Killer Queen\" was their first song to chart outside their native UK, where \"Seven Seas of Rhye,\" from their previous album Queen II, reached #10. Their breakthrough to superstardom came with their next album, A Night At The Opera, which has the epic \"Bohemian Rhapsody\" on the tracklist.",
    "The Sheer Heart Attack album cover was shot by Mick Rock, who did the famous cover of their previous album, Queen II, showing the four band members in darkness with their faces illuminated. Freddie Mercury typically drove the visual direction of the band, but it was drummer Roger Taylor who came up with the concept for the Sheer Heart Attack cover. \"He said, 'I want us to look like we're thrown up from a shipwreck on some distant shore,' so that's what I shot,\" Mick Rock told Songfacts. \"Of course, they were soaking wet and there was a lot of spraying going on.\"",
    "This was one of the first songs recorded at The Quadrangle, a studio opened at the Rockfield Studios complex in Wales in 1973. The following year, Queen recorded much of their Sheer Heart Attack album at Rockfield, and in 1975 they did the bulk of \"Bohemian Rhapsody\" there.",
    "In Ben Elton's musical We Will Rock You, Killer Queen is an evil matriarch who controls the music industry.",
    "Brian May said in Q magazine March 2008: \"This is a perfect pop record and one of Freddie's greatest songs. It's beautifully constructed and it's also got one of the solos I'm most proud of.\"\nHe elaborated further on it in the Days of our Lives documentary: \"Every slice of that record is pure pop perfection. Little things that visit once and come again, like the little bell in the second verse.\"\nNevertheless, he was a little reticent at first about releasing it: \"I was a little hesitant; I was thinking are we setting ourselves as something very light?\" He relates this back to how initially the band were very heavy and rock-orientated, and \"Killer Queen\" was a major departure from that sound.",
    "Californian pop princess Katy Perry named one of her fragrances after this tune. She told Women's Wear Daily the song's lyrics really spoke to her when she was a teenager. \"Killer Queen has been in my vocabulary since I was 15,\" Perry said. \"Freddie Mercury painted the lyrics of this woman who I wanted to be. She seemed very powerful, and she captivated a room when she walked in.\"",
    "This song was covered by Sum 41 for the 2005 Queen tribute album Killer Queen. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Rachel - South Point, OH\n                                                  \n                                                  ",
    "In the video game Guitar Hero 3, one of the unlockable guitars called the \"Card Sharp Special\" can have a finish called \"Killer Queen.\" In the description it says: \" Something about dynamite and laser beams? what's that all about? and who am I to deny it?\", which is a reference to the song lyrics. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Paul - Los Angeles, CA\n                                                  \n                                                  "
  ],
  "lyrics": "She keeps her Moet et Chandon\nIn her pretty cabinet\n\"Let them eat cake\", she says\nJust like Marie Antoinette\nA built-in remedy\nFor Kruschev and Kennedy\nAt anytime an invitation\nYou can't decline\n\nCaviar and cigarettes\nWell versed in etiquette\nExtraordinarily nice\n\nShe's a Killer Queen\nGunpowder, gelatine\nDynamite with a laser beam\nGuaranteed to blow your mind\nAnytime\n\nRecommended at the price\nInsatiable an appetite\nWanna try?\n\nTo avoid complications\nShe never kept the same address\nIn conversation\nShe spoke just like a baroness\nMet a man from China\nWent down to Geisha Minah\nThen again incidentally\nIf you're that way inclined\n\nPerfume came naturally from Paris (naturally)\nFor cars she couldn't care less\nFastidious and precise\n\nShe's a Killer Queen\nGunpowder, gelatine\nDynamite with a laser beam\nGuaranteed to blow your mind\nAnytime\n\nDrop of a hat she's as willing as\nPlayful as a pussy cat\nThen momentarily out of action\nTemporarily out of gas\nTo absolutely drive you wild, wild\nShe's all out to get you\n\nShe's a Killer Queen\nGunpowder, gelatine\nDynamite with a laser beam\nGuaranteed to blow your mind\nAnytime\n\nRecommended at the price\nInsatiable an appetite\nWanna try?\nYou wanna try\n                                                  \n                                                  Writer/s: Freddie Mercury \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}