{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Now I'm Here",
  "URL": "https://www.songfacts.com/facts/queen/now-im-here",
  "Confidence": 1.0,
  "youtube-id": "3OSd17ko3O4",
  "facts": [
    "This song, written by Queen guitarist Brian May, is about the hard, fast, good and bad times of extensive touring, which the band did during their first few years. As the band have been quick to note, their success did not come overnight - success in America particularly was laid by many years of touring there in the 1970s, and battling against the common \"east coast\" style rock of the Eagles and Steely Dan which was very much the sound of American Rock radio around that time.",
    "In 1974 Queen supported the band Mott the Hoople in America. This tour provided the inspiration for this song, which contains the lyrics \"Down in the city, just Hoople and me.\"",
    "Queen had a great time on tour with Mott the Hoople, but unfortunately Brian May fell ill near the end of the tour with severe hepatitis and spent many of the sessions for Sheer Heart Attack recovering in hospital. He since admitted that he was nervous that the band would find a replacement, and he was determined to keep working to stop that from happening.\nAs it turned out, the band never even considered replacing May, and even left space in the songs they were already working on for him to add his parts when he was healthy enough. Even so, \"Now I'm Here\" is one of May's first songs that he wrote for the album once coming back to health, and the loud and strutting nature of the song suggests the tone of a man re-energised and ready to play again.",
    "Clearly \"Now I'm Here\" is a song many in the band were fond of - including Brian May. Freddie Mercury said in a 1976 interview with Record Mirror: \"It was nice. That was a Brian May thing. We released it after \"Killer Queen.\" And it's a total contrast, just a total contrast. It was just to show people we can still do rock 'n' roll - we haven't forgotten our rock 'n' roll roots. It's nice to do on stage. I enjoyed doing that on stage.\" It holds the record as the Queen song which lasted in their live set the longest, from release in 1974 right through to their final stadium shows in 1986. It also regularly appeared on live compilations and B-side releases. May himself continued to play it long after Mercury's death, both solo (Live Brixton Academy 1993), guesting live with Def Leppard at the 1991 Freddie Mercury Tribute Concert, and with Queen+ tours - notably it became the spectacular intro song on their 2014 Adam Lambert tour of America and beyond."
  ],
  "lyrics": "Here I stand (here I stand)\nLooked around, around, around, around, around\nBut you won't see me (but you won't see me)\n\nNow I'm here (now I'm here)\nNow I'm there (now I'm there)\nI'm just a\nJust a new man\nYes, you made me live again\nYeah!\n\nA baby I was when you took my hand\nThe light of the night burned bright\nThe people all stared didn't understand\nBut you knew my name on sight\n\nOoh, whatever came of you and me\nAmerica's new bride to be\nDon't worry babe, I'm safe and sound\nDown in the dungeon just peaches and me\n\nDon't I love you so\nYes, you made me live again\nCome on! Everybody!\n\nYeah, ooh, a thin moon me in a smoke-screen sky\nWhere beams of your lovelight chase\nDon't move, don't speak, don't feel no pain\nWith the rain running down my face\n\nYour matches still light up the sky\nAnd many a tear lives on in my eye\n\nDown in the city just Hoople and me\nAlright\n\nCome on!\n\nWhatever comes of you and me\nI'd love to leave my memory with you\n\nNow I'm here (now I'm here)\nThink I'll stay around, around, around, around\nDown in the city justa you and me\n\nAw yeah!\n                                                  \n                                                  Writer/s: Brian May \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}