{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "One Vision",
  "URL": "https://www.songfacts.com/facts/queen/one-vision",
  "Confidence": 1.0,
  "youtube-id": "-OGd4gplxQM",
  "facts": [
    "Queen was inspired to write this by their Live Aid appearance in 1985 - millions of people sharing one vision of a better world.\nWhen the band was approached to perform at Live Aid, they were in a rut and reticent to appear. But after their show-stopping performance, they re-entered the studio with renewed energy. They were back in Munich (a place they had previously hit trouble during the Hot Space sessions), but this time spent a lot of time working in the studio, not being distracted by drugs or other distractions - unlike the earlier sessions.",
    "All four band members helped write this. Most Queen songs were written separately, mostly out of a desire to keep writing credits to themselves - Brian May has often hinted in interviews that he was quite possessive of his own songs. But this also made sure their songs didn't all sound alike. \nThe idea of writing a song together came from Freddie Mercury. He rang the other three members and asked them to come to the studio, where the writing and recording sessions were taped.",
    "The band decided that the song would be credited to all four of them, but it was basically composed by Brian May (chords) and Roger Taylor (lyrics). Freddie Mercury was in charge of production and arrangements, and he polished what the others composed.\nThis was one of the first times that the band distributed a joint songwriting credit; for their entire career songs had been credited to the original band member who wrote them, even if other band members contributed. For One Vision, the band decided on a joint credit, which would become the norm from next album The Miracle onwards.",
    "The synth part in the intro was played by guitarist Brian May. The weird voice at the start actually says \"God moves in mysterious ways,\" although is often misheard as \"on the city streets today.\" \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Sebas - Tokyo, Japan, for above 3\n                                                  \n                                                  ",
    "The video was the first that Austrian duo The Torpedo Twins directed for Queen. They have worked on many Queen videos since.",
    "In sports videos, this is often used as background music.",
    "This was released as a single before the album was finished.",
    "This was used in the 1986 movie Iron Eagle, starring Louis Gossett, Jr. It was like Top Gun, but not nearly as good.",
    "The final line is an in-joke from Freddie Mercury, where he shouts \"Fried chicken!\" instead of \"one vision.\" It's likely that this was merely a humorous aside rather than a caustic social commentary.",
    "A documentary was made around the recording of this track, showing the band members working on the song in the studio with producer Mack (who had been working with the band since 1980). It shows the lyrics coming together (Taylor and Mercury discussing various ideas which \"won't fit\" before coming on \"one true religion\"), and a hilarious guide vocal take where Mercury sings the alternate lyrics \"one dump, one turd, two tits, John Deacon!\" in the chorus.\nThe band were reportedly unhappy with having a documentary crew around, feeling that it forced them to act up to the camera and didn't act naturally as themselves in the studio. Nevertheless, it has been included on many video compilations and the re-release of the A Kind of Magic album.",
    "\"One Vision\" became the band's de facto opening song for the 1986 Magic tour, considered by many to be the band's finest ever live shows."
  ],
  "lyrics": "God works in mysterious ways, mysterious ways\nHey, one man one goal ha, one mission\nOne heart one soul just one solution\nOne flash of light yeah, one God, One vision\n\nOne flesh one bone\nOne true religion\nOne voice one hope\nOne real decision\nWowowowowowo gimme one vision\nHey\n\nNo wrong no right\nI'm gonna tell you there's no black and no white\nNo blood no stain\nAll we need is one world wide vision\n\nOne flesh, One bone\nOne true religion\nOne race, One hope\nOne real decision\nWowowowowo woh yeah oh yeah oh yeah\n\nI had a dream\nWhen I was young\nA dream of sweet illusion\nA glimpse of hope and unity\nAnd visions of one sweet union\nBut a cold wind blows\nAnd a dark rain falls\nAnd in my heart it shows\nLook what they've done to my dream, yeah\n\nOne vision\nSo give me your hands\nGive me your hearts\nI'm ready\nThere's only one direction\nOne world one nation\nYeah one vision\n\nNo hate, No fight\nJust excitation\nAll through the night\nIt's a celebration\nWowowowowowo yeah\nOne one one one one one one\nOne vision hey one vision one vision one vision one vision\n\nOne flesh, One bone\nOne true religion\nOne voice, One hope\nOne real decision\n\nGimme one light, yeah\nGimme one hope, hey\nJust gimme, ha\nOne man one man\nOne bar one night\nOne day hey hey\nJust gimme gimme gimme gimme\nFried chicken vision vision vision vision vision\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}