{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Play The Game",
  "URL": "https://www.songfacts.com/facts/queen/play-the-game",
  "Confidence": 1.0,
  "youtube-id": "6_5O-nUiZ_0",
  "facts": [
    "Freddie Mercury wrote this song for his lover Tony Bastin after they broke up. The topic for the song, with the narrator taking the perspective of someone looking back on past memories of an old relationship/former love, is one Mercury would revisit on \"It's A Hard Life\" (The Works) and \"You Don't Fool Me\" (a song made up of sections of lyrics Mercury recorded before his death, and included on the posthumous Made in Heaven album in 1995).\nAll four members of Queen contributed songs, resulting in a constantly changing sound.",
    "The song starts with a series of rushing noises played on an Oberheim OB-X synthesiser. The Game album was a significant turning point for the band - for many years, they proudly noted on their album sleeves that no synthesizers were used on their records - many would assume that to be the case due to the complex instrumentation and sounds the band would achieve via recording tricks and guitar effects/overdubs.\nFrom The Game onwards, the band started to experiment more explicitly with synths, starting with this song and the likes of \"Another One Bites The Dust.\" Session musician Fred Mandel, who played the famous solo in \"I Want To Break Free\" on a Roland synth keyboard, joked about this in the Days of Our Lives documentary: \"The old records used to say prominently 'no synthesizers'. And then I come in like another schmuck and put synthesizers on everything!\"",
    "The cover of the single was the first time Mercury displayed his soon-to-be-famous moustache, which would become a huge part of his look for many years - although at the time hardcore Queen fans didn't like the change of image, even going as far as to send him disposable razors to shave it off.",
    "The B-side to the single for \"Play The Game\" was \"A Human Body,\" one of Queen's rarest compositions for many years - only being available on the original vinyl releases until it was finally included on the Singles Collection Volume 2 and on the bonus disc to the 2011 CD re-issue of The Game.",
    "This song was covered by Jon Brion for the 2005 Queen tribute album Killer Queen. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Rachel - South Point, OH\n                                                  \n                                                  "
  ],
  "lyrics": "Open up your mind and let me step inside\nRest your weary head and let your heart decide\nIt's so easy when you know the rules\nIt's so easy\nAll you have to do is fall in love\n\nPlay the game, everybody play the game\nOf love\n\nWhen your feeling down and your resistance is low\nLight another cigarette and let yourself go\nThis is your life, don't play hard to get\nIt's a free world\nAll you have to do is fall in love\nPlay the game everybody play the game of love\n\nMy game of love has just begun\nLove runs from my head down to my toes\nMy love is pumping trough my veins\nDriving me insane\n\nPlay the game, play the game\nPlay the game, play the game\n\nPlay the game everybody play the game of love\nThis is your life, don't play hard to get\nIt's a free world\nAll you have to do is fall in love\nPlay the game everybody play the game of love\n\nYour life, don't play hard to get\nIt's a free world\nAll you have to do is fall in love\nPlay the game, play the game of love\n                                                  \n                                                  Writer/s: Freddie Mercury \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}