{
  "Artist": "Queen",
  "Album": "Greatest Hits III",
  "Title": "Princes Of The Universe",
  "URL": "https://www.songfacts.com/facts/queen/princes-of-the-universe",
  "Confidence": 1.0,
  "youtube-id": "VEJ8lpCQbyw",
  "facts": [
    "Freddie Mercury wrote this for the movie Highlander. Mercury composed some of the heavier tracks of the band, like this one. The guitar parts were all his, Brian May just played what Freddie told him to. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n sebas - Tokyo, Japan\n                                                  \n                                                  "
  ],
  "lyrics": "Here we are, born to be kings\nWe're the princes of the universe\nHere we belong, fighting to survive\nIn a world with the darkest powers\nHeh\nAnd here we are, we're the princes of the universe\nHere we belong, fighting for survival\nWe've come to be the rulers of you all\n\nI am immortal, I have inside me blood of kings, yeah, yeah\nI have no rival, no man can be my equal\nTake me to the future of you all\n\nBorn to be kings, princes of the universe\nFighting and free\nGot your world in my hand\nI'm here for your love and I'll make my stand\nWe were born to be princes of the universe\n\nNo man could understand\nMy power is in my own hand\nOoh, ooh, ooh, ooh, people talk about you\nPeople say you've had your day\nI'm a man that will go far\nFly the moon and reach for the stars\nWith my sword and head held high\nGot to pass the test first time, yeah\nI know that people talk about me, I hear it every day\nBut I can prove them wrong 'cause I'm right first time\nYeah, yeah\nAlright, let's go, let's go, ha ha\nYeah, watch this man fly, wooh\nBring on the girls, c'mon, c'mon, c'mon\nHere we are (here we are)\nBorn to be kings, we're the princes of the universe\nHere we belong\nBorn to be kings, princes of the universe\nFighting and free, got your world in my hand\nI'm here for your love and I'll make my stand\nWe were born to be princes of the universe (universe, universe, universe)\n                                                  \n                                                  Writer/s: FREDDIE MERCURY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}