{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "Radio Ga Ga",
  "URL": "https://www.songfacts.com/facts/queen/radio-ga-ga",
  "Confidence": 1.0,
  "youtube-id": "azdwsXLmrHE",
  "facts": [
    "Queen drummer Roger Taylor wrote this song. When it charted, all four members of the group had written at least one Top 10 hit either in the US or UK.",
    "Roger Taylor wrote this as a critique of radio stations, which were becoming commercialized and playing the same songs over and over (and this was before radio was deregulated, allowing companies to own multiple stations in a market, resulting in more corporate ownership, less competition and generally bad radio).",
    "Taylor claimed that he was inspired to write this after watching MTV. He noticed that lots of kids were watching the channel instead of listening to the radio.",
    "The video is based on the 1926 movie Metropolis, directed by Fritz Lang. Queen had to pay the German government to use clips of it in the video.",
    "A number of electronic devices were used on this song, including a LinnDrum drum machine and at least three synthesizers: a Roland Jupiter 8, a Fairlight CMI and an Oberheim OB-Xa. Roger Taylor also added some Simmons electronic drums. Roland VP-330 vocoder was used to create the robotic vocals.",
    "Originally, this was \"Radio Ca-Ca,\" which was something Roger Taylor's part-French son Felix exclaimed one day in trying to say the radio was bad (\"radio, CACA!). The phrase stuck with Taylor and inspired the anti-commercial radio themes in the lyrics.\nTaylor liked the title, but the rest of the group objected and asked for a re-write. As a result, it went from a song condemning radio (\"Ca-Ca\") to praising it (\"Ga Ga\"). Interestingly however, even in the final recorded version, the phrase \"Ca-Ca\" is present - maybe as a compromise for Taylor?",
    "Queen stole the show at Live-Aid when Freddie Mercury, battling laryngitis, got everybody in Wembley Stadium singing the chorus of this song.",
    "The extras in the video got the clapping sequence right on the first try, but it took practice for the members of Queen to get it down. Director David Mallet was surprised the extras picked up the routine so easily, considering they'd never heard the song, which hadn't yet been released. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jonathon - Clermont, FL\n                                                  \n                                                  ",
    "The rock band Electric Six recorded this on their 2005 album Señor Smoke. In the video, their lead singer Dick Valentine is shown as the ghost of Freddie Mercury appearing in front of his grave, which caused controversy amongst Queen fans. Valentine was quick to stress that it was meant in tribute, not to denigrate the group - the band were massive Queen fans. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Logan - Troy, MT\n                                                  \n                                                  ",
    "Lady Gaga took her name from this song. Born Stefani Germanotta, she started using the moniker when she needed a stage name. Who came up with the name is a matter of dispute, as her former producer Rob Fusari claims that he originated it, while the singer says it was given to her by her co-workers in her burlesque days.",
    "When director David Mallet was coming up with the concept for the music video, he wanted to stray from the usual performance pieces full of guitar solos and drum fills. \"And even [guitarist] Brian May agreed to that,\" Mallet told the documentary series Video Killed the Radio Star. Freddie Mercury suggested the Metropolis concept, but Mallet wanted to make sure the band still played a key role in the clip. \"So we built that funny car and them flying through the air, and used the wide shots from Metropolis ... All I was trying to do is find some way of fitting Metropolis into a different setting, and I thought, what if we make the whole video a period - wartime, for instance, or semi-wartime, and it would tie it all together. And it did.\"",
    "Some critics feel the choreography in the hand-clapping scene is a reference to Nazis, an idea that Mallet dismisses: \"It didn't really have any bearing on Nazi rallies at all.\" Roger Taylor added: \"That section was meant to sort of portray the mind control of the workers in the movie Metropolis.\"",
    "An extended version was released as a 12\" single at the same time."
  ],
  "lyrics": "I'd sit alone and watch your light\nMy only friend through teenage nights\nAnd everything I had to know\nI heard it on my radio\n\nYou gave them all those old time stars\nThrough wars of worlds invaded by Mars\nYou made 'em laugh, you made 'em cry\nYou made us feel like we could fly\n\nSo don't become some background noise\nA backdrop for the girls and boys\nWho just don't know or just don't care\nAnd just complain when you're not there\n\nYou had your time, you had the power\nYou've yet to have your finest hour\nRadio, everybody!\n\nAll we hear is radio ga ga\nRadio goo goo\nRadio ga ga\nAll we hear is radio ga ga\nRadio blah blah\nRadio, what's new?\nRadio, someone still loves you\n\nWe watch the shows, we watch the stars\nOn videos for hours and hours\nWe hardly need to use our ears\nHow music changes through the years\n\nLet's hope you never leave, old friend\nLike all good things, on you we depend\nSo stick around 'cause we might miss you\nWhen we grow tired of all this visual\n\nHad your time, you had the power\nYou've yet to have your finest hour\nRadio\n\nAll we hear is radio ga ga\nRadio goo goo\nRadio ga ga\nAll we hear is radio ga ga\nRadio goo goo\nRadio ga ga\nAll we hear is radio ga ga\nRadio blah blah\nRadio, what's new?\nRadio, someone still loves you\n\nLoves\nYou\n                                                  \n                                                  Writer/s: Roger Taylor \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, BMG Rights Management\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}