{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Seven Seas Of Rhye",
  "URL": "https://www.songfacts.com/facts/queen/seven-seas-of-rhye",
  "Confidence": 1.0,
  "youtube-id": "FxIo57WURRE",
  "facts": [
    "A track from their second album, this was Queen's first entry on the UK singles chart. Brian May in Q magazine, March 2008, said: \"Our first breakthrough, made with the idea that if radio was going to play it, everything had to explode. And it did work.\"",
    "As the song fades out, part of a British seaside song called \"Oh, I Do Like To Be Beside The Seaside\" is sung. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Tom - Trowbridge, England, for above 2\n                                                  \n                                                  ",
    "Freddie Mercury penned the song basing it on a fantasy world called Rhye that he had created with his sister, Kashmira. They were brought up on the African island of Zanzibar in the Zoroastrianism religion, founded in Iran, and these fuelled Mercury's flights of fancy. Several other of the Queen singer's early songs feature the mysterious land of Rhye, including Lily Of The Valley, My Fairy King and The March Of The Black Queen.",
    "The song's success enabled Mercury to quit his day job working at a stall in London's Kensington Market.",
    "The success of the single earned Queen their first ever appearance on Top of the Pops, the musical variety show that The Beatles, and many other British bands, aspired to be on when they started. Judging by In the Days of our Lives documentary Queen appears to have mixed view on their appearance. Roger Taylor was critical: \"There was a strike on at the BBC so we recorded it in the weather studio. It was rubbish, no one actually played, just some aging disc jockeys. And the drums were plastic, so they made this 'dook' noise when you hit them.\"\nBrian May on the other hand was more positive: \"it was an exciting experience, because hey here you are on Top of the Pops and it's all happening.\""
  ],
  "lyrics": "Fear me you Lords and lady preachers\nI descend upon your earth from the skies\nI command your very souls you unbelievers\nBring before me what is mine\nThe seven seas of Rhye\n\nFear me you Lords and privy councilors\nI stand before you naked to the eyes\nI will destroy any man who dares abuse my trust\nBring before me what is mine\nAt the seven seas of Rhye\n\nSister I live and lie for you\nMister do and I'll die\nYou are mine I possess you\nBelong to you forever, ever, ever\n                                                  \n                                                  Writer/s: FREDDIE MERCURY \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  ",
  "image": {
    "url": "https://www.songfacts.com/img-songimg-320-3666.jpg",
    "facts": "The Queen II album cover was shot by Mick Rock, who had taken the classic photos for Lou Reed's Transformer and Iggy & the Stooges' Raw Power. He positioned the four band members close together, and using a ladder, snapped the photo of them looking out of the darkness. It was inspired by a photo of Marlene Dietrich from the 1932 film Shanghai Express, where she's posed in a similar manner.Freddie Mercury loved it, but his bandmates had come concerns. \"The rest of the band was a little bit timid about it because they thought it looked very pretentious,\" Mick Rock told Songfacts. \"Freddie said, 'Pretentious? Yes, of course we're pretentious... because we are that good!'\"The look resurfaced in 1975 when director Bruce Gowers re-created it for the \"Bohemian Rhapsody\" video."
  }
}