{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "Somebody To Love",
  "URL": "https://www.songfacts.com/facts/queen/somebody-to-love",
  "Confidence": 1.0,
  "youtube-id": "kijpcUv-b8M",
  "facts": [
    "This song is sung in a gospel style, with the voices of Freddie Mercury, Brian May and Roger Taylor multitracked to sound like a choir. According to Brian May, the gospel sound was inspired by the music of Aretha Franklin.",
    "Freddie Mercury wrote this. The lyrics reflect a man calling out to God, asking why he works so hard, but can't find love. At the end of the song, he finds hope and decides he will not accept defeat.",
    "This is widely reputed to have been Freddie Mercury's favorite song he ever wrote.",
    "Queen performed this with Elton John on lead vocals in Paris in January 1997. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jonathon - Clermont, FL, for all above\n                                                  \n                                                  ",
    "On the Greatest Hits III album, which is a tribute to Freddie Mercury, George Michael sings lead. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Caitlyn - Jacksonville, FL\n                                                  \n                                                  ",
    "Anne Hathaway sang this during a musical number in the 2004 movie Ella Enchanted.",
    "Peter Hince, the head of Queen's road crew, recalled to Mojo magazine September 2009 that \"among the road crew there were songs you liked and songs you didn't like.\" He added that this was, \"always one of Queen's best. The studio version was very polished, but on-stage there was so much more guts to it.\"",
    "Hince recalled to Mojo the video was \"filmed at Wessex Studios while they were making the A Day at the Races album.\" He added: \"Aesthetically, you had to have all four around the microphone, but John (Deacon) didn't sing on the records. By his own admission he didn't have the voice. He did sing on-stage but the crew always knew to keep the fader very low.\"\nSeveral bootleg recordings and live videos exist where evidently John's mic was not turned down, and it becomes painfully obvious that the above statement is true - one particular live performance of \"In The Lap Of The Gods\" is wince-inducing!",
    "In October 2009 a remake by the cast of the Fox TV musical comedy Glee returned this song to #28 on the Billboard Hot 100 and #26 on the UK singles chart. Their version was featured in the episode \"The Rhodes Not Taken.\"",
    "Frank Turner covered this for the B-side to his vinyl release of \"I Still Believe\" in 2011.",
    "The Voice contestant Jordan Smith's rendition took the song back into the upper reaches of the Hot 100. The week after his performance of the song on the December 7, 2015 episode of the singing competition, Smith's version debuted at #21 on the chart.",
    "This was used in a commercial for the Honda Ridgeline that debuted during the 2016 Super Bowl. In the spot, a flock of sheep sing this song, having heard it when they were transported in a Ridgeline with a truck-bed audio system, which we're sure is quite handy for teaching songs to sheep."
  ],
  "lyrics": "Each morning I get up I die a little\nCan barely stand on my feet (take a look at yourself)\nTake a look in the mirror and cry\nLord, what you're doing to me\nI have spent all my years in believing you\nBut I just can't get no relief, Lord \nSomebody uh (somebody) somebody (somebody)\nCan anybody find me somebody to love? \n\nI work (he works hard) hard every day of my life\nI work 'til I ache my bones\nAt the end (at the end of the day) I take home my hard earned pay all on my own \nI go down on my knees\nAnd I start to pray (praise the Lord)\n'Til the tears run down from my eyes\nLord, somebody uh (somebody) somebody (somebody)\nCan anybody find me somebody to love? \n\n(He works hard) everyday (everyday)\nI try and I try and I try\nBut everybody wants to put me down\nThey say I'm goin' crazy\nThey say I got a lot of water in my brain\nI got no common sense\nI got nobody left to believe\nYeah, yeah, yeah, yeah, yeah\n\nOh, Lord\nSomebody uh (somebody) somebody (somebody)\nCan anybody find me somebody to love? \n\n(Can anybody find me somebody to love?)\nGot no feel, I got no rhythm\nI just keep losing my beat\nI'm alright, I'm alright (he's alright)\nI ain't gonna face no defeat\nI just gotta get out of this prison cell\nSomeday I'm gonna be free, Lord\n\nFind me somebody to love\nFind me somebody to love\nFind me somebody to love\nFind me somebody to love\nFind me somebody to love\nFind me somebody to love\nFind me somebody to love\nFind me somebody to love\nFind me somebody to love\nSomebody (somebody) somebody (somebody)\nSomebody find me, somebody find me somebody to love \nCan anybody find me \nSomebody to come on, love, yeah\n\nFind me somebody to love\nFind me somebody to love\nFind me somebody, somebody, somebody to love (find me somebody to love)\nFind me, find me, find me, find me uh somebody to love\nFind me somebody to love\nFind me somebody to love (anybody, anywhere)\nSomebody, somebody to love yeah yeah oh (find me somebody to love)\n                                                  \n                                                  Writer/s: Freddie Mercury \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}