{
  "Artist": "Queen",
  "Album": "Greatest Hits III",
  "Title": "Thank God It's Christmas",
  "URL": "https://www.songfacts.com/facts/queen/thank-god-its-christmas",
  "Confidence": 1.0,
  "youtube-id": "qw2TD91Nytg",
  "facts": [
    "\"Thank God It's Christmas\" was mainly written by Queen drummer Roger Taylor.  However, when he found himself struggling to come up with a chorus he asked the band's lead guitarist, Brian May, to help him out.\nWhen the pair finished the tune they presented it to Freddie Mercury. It was the vocalist's ability to pull back for that song which Brian May remembers. He told Ultimate Classic Rock: \"(Freddie) loved it and did a beautiful vocal. I think it's just the most understated vocal, and I love it, you know.\"",
    "The song was released on November 27, 1984 and spent six weeks in the UK charts over Christmas 1984 and the New Year of 1985, peaking at #21. Queen were big in the mid-1980s in their home country, so the song's relative lack of success is surprising. May believes this is because they didn't film a promotional video for their festive tune. He said: \"The funny thing is, it doesn't get that much attention in Britain as a Christmas single, because it doesn't have a video. Everything's about video these days and we never made a video for that song. It's all in your mind. But I'm very fond of it. I think it's a very different kind of Christmas song.\"",
    "Another contributing factor for the song's relative lack of success was it was released the same time as Band-Aid's charity song \"Do They Know It's Christmas?.\"",
    "Brian May and Roger Taylor made two demos of the song. While Taylor's demo became Queen's Christmas single in 1984, May's version went to his future wife EastEnders actress Anita Dobson, who released it as \"I Dream Of Christmas\" in 1987.",
    "In 2019, Queen released a touching animated music video for the song depicting a snowy nightime winter scene in a city. Directed and animated by Justin Moon, its concept came directly from Brian May and Roger Taylor. \n\"Ironically, Christmas tends to be such a stressful time for so many of us,\" said Taylor. \"So many emotions, joyful memories of past Christmas' as delighted children and responsible adults / parents. It's just a great relief when it finally happens.\"\n\"The video goes a little further,\" added May, \"by including a subtle reminder that we as humans now need to feel a responsibility for the welfare of ALL creatures on Earth - not just for our own benefit, and that of our grandchildren, but out of respect for the rights of the animals themselves.\""
  ],
  "lyrics": "Oh my love \nWe've had our share of tears\nOh my friends\nWe've had our hopes and fears\nOh my friends\nIt's been a long hard year\nBut now it's Christmas\nYes, it's Christmas\nThank God it's Christmas\n\nThe moon and stars seem awful cold and bright\nLet's hope \nThe snow will make this Christmas right\nMy friend the world \nWill share this special night\nBecause it's Christmas\nYes it's Christmas\nThank God it's Christmas\nFor \nOne \nNight\n\nThank God it's Christmas, yeah\nThank God it's Christmas\nThank God it's Christmas\nCan it be Christmas?\nLet it be Christmas\nEvery day\n\nOh my love \nWe live in troubled days\nOh my friend\nWe have the strangest ways\nAll my friends \nOn this one day of days\nThank God it's Christmas\nYes it's Christmas\nThank God it's Christmas\nFor \nOne \nDay\n\nThank God it's Christmas\nYes it's Christmas\nThank God it's Christmas\nOoh yeah\nThank God it's Christmas\nYes yes yes yes it's Christmas\nThank God it's Christmas\nFor \nOne \nDay\n\nChristmas, a very merry Christmas to you all\n                                                  \n                                                  Writer/s: Roger Taylor, Brian May \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}