{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "The Show Must Go On",
  "URL": "https://www.songfacts.com/facts/queen/the-show-must-go-on",
  "Confidence": 1.0,
  "youtube-id": "t99KH0TR-J4",
  "facts": [
    "Guitarist Brian May wrote this while lead singer Freddie Mercury was dying of AIDS. It was Mercury's last official album with Queen, and when it was released, very few people knew he had the disease.\nThe lyrics are about the need to press on and make the most out of life while you can still enjoy it. It is inevitably a comment on Mercury's worsening condition, and his attitude towards life - May noted his incredible courage in the Days of our Lives documentary. \"He never moaned, he never said 'my life is s--t, this is terrible, I hate it,'\" said May. \"He had an incredible strength and peace.\"\nThe song's placing as the final track on Innuendo is notable, as it's likely that the band thought that this might be the last album Mercury would be healthy enough to perform on before his death. In the sessions, he made enough recordings to provide the band with material to release the posthumous 1995 album Made In Heaven.",
    "This was used in the movie Moulin Rouge. It is performed in an operatic style by Jim Broadbent and Nicole Kidman in a scene that sets up the climax of the movie. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Daphne - Saint John\n                                                  \n                                                  ",
    "In a 2005 poll by digital TV channel Music Choice where 45,000 adults across Europe were asked which song they would like played at their funeral, this was the favorite.",
    "The video is mainly just clips of old Queen videos and a few live performances, but it is so cleverly edited and spliced together that it works as a video of it's own. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Mjn Seifer - England\n                                                  \n                                                  ",
    "This song was performed in dramatic style in 1997 with Elton John on guest vocals with an Italian ballet trope. It would be John Deacon's last performance with the band, and last public appearance - he retired from music after the performance."
  ],
  "lyrics": "Empty spaces, what are we living for?\nAbandoned places, I guess we know the score\nOn and on, does anybody know what we are looking for?\nAnother hero, another mindless crime\nBehind the curtain, in the pantomime\nHold the line, does anybody want to take it anymore?\n\nThe show must go on\nThe show must go on\nYeah\nInside my heart is breaking\nMy make-up may be flaking\nBut my smile still stays on\n\nWhatever happens, I'll leave it all to chance\nAnother heartache, another failed romance\nOn and on, does anybody know what we are living for?\nI guess I'm learning (I'm learning), I must be warmer now\nI'll soon be turning (turning, turning, turning), 'round the corner now\nOutside the dawn is breaking\nBut inside in the dark I'm aching to be free\n\nThe show must go on\nThe show must go on (yeah yeah)\nOoh, inside my heart is breaking\nMy make-up may be flaking\nBut my smile still stays on\n\nYeah\n\nMy soul is painted like the wings of butterflies\nFairy tales of yesterday will grow but never die\nI can fly my friends\n\nThe show must go on, yeah\nThe show must go on\nI'll face it with a grin\nI'm never giving in\nOn with the show \n\nOoh, I'll top the bill, I'll overkill\nI have to find the will to carry on \n(On with the show, on with the show)\n\nShow (show must go on, go on, go on, go on, go on, go on, go on)\n                                                  \n                                                  Writer/s: Roger Taylor, John Deacon, Brian May, Freddie Mercury \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, BMG Rights Management\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}