{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "The Invisible Man",
  "URL": "https://www.songfacts.com/facts/queen/the-invisible-man",
  "Confidence": 1.0,
  "youtube-id": "zKdxd718WXg",
  "facts": [
    "This song was written by the band's drummer, Roger Taylor. Rumor has it that the beat came to him immediately while reading the book The Invisible Man by H.G. Wells. Taylor said that he wrote part of the song in the bathtub.",
    "\"The Invisible Man\" was the original planned title for the album that would be called The Miracle, but three weeks prior to the album's release, they changed the name.",
    "Hidden within the song are the names of each of the band members: Freddie Mercury at the beginning of the first verse (often confused with \"Freddy Kreuger\"!), John Deacon after the first verse, Brian May, said twice before his solo, and Roger Taylor after the words \"Look at me, look at me,\" which Taylor answers with a quick drum beat.",
    "The idea of the song, to a large extent, seems to be the concept of being invisible, not physically, however: \"Incredible how you can see right through me... it's criminal how I can see right through you.\" The Invisible Man can see through people and their veiled emotions and appearances and see what they really are, underneath the facade that they put out. It appears that The Invisible Man became \"invisible\" after being turned down by a girl who didn't like him - he's reacted back, and now, the only thing that she can think about is him. She can't shake him from her mind, she can't get him back, she can't do anything to him. He's in her life, for good. He's her \"Meanest thought\" and her \"Darkest fear.\" The last couple of lines, \"Look at me, look at me,\" are basically asking that he no longer be ignored. Again, he's not physically invisible - he can see other people's lives, who they are on the inside, but he is constantly ignored by people who feel they're better than him. As this song was written by Taylor, it would be unlikely that anyone could stretch it to say that this applies to Mercury, that people thought they were better than him because they weren't bisexual. As he did write this after reading a book, it is also possible that the invisible man is in fact invisible and now he's become a stalker, but, that wouldn't explain the \"See right through you\" lines. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n James - Vancouver, Canada, for all above\n                                                  \n                                                  "
  ],
  "lyrics": "I'm the invisible man\nI'm the invisible man\nIncredible how you can\nSee right through me\n\n(Freddie Mercury)\nWhen you hear a sound\nThat you just can't place\nFeel somethin' move\nThat you just can't trace\nWhen something sits\nOn the end of your bed\nDon't turn around\nWhen you hear me tread\n\nI'm the invisible man\nI'm the invisible man\nIncredible how you can\nSee right through me\nI'm the invisible man\nI'm the invisible man\nIt's criminal how I can\nSee right through you\n\nI'm in your room\nAnd I'm in your bed\nAnd I'm in your life\nAnd I'm in your head\nLike the CIA\nOr the FBI\nYou'll never get close\nNever take me alive\n\nI'm the invisible man\nI'm the invisible man\nIncredible how you can\nSee right through me\nI'm the invisible man\nI'm the invisible man\nIt's criminal how I can\nSee right through you\n\nHah, hah, hah, hello\nHah, hah, hah, okay\nHah, hah, hah, hello hello hello hello\nNever had a real good friend, not a boy or a girl\nNo one knows what I've been through, let my flag unfurl\nSo make my mark from the edge of the world\nFrom the edge of the world\nFrom the edge of the world\n\nNow I'm on your track\nAnd I'm in your mind\nAnd I'm on your back\nBut don't look behind\nI'm your meanest thought\nI'm your darkest fear\nPut I'll never get caught\nYou can't shake me, shake me dear\n\nI'm the invisible man\nI'm the invisible man\nIncredible how you can\nSee right through me (watch me)\nI'm the invisible man\nI'm the invisible man\nIt's criminal how I can\nSee right through you\nLook at me, look at me\n\nShake me, shake me, shake me dear\n                                                  \n                                                  Writer/s: BRIAN MAY, FREDDIE MERCURY, JOHN DEACON, ROGER TAYLOR \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Universal Music Publishing Group\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}