{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "The Miracle",
  "URL": "https://www.songfacts.com/facts/queen/the-miracle",
  "Confidence": 1.0,
  "youtube-id": "2DaY8-Mui0I",
  "facts": [
    "Freddie Mercury was the principle composer of this song, though John Deacon contributed some of the chords and all four of the band members came up with lyrical ideas. It was the fifth and last single from The Miracle album.",
    "This is a lighthearted song with simple lyrics. Freddie Mercury sings of God's magnificent creations and how beautiful they are, such as, \"The Taj Mahal,\" \"Test tube babies being born,\" \"the Hanging Gardens of Babylon,\" \"Captain Cook,\" \"Cain and Abel\" and \"Jimi Hendrix.\" Many see this as not only Mercury's appreciation of life so close to his eventual death, but as a subtle nod to Jimi Hendrix, who he has often cited as being an inspiration to him, Queen, and many others. ",
    "Freddie Mercury pleads during the song for \"Peace on Earth and end to war\" and a day \"when we can all be friends\" - Mercury has suggested peace on Earth throughout his career, but this is clearly the most noticeable use of the message, as it is the central theme of the song. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n James - Vancouver, Canada, for all above\n                                                  \n                                                  ",
    "In Hard 'N' Heavy video magazine (1989, vol. 3), Brian May said: \"We got pasted to the wall for this in England. Everybody hated it, for some reason. It's very uncool to be idealistic in Britain, I suppose, at the moment, and they said, 'How can they talk about peace,' and all that sort of stuff, then of course, China happened and everything. It seems very relevant to us.\"\nRoger Taylor added: \"In England 'idealism' is 'naivety,' which is wrong, it's not. There's nothing wrong with idealism. Nick Lowe wrote that great song, great title - 'What's so bad about peace, love and understanding,' yeah, and what is so bad about.\""
  ],
  "lyrics": "Every drop of rain that falls in Sahara Desert says it all\nIt's a miracle\nAll God's creations great and small, the Golden Gate and the Taj Mahal\nThat's a miracle\nTest tube babies being born, mothers, fathers dead and gone\nIt's a miracle\nWe're having a miracle on Earth, mother nature does it all for us\nThe wonders of this world go on, the Hanging Gardens of Babylon\nCaptain Cook and Cain and Abel, Jimi Hendrix to the Tower of Babel\nIt's a miracle, it's a miracle, it's a miracle (it's a miracle)\n\nIt's a miracle\nThe one thing we're all waiting for, is peace on Earth and end to war\nIt's a miracle we need, the miracle\nThe miracle we're all waiting for today\n\nIf every leaf on every tree, could tell a story that would be a miracle\nIf every child on every street, had clothes to wear and food to eat\nThat's a miracle\nIf all God's people could be free, to live in perfect harmony\nIt's a miracle (we're having a miracle on Earth)\nMother nature does it all for us\n\nOpen hearts and surgery, Sunday mornings with a cup of tea\nSuper powers always fighting\nBut Mona Lisa just keeps on smiling\nIt's a miracle, it's a miracle, it's a miracle\n\n(The wonders of this world go on)\n\nWell it's a miracle, it's a miracle (it's a miracle)\nIt's a miracle\nThe one thing (the one thing)\nWe're all waiting for (we're all waiting for)\nIs peace on Earth (peace on Earth) and an end to war (end to war)\nIt's a miracle we need, the miracle\n\n(The miracle)\nPeace on Earth and end to war today\n\nThat time will come one day you'll see when we can all be friends\nThat time will come one day you'll see when we can all be friends\nThat time will come one day you'll see when we can all be friends\nThat time will come one day you'll see when we can all be friends\n                                                  \n                                                  Writer/s: Brian May, Freddie Mercury, John Deacon, Roger Taylor \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}