{
  "Artist": "Queen",
  "Album": "Greatest Hits III",
  "Title": "These Are The Days Of Our Lives",
  "URL": "https://www.songfacts.com/facts/queen/these-are-the-days-of-our-lives",
  "Confidence": 1.0,
  "youtube-id": "oB4K0scMysc",
  "facts": [
    "The video was filmed on May 30, 1991. It was Freddie Mercury's last filmed performance, as he died on November 24 of that year. Unreleased backstage footage of the shooting of the video appeared in the Days of our Lives documentary, showing Mercury's deteriorating physical condition (extremely skinny and pale) largely covered up by makeup and colorful attire. Brian May speculated in the documentary that Freddie was \"saying his goodbye\" in that video, knowing that he would likely not be healthy enough to perform anymore.",
    "The song was originally written by Roger Taylor about his children, and how parenthood made him look back on his own life. Inevitably, the song took on new meaning when it was announced that Freddie Mercury had AIDS and knew he was going to die soon when he recorded this.\nMercury did not tell the public about his disease until shortly before he died. It's highly likely this was also on Taylor's mind when he wrote the lyrics - Mercury told the band and manager Jim Beach about his AIDS diagnosis in 1987, but ordered them to keep it secret. Brian May described it in the Days of our Lives documentary: \"We hid everything. I guess we lied! Because we were trying to protect him.\"",
    "Freddie Mercury made sure the band worked on this song despite his illness. He wanted to make music until he was no longer physically capable, and with the band not touring due to Mercury's health, they spent a lot of their time in the studio working. Mercury insisted on the band giving him music and lyrics, and he would continue to record for as long as his health permitted. His bandmates speculated that recording helped Mercury deal with the illness.",
    "Queen drummer Roger Taylor wrote this. All four members of the band contributed songs individually, but in 1989 they began crediting any song to \"Queen\" instead of giving individual songwriting credit.",
    "In the UK, this was released as a double A-side single with the re-released \"Bohemian Rhapsody.\" Profits from the single, which went to #1 in the UK, went to AIDS research as a tribute to Mercury.",
    "Although Roger Taylor mimes the Conga Percussion in the video, it was recorded by the producer David Richards. Roger played a regular drum kit (as in Freddie's Tribute concert), and the keyboard part was programmed by all four of them in the studio. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Sebas - Tokyo, Japan\n                                                  \n                                                  ",
    "George Michael and Lisa Stansfield sang this together at the Freddie Mercury Tribute Concert at Wembley Arena in 1992. In a 2018 Billboard interview, Stansfield recalled the experience: \"Everybody who did that show was just so famous at the time. It was like, legends all over the place, but nobody had an ego. The rehearsals were quite subdued. I remember at the rehearsals I was gonna do the thing with George, and I went and got myself a big bacon roll because I was starving. I had on one of Ian's [Devaney, her husband and bandmate] coats and a big hat on. I really did look like a homeless person, buried in a bacon sandwich. Then I had to go do this thing with George, and he said, 'F--king hell, how can you go eat bacon and [sing like] that?'\""
  ],
  "lyrics": "Sometimes I get to feelin'\nI was back in the old days, long ago\nWhen we were kids, when we were young\nThings seemed so perfect, you know?\nThe days were endless, we were crazy, we were young\nThe sun was always shinin', we just lived for fun\nSometimes it seems like lately, I just don't know\nThe rest of my life's been, just a show\n\nThose are the days of our lives\nThe bad things in life were so few\nThose days are all gone now but one thing is true\nWhen I look and I find I still love you\nYou can't turn back the clock, you can't turn back the tide\nAin't that a shame?\nOoh, I'd like to go back one time on a roller coaster ride\nWhen life was just a game\nNo use in sitting and thinkin' on what you did\nWhen you can lay back and enjoy it through your kids\nSometimes it seems like lately, I just don't know\nBetter sit back and go, with the flow\n\nThese are the days of our lives\nThey've flown in the swiftness of time\nThese days are all gone now but some things remain\nWhen I look and I find, no change\n\nThose were the days of our lives, yeah\nThe bad things in life were so few\nThose days are all gone now but one thing's still true\nWhen I look and I find, I still love you\nI still love you\n                                                  \n                                                  Writer/s: BRIAN MAY, FREDDIE MERCURY, JOHN DEACON, ROGER TAYLOR \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}