{
  "Artist": "Queen",
  "Album": "Greatest Hits III",
  "Title": "Too Much Love Will Kill You",
  "URL": "https://www.songfacts.com/facts/queen/too-much-love-will-kill-you",
  "Confidence": 1.0,
  "youtube-id": "ivbO3s1udic",
  "facts": [
    "Originally intended for Queen's 1989 album,The Miracle, this song never made the final cut. Brian May included it instead on his 1991 solo album Back To The Light. When released as a single, it reached #5 on the UK Singles Chart, and topped the charts in the Netherlands.\nIt was finally released by Queen, with Freddie Mercury on the vocals, on their 1995 album Made In Heaven, released four years after Mercury's death. Queen dropped their version as a single the next year, this time peaking at #15 in the UK. It also charted in North America for the first time.",
    "In 1988 Brian May separated from his first wife, Christine Mullen, the mother of his three children. The Queen guitarist had started an affair with actress Anita Dobson two years earlier (they married in 2000). The song is about May's feelings during his divorce, and the choice one must make between two women that one loves equally.",
    "May wrote the song during a dark time in his life, composing it with his songwriting pal Frank Musker and Musker's lady friend at the time. \"It was like a therapy session for me,\" the guitar legend said. \"I was just pouring out all these words because I felt like I was trapped. I was in a place that I could never, ever get out of. All I could do is write about it. This is the only song I wrote in that probably nine months or a year period.\"",
    "Anita Dobson also inspired May to write Queen's 1989 hit \"I Want It All.\"",
    "Brian May suffered from severe depression in the late 1980s, in part because of his divorce and perceived failure as a husband and father. He told The Radio Times in 2004 this song saved his life a few times. \"You get a glimmer of hope from a song when you realize someone else felt the same despair,\" May explained. \"My own music doesn't necessarily speak to me. When I wrote Too Much Love Will Kill You I thought I was going to die being utterly depressed. I'm proud it's helped others who realize 'He made it out.'\"",
    "May performed this song publicly for the first time at the Freddie Mercury Tribute Concert in 1992. Because he debuted it live at the concert, a common misconception is that it was written as a tribute to Freddie Mercury.",
    "Queen's version won the Ivor Novello Award for Best Song Musically & Lyrically in 1996.",
    "Brian May included a new reworked version of \"Too Much Love Will Kill You\" on the 2021 reissue of Back To The Light."
  ],
  "lyrics": "I'm just the pieces of the man I used to be\nToo many bitter tears are raining down on me\nI'm far away from home\nAnd I've been facing this alone\nFor much too long\nOh, I feel like no-one ever told the truth to me\nAbout growing up and what a struggle it would be\nIn my tangled state of mind\nI've been looking back to find\nWhere I went wrong\n\nToo much love will kill you\nIf you can't make up your mind\nTorn between the lover\nAnd the love you leave behind\nYou're headed for disaster\n'Cause you never read the signs\nToo much love will kill you - every time\n\nI'm just the shadow of the man I used to be\nAnd it seems like there's no way out of this for me\nI used to bring you sunshine\nNow all I ever do is bring you down\nOh, how would it be if you were standing in my shoes\nCan't you see that it's impossible to choose\nNo there's no making sense of it\nEvery way I go I'm bound to lose\nOh yes\n\nToo much love will kill you\nJust as sure as none at all\nIt'll drain the power that's in you\nMake you plead and scream and crawl\nAnd the pain will make you crazy\nYou're the victim of your crime\nToo much love will kill you every time\n\nYes, too much love will kill you\nIt'll make your life a lie\nYes, too much love will kill you\nAnd you won't understand why\nYou'd give your life, you'd sell your soul\nBut here it comes again\nToo much love will kill you\nIn the end\nIn the end\n                                                  \n                                                  Writer/s: Elizabeth Lamers, Brian May, Frank Musker \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Universal Music Publishing Group\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}