{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "Under Pressure",
  "URL": "https://www.songfacts.com/facts/queen/under-pressure",
  "Confidence": 1.0,
  "youtube-id": "a01QQZyl-_I",
  "facts": [
    "A collaboration with David Bowie, this is credited to \"Queen with David Bowie\" because the B-side of the single is Queen's \"Soul Brother.\" It was recorded at an impromptu session in Montreaux, Switzerland in the summer of 1981.",
    "According to Queen bass player John Deacon, Freddie Mercury did most of the songwriting on this, although everyone contributed. The lyrics deal with how pressure can destroy lives, but love can be the answer. The lyrics are characteristic of Mercury's songwriting.\nDeacon however did come up with the iconic two-note bass riff, although it came very close to vanishing: according to Roger Taylor in the Days of our Lives documentary, Deacon came up with the riff, then the band went for pizza before coming back to continue rehearsals. Upon returning, Deacon had completely forgotten his idea! Luckily, Taylor eventually remembered how the bassline went.",
    "Brian May recalled to Mojo magazine October 2008. \"It was hard, because you had four very precocious boys and David, who was precocious enough for all of us. David took over the song lyrically. Looking back, it's a great song but it should have been mixed differently. Freddie and David had a fierce battle over that.\"\nMay adds to this feeling of the sessions being fairly strained in a further interview for the Days of our Lives documentary, where he notes that \"suddenly you've got this other person inputting, inputting, inputting... he (David) had a vision in his head, and it's quite a difficult process and someone has to back off... and eventually I did back off, which is unusual for me.\"",
    "In the US, this was on Queen's Greatest Hits album and released as a single at the same time. It was not released on a UK album until six months later, when it was included on Hot Space.",
    "This was only the second UK #1 hit for Queen. They hit #2 with \"Crazy Little Thing Called Love,\" \"We Are The Champions,\" \"Somebody To Love,\" and \"Killer Queen,\" but their only previous #1 in England was \"Bohemian Rhapsody.\"",
    "In the early '80s, it was popular for two superstars to get together to release a hit single. Other notable combinations include Paul McCartney and Stevie Wonder on \"Ebony And Ivory,\" Diana Ross and Lionel Richie on \"Endless Love,\" and Kenny Rogers and Dolly Parton on \"Islands in the Stream.\" \"Under Pressure\" marked the first time Queen collaborated with another artist.",
    "David Bowie performed this with Annie Lennox at the 1992 \"Concert For Life\" in Wembley Stadium, London. The show was a tribute to Freddie Mercury, with proceeds going to AIDS causes.",
    "Vanilla Ice sampled this on \"Ice Ice Baby,\" which was a huge hit in 1990. Details are fudgy, but it appears that the sample was never cleared and a settlement was reached with Queen and Bowie long after Vanilla's song hit it big.",
    "This song has been used in a number of movies, including 2002's 40 Days And 40 Nights and 2004's The Girl Next Door. It is also included in the hugely successful Queen tribute show We Will Rock You. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Jeffrey - Victoria, Canada\n                                                  \n                                                  ",
    "During the Taste Of Chaos tour, the singers from My Chemical Romance and The Used would come out and perform this song at the end of the show. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Kyle - Montreal, Canada\n                                                  \n                                                  ",
    "Joss Stone covered this for the 2005 Queen tribute album Killer Queen. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Rachel - South Point, OH\n                                                  \n                                                  ",
    "Reinhold Mack, who did production work on the Hot Space album, told an amusing story about the vocal recording for \"Under Pressure,\" where one of the two singers would record their improvised vocals with the other being locked out so they couldn't hear what the other was doing.\nSaid Mack: \"Freddie is doing all his bits and pieces and I see out of the corner of my eye David sticking his head in and listening. Then Fred came down and David went up, and Fred was quite impressed how David was counterpointing to what he (Freddie) had done before. Fred said 'what do you make of this?' and I said 'Well, it's kinda easy if you stand in the doorway and listen!'\"\nAt which point Freddie apparently had some choice words for David!",
    "According to a 2017 Mojo interview with Brian May, Freddie and David \"locked horns\" in the studio. Asked to elaborate, the Queen guitarist replied: \"In subtle ways, like who would arrive last at the studio. So it was sort of wonderful and terrible. But in my mind I remember the wonderful now, more than the terrible.\"",
    "The two singers first met a dozen years before they recorded the song. In 1969, Freddie Mercury fitted David Bowie for a pair of boots during his day job working on a boot stall in Kensington Market."
  ],
  "lyrics": "Mmm num ba de\nDum bum ba be\nDoo buh dum ba beh beh\n\nPressure pushing down on me\nPressing down on you, no man ask for\nUnder pressure that burns a building down\nSplits a family in two\nPuts people on streets\n\nUm ba ba be\nUm ba ba be\nDe day da\nEe day da, that's okay\n\nIt's the terror of knowing what the world is about\nWatching some good friends screaming, \"Let me out\"\nPray tomorrow gets me higher\nPressure on people, people on streets\n\nDay day de mm hm\nDa da da ba ba\nOkay\nChipping around, kick my brains around the floor\nThese are the days it never rains but it pours\nEe do ba be\nEe da ba ba ba\nUm bo bo\nBe lap\nPeople on streets\nEe da de da de\nPeople on streets\nEe da de da de da de da\n\nIt's the terror of knowing what the world is about\nWatching some good friends screaming, \"Let me out\"\nPray tomorrow gets me higher, high\nPressure on people, people on streets\n\nTurned away from it all like a blind man\nSat on a fence but it don't work\nKeep coming up with love but it's so slashed and torn\nWhy, why, why?\nLove, love, love, love, love\nInsanity laughs under pressure we're breaking\n\nCan't we give ourselves one more chance?\nWhy can't we give love that one more chance?\nWhy can't we give love, give love, give love, give love\nGive love, give love, give love, give love, give love?\n\n'Cause love's such an old fashioned word\nAnd love dares you to care for\nThe people on the edge of the night\nAnd love dares you to change our way of\nCaring about ourselves\nThis is our last dance\nThis is our last dance\nThis is ourselves\n\nUnder pressure\nUnder pressure\nPressure\n                                                  \n                                                  Writer/s: David Bowie, John Richard Deacon, Brian Harold May, Freddie Mercury, Roger Meddows Taylor \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, TINTORETTO MUSIC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}