{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "We Are The Champions",
  "URL": "https://www.songfacts.com/facts/queen/we-are-the-champions",
  "Confidence": 1.0,
  "youtube-id": "04854XqcfCY",
  "facts": [
    "Queen lead singer Freddie Mercury wrote this. All four members of Queen contributed hit songs to the band's repertoire. Brian May wrote this song's counterpart, \"We Will Rock You.\"",
    "Freddie Mercury stated: \"I was thinking about football when I wrote it. I wanted a participation song, something that the fans could latch on to. Of course, I've given it more theatrical subtlety than an ordinary football chant. I suppose it could also be construed as my version of 'I Did It My Way.' We have made it, and it certainly wasn't easy. No bed of roses as the song says. And it's still not easy.\"",
    "This was released as a double A-side single with \"We Will Rock You.\" On the album, it flows seamlessly from \"We Will Rock You,\" which led disc jockeys to play the songs together. Even when CDs allowed the tracks to be separated, the two songs were still usually played together.",
    "This is commonly played at victory celebrations by sports teams, especially in the US. This extends to victory parades in a addition to on-field celebrations, where it is often played alongside Kool & the Gang's \"Celebration.\"",
    "Since the song was written with audience participation in mind, it is not intended as a boast on behalf of the band - \"We\" refers to everyone who is singing along at that time. The same holds true for its counterpart, \"We Will Rock You.\"",
    "In 1992, a New Jersey high school helped revive this song in America. Students in Clifton, New Jersey asked to sing it at their graduation, but the principal refused because he associated it with Freddie Mercury, who had died of AIDS the year before. This led the students to flood New York radio station Z100 with requests for the song, which the station started playing in sympathy for their cause. Queen had already been revived in the US by \"Bohemian Rhapsody,\" which was used in the movie Wayne's World, so their appeal to the next generation was evident. \"We Are The Champions\" caught on as well, prompting their record company to re-release the single, which made #52.",
    "This was used in the end credits of the 1992 movie The Mighty Ducks, starring Emilio Estevez. Two years later, it was played again at the end credits of the sequel, D2, in the scene where the team is huddled around a fire and they are singing the song. As a result, the song became more popular among teens and children who play sports. The movie spawned a new name for an NHL team a year after the first movie was made. Both the team (The Mighty Ducks) and the movie are owned by Disney. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Britney - Calabasas, CA\n                                                  \n                                                  ",
    "In 2001, Queen members Brian May and Roger Taylor recorded a new version of this with British singer Robbie Williams. This version was used in the movie A Knight's Tale.",
    "Gavin DeGraw recorded this for the 2005 Queen tribute album Killer Queen. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Rachel - South Point, OH\n                                                  \n                                                  ",
    "Formula 1 driver Fernando Alonso sang the song after winning the 2005 Chinese Grand Prix, securing the Contructors' title for his team, Renault. The team later released an MP3 of the song being \"played\" by the engine they had used in that season, with the different notes played by changing engine speeds to adjust the pitch of the engine sound and exhaust note.\nA few years later in 2009, Jenson Button repeated this trick when he won the driver's championship for Brawn GP - singing the song over the radio on his slowdown lap at the Brazilian GP.",
    "This song featured in a 2014 commercial for the Audi A3. In the spot, various celebrities, including the actress Kristen Schaal and the chef David Chang, recite lines from the song before Ricky Gervais to turn up the car's radio for the chorus.",
    "Donald Trump used this song at campaign rallies when he was running for the Republican nomination in 2016. On June 8, Brian May posted a message on his website, stating, \"I can confirm that permission to use the track was neither sought nor given. We are taking advice on what steps we can take to ensure this use does not continue. Regardless of our views on Mr. Trump's platform, it has always been against our policy to allow Queen music to be used as a political campaigning tool. Our music embodies our own dreams and beliefs, but it is for all who care to listen and enjoy.\"\nThe song fit Trump's theme of \"winning,\" and knowing May had no legal ground to stop him from using it, he continued to do so, including on July 18 when he used it as his entrance music on opening night of the Republican Convention in Cleveland. \"We're going to win so big,\" he said when he took the microphone.",
    "Brian May, Roger Taylor and singer Adam Lambert recorded a new version of the song to honor frontline workers during the 2020 coronavirus pandemic. Queen released the inspiring new version, titled \"You Are The Champions\" on April 2020, with all proceeds going towards Covid-19 Solidarity Response Fund for The World Health Organization. \nThe idea came about when the three virtually jammed out to the song on Instagram and Lambert changed the lyrics mid-song to \"You are the champions.\"\n\"You Are The Champions\" was a big hit in Japan, topping the country's National Radio Air Play Chart for International Music."
  ],
  "lyrics": "I've paid my dues\nTime after time\nI've done my sentence\nBut committed no crime\nAnd bad mistakes \nI've made a few\nI've had my share of sand kicked in my face\nBut I've come through\n\nWe are the champions, my friends\nAnd we'll keep on fighting 'til the end\nWe are the champions\nWe are the champions\nNo time for losers\n'Cause we are the champions of the world\n\nI've taken my bows\nAnd my curtain calls\nYou brought me fame and fortune and everything that goes with it\nI thank you all\n\nBut it's been no bed of roses\nNo pleasure cruise\nI consider it a challenge before the whole human race\nAnd I ain't gonna lose\n\nWe are the champions, my friends\nAnd we'll keep on fighting 'til the end\nWe are the champions\nWe are the champions\nNo time for losers\n'Cause we are the champions\n\nWe are the champions, my friends\nAnd we'll keep on fighting 'til the end, oh\nWe are the champions\nWe are the champions\nNo time for losers\n'Cause we are the champions of the world\n                                                  \n                                                  Writer/s: Freddie Mercury \n\n                                                   Publisher: Sony/ATV Music Publishing LLC, Tratore\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}