{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "We Will Rock You",
  "URL": "https://www.songfacts.com/facts/queen/we-will-rock-you",
  "Confidence": 1.0,
  "youtube-id": "-tJYN-eG1zk",
  "facts": [
    "Queen guitarist Brian May wrote this, and claimed the idea for the song came in a dream. He told Mojo magazine October 2008 that he wanted to \"create a song that the audience could participate in.\"\nIn the Days of Our Lives documentary, he remembered a gig where the crowd chanted the Liverpool Football Club anthem, \"You'll Never Walk Alone\" at the band as they left the stage. \"I went to bed thinking, 'What could you ask them to do?' They're all squeezed in there, but they can clap their hands, they can stamp their feet, and they can sing,\" he noted. \"In the morning I woke up and had the idea in my head for 'We Will Rock You.\"",
    "Freddie Mercury wrote the song that follows on the album, \"We Are The Champions.\" Although Queen did not intend it this way, the two songs are usually played together. The songs segue together on the album, so disc jockeys would let them play, which is how listeners got used to hearing it.\n\"We Will Rock You\" was released as a double A-side single with \"We Are The Champions.\" Since the single's release, the band has almost always used \"Rock You\" and \"Champions\" as a back-to-back encore, with \"Champions\" closing the show and segueing into a tape playing Queen's version of \"God Save The Queen.\"",
    "A funny story emerged from the sessions surrounding \"We Will Rock You.\" The punk band Sex Pistols were recording at Wessex studios around the same time, and bassist Sid Vicious drunkenly interrupted the Queen sessions to berate Mercury and ask if he'd \"brought ballet to the masses\" yet, as he'd been quoted as wanting to do in an earlier NME interview. \n\"I called him, I dunno, Simon Ferocious or something, and just pushed him out. I think... yeah, I think we passed that test\" noted Freddie with a wink in one interview, whilst drummer Taylor noted in the Days of our Lives documentary that Vicious was \"a moron... an idiot!\"\nPerhaps this all explains the lyrics to 'We Will Rock You'?\nIncidentally, it was Queen who accidentally gave the Sex Pistols their big break - they pulled out of an appearance on the Grundy TV show, so label EMI sent the Sex Pistols on in their place in what turned out to be the infamous \"filth and the fury\" interview.",
    "This is often used for comedic effect in TV shows. A few examples:\nIn the 1990 Cheers episode \"Severe Crane Damage,\" patrons at the bar gradually form the famous rhythm with glasses, pool cues, and whatever items are handy.\nIn the 1991 Full House episode \"Happy Birthday, Babies (Part 2),\" Lori Loughlin's character is doing Lamaze breathing exercises while giving birth, prompting Bob Saget's character to sing \"We Will Rock You\" to her breaths.\nIn the 1998 Friends episode \"The One Where Ross Moves In,\" Ross changes Chandler's answering machine message to \"we will, we will... call you back.\"\nIn the 2015 episode of The Big Bang Theory \"The Bachelor Party Corrosion,\" the scientist main characters are attempting to change a tire. As one of them bangs on it, another adds the beat to create the rhythm to the song and another sings the first verse.\nHere are some other TV uses:\nGlee (\"Lights Out\" - 2013)\nSouth Park (\"Elementary School Musical\" - 2008)\nUgly Betty (\"Secretaries Day\" - 2007)\nThe Simpsons (\"Please Homer, Don't Hammer 'Em\" - 2006, \"Wild Barts Can't Be Broken\" - 1999)\nMarried... with Children (\"Shoeless Al\" - 1995)",
    "The remaining members of Queen performed this at their induction into the Rock and Roll Hall of Fame in 2001. Brian May and Roger Taylor took turns on the vocals.",
    "On Queen's next album, they had another set of songs disc jockeys played together. \"Bicycle Race\" and \"Fat Bottomed Girls\" were segued together on their album Jazz. Those songs were also released as a double A-side single.",
    "In the US, this is often played at sporting events in an effort to intimidate the opposing team. It plays well in stadiums where fans are encouraged to stomp their feet and make a lot of noise.",
    "In London, a Queen musical called We Will Rock You opened in 2002. The show is about a futuristic world where there are no musical instruments and a lack of creativity, but with the help of Queen's music, a bunch of renegades liberate the planet. It was panned by critics, but became a very popular show. In 2004, the show opened in Las Vegas.",
    "Notable movie uses of this song include the 2001 film A Knight's Tale, where the song is used to open the film. In the Mighty Ducks movies, this song is used to fire up the crowds just like in real-life hockey. But this time, it's sung as \"we will quack you.\" Other movie uses include:\nHeaven Is for Real (2014)\nSucker Punch (2011)\nThe Pacifier (2005)\nDodgeball: A True Underdog Story (2004)\nThe Recruit (2003)\nThe Replacements (2000)\nAny Given Sunday (1999)\nFM (1978)",
    "In 2004, this was used in a lavish commercial for Pepsi that ran in the UK. The ad featured Brian May, Roger Taylor, Britney Spears, Beyoncé and Pink dressed up as ancient Romans.\nIn a similarly anachronistic 2018 Super Bowl spot, a Ram truck tows a Viking ship to Minneapolis, where the Vikings are confronted with the bad news: the Minnesota Vikings didn't make the big game (they lost in the playoffs to the Philadelphia Eagles, who beat the New England Patriots to take the title).",
    "Queen recites a passage from Hermann Hesse's novel Siddhartha in their 1977 BBC re-take of the song. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Kaity - Harrisburg, PA\n                                                  \n                                                  ",
    "Queen often performed a faster version of the song at their concerts, since they wanted an up-tempo song to start the show and get the crowd going. In the late '70s and early '80s, they would often open their shows with this version. This can be heard on their 1979 Live Killers album, as well as the 1981 Rock Montreal DVD and the 1982 On Fire Live at the Bowl DVD. It was replaced in the setlist as the opener by \"One Vision\" in 1986. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  ",
    "The band noted that for the News of the World album in 1977, they wanted to go for a more simple, stripped-down sound. Roger Taylor notes in several interviews that perhaps this was a response to the Punk explosion, which actively encouraged stripped-down instrumentation. \"We knew we couldn't reinvent ourselves into a punk band, but perhaps maybe we could make it a bit more simple... to keep more in tune with what was going on at the time\" notes the drummer. The band (except for Brian May, of course) even got shorter haircuts around this time.\nMay said in Q magazine, March 2008: \"At the opposite extreme stylistically (referring to the musical excess of \"The Millionaire Waltz\"), there's almost nothing in this. It's our 'three ages of man' anthem.\"",
    "Queen never released this as a single in the UK. However in 2000 the boy band Five decided they wanted to cover the track and they approached the remaining members of Queen. Not only did they say yes, but also Brian May and Roger Taylor agreed to play on it. This version, which was credited to Five and Queen, spent one week at the top of the UK singles chart.",
    "In an interview with National Public Radio's Terry Gross, Brian May said that his degree in astrophysics helped in the recording of the crucial 'stomp-stomp-clap!\" rhythm of the song. He explained: \"Being a physicist, I said, 'Suppose there were 1,000 people doing this; what would be happening?' And I thought, Well, you would be hearing them stamping. You would also be hearing a little bit of an effect, which is due to the distance that they are from you. So I put lots of individual repeats on them. Not an echo but a single repeat at various distances. And the distances were all prime numbers.\"\nMay continued: \"Now, much later on, people designed a machine to do this. But that's what we did. When we recorded each track, we put a delay of a certain length on it. And none of the delays were harmonically related. So there's no echo on it whatsoever, but the clapped sound - they spread around the stereo, but they also kind of spread from a distance from you - so you just feel like you're in the middle of a large number of people stamping and clapping.\"",
    "Brian May told NPR how recording the song in a church helped with its sound. \"We were very lucky,\" he said. \"We were working in an old, disused church in North London, and it already had a nice sound. And there were some old boards lying around, but they just seemed ideal to stamp on.\"\nHe expanded on this in the Days of our Lives documentary: \"I found some old boards under the stairs, and thought - well, what does this sound like? And the rest is history.\"",
    "According to a survey by royalty-distribution service BMI, based off data from MLB, NFL and NHL games in 2009-2010, this is the most-played song at sporting events. The #2 song was Kevin Rudolf's \"Let It Rock,\" followed by Nickelback's \"Burn It To The Ground.\"",
    "At the 2012 London Olympics Closing Ceremony, Queen - represented by Taylor and May - appeared, and performed this song with the British Pop star Jessie J.",
    "At the 2012 Reading Festival, headliners My Chemical Romance invited Brian May onstage with them for their encore, and he was welcomed on to the stage by the \"We Will Rock You\" beat. May accordingly performed his signature solo, then played on MCR's song \"Welcome To The Black Parade\" to close the show. For MCR the show was significant - the previous time they had appeared at Reading Festival they had been booed and bottled, and so had refused to appear ever since. Queen was similarly scorned at a French festival in the early 1980s, hence why MCR singer Gerard Way wanted Brian May to appear with the band.",
    "The song does not contain any actual drums. That famous rhythm came from the sound of the band, roadies, engineers - and even their tea lady, Betty - stamping their feet in London's Wessex Studios.",
    "In 1995, Domino's used this in commercials to introduce their new buffalo wings, changing the lyric to: \"Gotta be, gotta be Domino's... buffalo wings.\"",
    "Linda Ronstadt transformed this into a quiet lullaby for her 1996 children's album, Dedicated To The One I Love. The beat is held by Ronstadt's daughter sucking on a pacifier and a sample of a heartbeat. The singer got the idea when she was rocking her infant son to sleep.",
    "Queen (with Adam Lambert on lead vocals) performed this, followed by \"We Are The Champions,\" to open the Oscars in 2019. The Queen biopic Bohemian Rhapsody was nominated for five awards, including Best Picture."
  ],
  "lyrics": "Buddy, you're a boy, make a big noise\nPlaying in the street, gonna be a big man someday\nYou got mud on your face, you big disgrace\nKicking your can all over the place, singin'\n\nWe will, we will rock you\nWe will, we will rock you\n\nBuddy, you're a young man, hard man\nShouting in the street, gonna take on the world someday\nYou got blood on your face, you big disgrace\nWaving your banner all over the place\n\nWe will, we will rock you, sing it!\nWe will, we will rock you, yeah\n\nBuddy, you're an old man, poor man\nPleading with your eyes, gonna get you some peace someday\nYou got mud on your face, big disgrace\nSomebody better put you back into your place, do it!\n\nWe will, we will rock you, yeah, yeah, come on\nWe will, we will rock you, alright, louder!\nWe will, we will rock you, one more time\nWe will, we will rock you\nYeah\n                                                  \n                                                  Writer/s: Brian Harold May \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}