{
  "Artist": "Queen",
  "Album": "Greatest Hits II",
  "Title": "Who Wants To Live Forever",
  "URL": "https://www.songfacts.com/facts/queen/who-wants-to-live-forever",
  "Confidence": 1.0,
  "youtube-id": "_Jtpf8N5IDE",
  "facts": [
    "Queen was commissioned to write this for the movie Highlander, and Brian May wrote it after watching the first cut of the film. He wrote the line \"Who wants to live forever\" in a cab on his way home from the viewing of the film. Inspiration came from the scene where Connor Macleod (Christopher Lambert) takes his dying wife Heather (Biettie Edney) in his arms at the time of her death. This is also the scene where the song is played.",
    "In the film, Freddie Mercury sings the first verse, but on the album, Brian May sings the first verse and Freddie sings the rest.",
    "This was covered by Breaking Benjamin for the album Killer Queen, A tribute to Queen in 2005. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Kyle - Valdosta, GA, for above 3\n                                                  \n                                                  ",
    "An instrumental version of the song called \"Forever\" was included as a bonus track on the CD release of A Kind Of Magic. This instrumental was only a piano (played by Brian May) with keyboard accompaniment during the chorus sections. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Bertrand - Paris, France\n                                                  \n                                                  "
  ],
  "lyrics": "There's no time for us.\nThere's no place for us.\nWhat is this thing that builds our dreams, yet slips away from us?\n\n*Who wants to live forever?(x2)\n\nThere's no chance for us.\nIt's all decided for us.\nThis world has only one sweet moment set aside for us.\n\n*\n\nWho dares to love forever?\nWhen love must die.\n\nBut touch my tears with your lips.\nTouch my woe with your fingertips.\n\nAnd we can have forever.\nAnd we can love forever.\nForever is our today.\n\n*\n\nForever is our today.\nWho waits forever anyway?\n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  \n                                                  "
}