{
  "Artist": "Queen",
  "Album": "Greatest Hits I",
  "Title": "You're My Best Friend",
  "URL": "https://www.songfacts.com/facts/queen/youre-my-best-friend",
  "Confidence": 1.0,
  "youtube-id": "HaZpZQG2z10",
  "facts": [
    "Queen bass player John Deacon wrote this song. All four members of the group wrote at least one of their hits.",
    "John Deacon wrote this song about his wife. He enjoyed a rather quiet home life, and particularly in the early days of the group he was very shy and quiet, unwilling to put his song suggestions forward.\nAfter Freddie Mercury died in 1991, Deacon became something of a recluse - he was involved in the posthumous album Made in Heaven, and on the 1997 single \"No-One But You,\" he retired from music and has declined to tour with the band on their subsequent tours with Paul Rodgers and Adam Lambert. The band still maintains contact with him, and run decisions by him - according to Brian May, the rule is that if Deacon does not reply to an email, that's his way of saying it has his approval.",
    "Deacon played an electric piano on this track, which was a popular choice at the time, with many rock songs by the likes of Stevie Wonder and Steely Dan using one. The piano was either a Fender Rhodes or a Wurlitzer, or possibly a combination of both - sources vary. Deacon wanted to write a song incorporating the instrument, but Freddie Mercury, the group's keyboard man, did not want to play it. \"I refused to play that damn thing,\" Mercury said. \"It's tiny and horrible and I don't like them. Why play those when you have a lovely superb piano.\"\nSo Deacon took the electric piano home, learned to play it, and started writing this song.",
    "This was the follow-up single to \"Bohemian Rhapsody.\" It was also Queen's second song (after \"Bohemian Rhapsody\") to have an accompanying promo video filmed for it.",
    "A surround-sound remix of this was included when the album was re-released in 2002.",
    "This was featured at the end of the zombie movie parody Shaun Of The Dead, as well as the Adam Sandler film I Now Pronounce You Chuck And Larry. It was also used in the opening credits of the movie The Breakup starring Jennifer Aniston and Vince Vaughn, while a slideshow of their pictures are rolling. \n                                                  >>\n                                                  \n                                                  Suggestion credit:\n Raina - Manila, Philippines, Tommi - Porvoo, Finland and Mike - Detroit, MI\n                                                  \n                                                  "
  ],
  "lyrics": "Ooh, you make me live\nWhatever this world can give to me\nIt's you you're all I see\nOoh, you make me live now honey\nOoh, you make me live\n\nOh, you're the best friend that I ever had\nI've been with you such a long time\nYou're my sunshine and I want you to know\nThat my feelings are true\nI really love you\nOh, you're my best friend\n\nOoh, you make me live\n\nOoh, I've been wandering 'round\nBut I still come back to you\nIn rain or shine\nYou've stood by me girl\nI'm happy at home\nYou're my best friend\n\nOoh, you make me live\nWhenever this world is cruel to me\nI got you to help me forgive\nOoh, you make me live now honey\nOoh, you make me live\n\nYou're the first one\nWhen things turn out bad\nYou know I'll never be lonely\nYou're my only one\nAnd I love the things\nI really love the things that you do\nOh, you're my best friend\n\nOoh, you make me live\n\nI'm happy at home\nYou're my best friend\nOh, you're my best friend\nOoh, you make me live\nYou're my best friend\n                                                  \n                                                  Writer/s: John Deacon \n\n                                                   Publisher: Sony/ATV Music Publishing LLC\n\n                                                  Lyrics licensed and provided by LyricFind\n                                                  \n                                                  \n                                                  \n                                                  "
}