{
 "_type": "song",
 "annotation_count": 6,
 "api_path": "/songs/1567053",
 "full_title": "Bird's Word by The Last Poets",
 "header_image_thumbnail_url": "https://images.genius.com/feda8bc2161ed6c73be4c46648d18a75.300x300x1.jpg",
 "header_image_url": "https://images.genius.com/feda8bc2161ed6c73be4c46648d18a75.497x497x1.jpg",
 "id": 1567053,
 "instrumental": false,
 "lyrics_owner_id": 1549345,
 "lyrics_state": "complete",
 "lyrics_updated_at": 1616848370,
 "path": "/The-last-poets-birds-word-lyrics",
 "pyongs_count": null,
 "song_art_image_thumbnail_url": "https://images.genius.com/feda8bc2161ed6c73be4c46648d18a75.300x300x1.jpg",
 "song_art_image_url": "https://images.genius.com/feda8bc2161ed6c73be4c46648d18a75.497x497x1.jpg",
 "stats": {
  "unreviewed_annotations": 6,
  "hot": false
 },
 "title": "Bird’s Word",
 "title_with_featured": "Bird's Word",
 "updated_by_human_at": 1616848370,
 "url": "https://genius.com/The-last-poets-birds-word-lyrics",
 "song_art_primary_color": "#fc5207",
 "song_art_secondary_color": "#731d17",
 "song_art_text_color": "#fff",
 "primary_artist": {
  "_type": "artist",
  "api_path": "/artists/2582",
  "header_image_url": "https://images.genius.com/0c144909375314c8ca3e544017a9307f.300x180x1.jpg",
  "id": 2582,
  "image_url": "https://images.genius.com/a4a798abf88f32abcd9c8969a199f0a1.687x687x1.jpg",
  "index_character": "l",
  "is_meme_verified": false,
  "is_verified": false,
  "name": "The Last Poets",
  "slug": "The-last-poets",
  "url": "https://genius.com/artists/The-last-poets"
 },
 "artist": "The Last Poets",
 "lyrics": "Everything was silent\nAnd then Ma Rainey spread Black News\nBy way of the Backwater Blues\nAs Bessie Smith picked up on it\nAnd spread the word, thru music and song\nThen the message passed on\nTo Chick Webb, King Oliver, Buddy Bolden and Jelly Roll Morton\nAnd they played the word and passed it along to Louis Armstrong\nFats Navarro, Charlie Ventura, Roy Eldridge and Fats Waller\nWho was known to holler\nThe joint is jumpin with a Fatman's joy\nAs everybody started Stompin' at the Savoy\nThen the word grew strong, as the immortal Bird came along\nAnd blew all the Blackness that was true\nWith some Be-Bop brand new\nTurning everybody on, with his unforgettable horn\nAs Lester Young became the first Prez of our race\nAnd we turned around and dug on the beautiful face of Billie Holiday\nAs Billie began to sing praises to the blackman's thing\nThe good Brother Monk threw in some funk\nSo that the whole world could see\nWhat he is, was and always will be\nA genius creatively!\nThen Miles began to set new styles\nThat put us miles ahead\nAs Dizzy set us free to be ourselves\nAnd ride to heaven from hell in the latest\nEl-Do-Ra-Do, comin' far to carry us home!\nThen Dinah sang finer\nAs Duke and Ella rode to fame\nGoin' to Harlem on the A train\nAnd we tuned into Charlie Mingus's bass\nSetting a soulful pace\nThat let us taste the down sound\nThat found our hearts beating to the voice and drums\nOf Abbey Lincoln and Max Roach\nIn their hip approach to Blackness!\nThen Eddie Jefferson crooned an original tune\nAs Lambert, Hendricks and Ross scatted a new course\nAnd we sampled King Pleasure's treasure\nAnd listened to James Moody's moans\nAnd then dug the dynamite drums of Brother Philly Joe Jones!\nAs Milt Jackson played the vibes in leaps and strides\nWith the MJQ (MJQ = Modern Jazz Quartet)\nThat sped our prides into sophisticate funkiness\nMeanwhile, Sonny Rollins was building a bridge\nFor us to leave behind our grief\nFor the soulful relief\nTo find our own black minds\nTo tune in on Bud Powell\nWho played the piano with funky hands\nAs he filled the seats and made 'em stand\nOn funky nights down Birdland (jazz club in NYC)\nThen the Mighty Hawk made his horn talk (Coleman Hawkins)\nAnd we heard Baby Ray play What'd I say\nAnd jammed the set to dig Ornette\nAs Art Blakey broke free\nSpreadin' the message to you and me\nTo dig on the trumpet of KD (KD = Kenny Dorham)\nAs we broadened our range\nAnd counted our change with Basie\nAs Earl Fatha Hines blew our minds\nAnd we grew fonder of Errol Garner\nAs Eddie Harris bent our ear talkin' bout Listen Here\nAnd Eric Dolphy made his stand\nWith a side called Ironman\nAnd Gene Ammons told his soul\nAnd we mined Horace's Silver\nThat bought funky gold\nThen Oscar Brown and Joe Williams got down\nAnd we spun around, spun around, spun around, spun around, spun around\nSpun around, spun around, spun around, spun around, spun around\nSpun around, spun around, spun around, spun around\nAnd dug Clifford Brown\nWowin' a sweet funky sound of soul\nWith a rhythm of gold\nAnd along, and along, and along, and along, and along, and along, and along\nAnd along, and along, and along, and along, and along, and along\nAnd along, and along, and along, and along\nCame 'trane!\nWho blew away all the pain, all the pain, all the pain, all the pain, all the pain\nAll the pain, all the pain, all the pain, all the pain, all the pain\nIn the name of all the Black People on the Planet Earth\nAnd all the stars in the cosmic universe!\nAs Brother 'trane blew to the East\nTo destroy the beast\nAnd bring back Peace to Black People!\nAnd everybody heard the majestic word of trane's horn\nTelling us of a Love Supreme for Black People\nThat grew strong, and on, and on, and on, and on, and on, and on\nAnd on, and on, and on, and on, and on, and on, and on, and on\nAnd on, and on, and on, and on, and on, and on, and on\nFrom the soul, from the heart\nFrom the spirit, from the brain\nFrom the love of Brother John Coltrane!\nThen Jimmy Smith got funky with it\nAnd preached a sermon not to Walk on the Wild Side\nBut ride with Wes Montgomery\nWho played his best everyday in our life\nAs Shirley Scott's organ got hot\nAnd she and Stanley set more funk free! (Stanley Turrentine)\nAs Ahmad Jamal played with renewed ability\nTo give our minds some Tranquility\nSo that we could listen to an in-soul depth\nBrother Archie Shepp\nAs Jackie McLean broke on the scene\nBlowing mean and harder\nFor everybody to listen to Betty Carter\nAs Sun Ra shined\nAnd Cannonball's horn whined\nMercy! Mercy! Mercy!\nSo Sonny Stitt started piping it\nAnd we couldn't get enough of brother Jack McDuff\nAs Freddie Hubbard began to bud\nAnd we heard from Donald Byrd\nAnd they'll be no others like the Ayter Brothers\nThen Wayne Shorter grew taller\nAnd our ship left dock with Herbie Hancock\nAs we rolled with Lee Morgan\nAnd Grooved on Richard Holmes' organ\nAnd then dug the soul of Art Tatum\nProduce the sound that made him\nAs Rufus Harley blew an old new type bagpipe\nThat put the pants back on the man\nAn' Nina Simone groaned Mississippi Goddam!l\nAnd Brother McCoy gave us peace and joy\nAs Elvin bought our freedom Jones down on us! (Elvin Jones)\nThen Charles Lloyd filled the void\nAn' we watched Roland Kirk work!\nAnd with a sigh of relief listened to Yusef Lateef\nBlow in a flow of flurry's of peace from the east\nAs Pharaoh Sanders floated down the Nile with Brother Leon Thomas\nTo herald the promise of peace and happiness throughout the land!\nAll praises due to the Creator of the\nBlackman!\nBlackman!EmbedShare URLCopyEmbedCopy"
}