{
 "_type": "song",
 "annotation_count": 1,
 "api_path": "/songs/182063",
 "full_title": "7.1. From The Jazz Age to bebop by Luke Davis",
 "header_image_thumbnail_url": "https://images.genius.com/f3ae1230e352187a93863cce1390ec90.300x300x1.jpg",
 "header_image_url": "https://images.genius.com/f3ae1230e352187a93863cce1390ec90.1000x1000x1.jpg",
 "id": 182063,
 "instrumental": false,
 "lyrics_owner_id": 55781,
 "lyrics_state": "complete",
 "lyrics_updated_at": null,
 "path": "/Luke-davis-71-from-the-jazz-age-to-bebop-lyrics",
 "pyongs_count": null,
 "song_art_image_thumbnail_url": "https://images.genius.com/f3ae1230e352187a93863cce1390ec90.300x300x1.jpg",
 "song_art_image_url": "https://images.genius.com/f3ae1230e352187a93863cce1390ec90.1000x1000x1.jpg",
 "stats": {
  "unreviewed_annotations": 0,
  "hot": false
 },
 "title": "7.1. From The Jazz Age to bebop",
 "title_with_featured": "7.1. From The Jazz Age to bebop",
 "updated_by_human_at": 1372706459,
 "url": "https://genius.com/Luke-davis-71-from-the-jazz-age-to-bebop-lyrics",
 "song_art_primary_color": "#ac7052",
 "song_art_secondary_color": "#5c3c2c",
 "song_art_text_color": "#fff",
 "primary_artist": {
  "_type": "artist",
  "api_path": "/artists/58367",
  "header_image_url": "https://images.genius.com/d5773b8790faef9415751122af6dbdf2.960x611x1.jpg",
  "id": 58367,
  "image_url": "https://images.genius.com/f3ae1230e352187a93863cce1390ec90.1000x1000x1.jpg",
  "index_character": "l",
  "is_meme_verified": false,
  "is_verified": false,
  "name": "Luke Davis",
  "slug": "Luke-davis",
  "url": "https://genius.com/artists/Luke-davis",
  "iq": 157
 },
 "artist": "Luke Davis",
 "lyrics": "The black men may have dominated the instrumental and compositional aspects of jazz but there were plenty of women involved within the vocals, such as Ella Fitzgerald, Bessie Smith and Billie Holliday, all former gospel singers who took their use of melisma and blues tones into the sounds and syncopations of jazz\n\nThe 1920s became known as the Jazz Age, where the soloists became more prominent. During this time, Louis Armstrong led his band The Hot Five, originally consisting of his wife, Lil Hardin Armstrong, on piano, Kid Ory on trombone, Johnny Dodds on clarinet and Johnny St. Cyr on guitar and banjo. The key to their success and Armstrong’s status within jazz was his ability to improvise as well as implementing the use of “scatting”. A jazz diaspora from New Orleans to Harlem took place in the late 1910s and by the 1920s, it sparked was to be known as the Harlem Renaissance. The name denoted the rebirth of black consciousness that took place for nearly one and a half decades in the area. Initially, ragtime was the music of choices but due to their poor quality, of little likening to Joplin et al (Gioia, 1997), but eventually a technique known as the Harlem Stride Piano crept into the repertoire of jazz musicians. The concept behind the stride piano involved the left hand playing out four beats, switching between a single note or interval on the first and third beats, and a chord on the second and fourth beats (Carmichael, 2001, p.4). This way of playing took a great deal skill and helped to develop the genre whilst giving Harlem its own distinctive style. Soon, the emergence of big bands and “swing” music of the 30s took hold, thanks to the likes of Duke Ellington. However, big band became synonymous with white musicians towards the late 30s, into wartime America, as it became the music most associated with World War II in the US (Glenn Miller being the most famous, both for his big band exploits and his disappearance in action)\n\nEuropean music had always played some part in the development of jazz, but never as fundamental as in post-war jazz. Bebop was introduced in the 40s, pioneered by saxophonist Charlie “Bird” Parker, Thelonius Monk and Dizzy Gillespie amongst others, which soon developed into hard bop and eventually free jazz or “avant garde”EmbedShare URLCopyEmbedCopy"
}