{
 "_type": "song",
 "annotation_count": 1,
 "api_path": "/songs/156354",
 "full_title": "Arms and the Man (Act 1) by George Bernard Shaw",
 "header_image_thumbnail_url": "https://images.genius.com/ce2bb97dea0c543a7b917af8200d5bfe.300x400x1.jpg",
 "header_image_url": "https://images.genius.com/ce2bb97dea0c543a7b917af8200d5bfe.300x400x1.jpg",
 "id": 156354,
 "instrumental": false,
 "lyrics_owner_id": 225672,
 "lyrics_state": "complete",
 "lyrics_updated_at": null,
 "path": "/George-bernard-shaw-arms-and-the-man-act-1-annotated",
 "pyongs_count": null,
 "song_art_image_thumbnail_url": "https://images.genius.com/ce2bb97dea0c543a7b917af8200d5bfe.300x400x1.jpg",
 "song_art_image_url": "https://images.genius.com/ce2bb97dea0c543a7b917af8200d5bfe.300x400x1.jpg",
 "stats": {
  "unreviewed_annotations": 0,
  "hot": false
 },
 "title": "Arms and the Man (Act 1)",
 "title_with_featured": "Arms and the Man (Act 1)",
 "updated_by_human_at": 1369771078,
 "url": "https://genius.com/George-bernard-shaw-arms-and-the-man-act-1-annotated",
 "song_art_primary_color": "#d8212c",
 "song_art_secondary_color": "#04747f",
 "song_art_text_color": "#fff",
 "primary_artist": {
  "_type": "artist",
  "api_path": "/artists/32349",
  "header_image_url": "https://images.genius.com/6b21f899171626d81e9110a51965b052.1000x1000x1.png",
  "id": 32349,
  "image_url": "https://images.genius.com/8a0c75280e0c206138ba53f1906a95de.626x626x1.jpg",
  "index_character": "g",
  "is_meme_verified": false,
  "is_verified": false,
  "name": "George Bernard Shaw",
  "slug": "George-bernard-shaw",
  "url": "https://genius.com/artists/George-bernard-shaw"
 },
 "artist": "George Bernard Shaw",
 "lyrics": "Night. A lady's bedchamber in Bulgaria, in a small town near the Dragoman Pass. It is late in November in the year 1885, and through an open window with a little balcony on the left can be seen a peak of the Balkans, wonderfully white and beautiful in the starlit snow. The interior of the room is not like anything to be seen in the east of Europe. It is half rich Bulgarian, half cheap Viennese. The counterpane and hangings of the bed, the window curtains, the little carpet, and all the ornamental textile fabrics in the room are oriental and gorgeous: the paper on the walls is occidental and paltry. Above the head of the bed, which stands against a little wall cutting off the right hand corner of the room diagonally, is a painted wooden shrine, blue and gold, with an ivory image of Christ, and a light hanging before it in a pierced metal ball suspended by three chains. On the left, further forward, is an ottoman. The washstand, against the wall on the left, consists of an enamelled iron basin with a pail beneath it in a painted metal frame, and a single towel on the rail at the side. A chair near it is Austrian bent wood, with cane seat. The dressing table, between the bed and the window, is an ordinary pine table, covered with a cloth of many colors, but with an expensive toilet mirror on it. The door is on the right; and there is a chest of drawers between the door and the bed. This chest of drawers is also covered by a variegated native cloth, and on it there is a pile of paper backed novels, a box of chocolate creams, and a miniature easel, on which is a large photograph of an extremely handsome officer, whose lofty bearing and magnetic glance can be felt even from the portrait. The room is lighted by a candle on the chest of drawers, and another on the dressing table, with a box of matches beside it.\n\nThe window is hinged doorwise and stands wide open, folding back to the left. Outside a pair of wooden shutters, opening outwards, also stand open. On the balcony, a young lady, intensely conscious of the romantic beauty of the night, and of the fact that her own youth and beauty is a part of it, is on the balcony, gazing at the snowy Balkans. She is covered by a long mantle of furs, worth, on a moderate estimate, about three times the furniture of her room.\n\nHer reverie is interrupted by her mother, Catherine Petkoff, a woman over forty, imperiously energetic, with magnificent black hair and eyes, who might be a very splendid specimen of the wife of a mountain farmer, but is determined to be a Viennese lady, and to that end wears a fashionable tea gown on all occasions.\n\nCATHERINE\n(entering hastily, full of good news). Raina—(she pronounces it Rah-eena, with the stress on the ee) Raina—(she goes to the bed, expecting to find Raina there.) Why, where—(Raina looks into the room.) Heavens! child, are you out in the night air instead of in your bed? You'll catch your death. Louka told me you were asleep.\n\nRAINA\n(coming in). I sent her away. I wanted to be alone. The stars are so beautiful! What is the matter?\n\nCATHERINE\nSuch news. There has been a battle!\n\nRAINA\n(her eyes dilating). Ah! (She throws the cloak on the ottoman, and comes eagerly to Catherine in her nightgown, a pretty garment, but evidently the only one she has on.)\n\nCATHERINE\nA great battle at Slivnitza! A victory! And it was won by Sergius.\n\nRAINA\n(with a cry of delight). Ah! (Rapturously.) Oh, mother! (Then, with sudden anxiety) Is father safe?\n\nCATHERINE\nOf course: he sent me the news. Sergius is the hero of the hour, the idol of the regiment.\nRAINA\nTell me, tell me. How was it! (Ecstatically) Oh, mother, mother, mother! (Raina pulls her mother down on the ottoman; and they kiss one another frantically.)\n\nCATHERINE\n(with surging enthusiasm). You can't guess how splendid it is. A cavalry charge—think of that! He defied our Russian commanders—acted without orders—led a charge on his own responsibility—headed it himself—was the first man to sweep through their guns. Can't you see it, Raina; our gallant splendid Bulgarians with their swords and eyes flashing, thundering down like an avalanche and scattering the wretched Servian dandies like chaff. And you—you kept Sergius waiting a year before you would be betrothed to him. Oh, if you have a drop of Bulgarian blood in your veins, you will worship him when he comes back.\n\nRAINA\nWhat will he care for my poor little worship after the acclamations of a whole army of heroes? But no matter: I am so happy—so proud! (She rises and walks about excitedly.) It proves that all our ideas were real after all.\n\nCATHERINE\n(indignantly). Our ideas real! What do you mean?\n\nRAINA\nOur ideas of what Sergius would do—our patriotism—our heroic ideals. Oh, what faithless little creatures girls are!—I sometimes used to doubt whether they were anything but dreams. When I buckled on Sergius's sword he looked so noble: it was treason to think of disillusion or humiliation or failure. And yet—and yet—(Quickly.) Promise me you'll never tell him.\n\nCATHERINE\nDon't ask me for promises until I know what I am promising.\n\nRAINA\nWell, it came into my head just as he was holding me in his arms and looking into my eyes, that perhaps we only had our heroic ideas because we are so fond of reading Byron and Pushkin, and because we were so delighted with the opera that season at Bucharest. Real life is so seldom like that—indeed never, as far as I knew it then. (Remorsefully.) Only think, mother, I doubted him: I wondered whether all his heroic qualities and his soldiership might not prove mere imagination when he went into a real battle. I had an uneasy fear that he might cut a poor figure there beside all those clever Russian officers.\n\nCATHERINE\nA poor figure! Shame on you! The Servians have Austrian officers who are just as clever as our Russians; but we have beaten them in every battle for all that.\n\nRAINA\n(laughing and sitting down again). Yes, I was only a prosaic little coward. Oh, to think that it was all true—that Sergius is just as splendid and noble as he looks—that the world is really a glorious world for women who can see its glory and men who can act its romance! What happiness! what unspeakable fulfilment! Ah! (She throws herself on her knees beside her mother and flings her arms passionately round her. They are interrupted by the entry of Louka, a handsome, proud girl in a pretty Bulgarian peasant's dress with double apron, so defiant that her servility to Raina is almost insolent. She is afraid of Catherine, but even with her goes as far as she dares. She is just now excited like the others; but she has no sympathy for Raina's raptures and looks contemptuously at the ecstasies of the two before she addresses them.)\nLOUKA\nIf you please, madam, all the windows are to be closed and the shutters made fast. They say there may be shooting in the streets. (Raina and Catherine rise together, alarmed.) The Servians are being chased right back through the pass; and they say they may run into the town. Our cavalry will be after them; and our people will be ready for them you may be sure, now that they are running away. (She goes out on the balcony and pulls the outside shutters to; then steps back into the room.)\n\nRAINA\nI wish our people were not so cruel. What glory is there in killing wretched fugitives?\n\nCATHERINE\n(business-like, her housekeeping instincts aroused). I must see that everything is made safe downstairs.\n\nRAINA\n(to Louka). Leave the shutters so that I can just close them if I hear any noise.\n\nCATHERINE\n(authoritatively, turning on her way to the door). Oh, no, dear, you must keep them fastened. You would be sure to drop off to sleep and leave them open. Make them fast, Louka.\n\nLOUKA\nYes, madam. (She fastens them.)\n\nRAINA\nDon't be anxious about me. The moment I hear a shot, I shall blow out the candles and roll myself up in bed with my ears well covered.\n\nCATHERINE\nQuite the wisest thing you can do, my love. Good-night.\n\nRAINA\nGood-night. (They kiss one another, and Raina's emotion comes back for a moment.) Wish me joy of the happiest night of my life—if only there are no fugitives.\nCATHERINE\nGo to bed, dear; and don't think of them. (She goes out.)\n\nLOUKA\n(secretly, to Raina). If you would like the shutters open, just give them a push like this. (She pushes them: they open: she pulls them to again.) One of them ought to be bolted at the bottom; but the bolt's gone.\n\nRAINA\n(with dignity, reproving her). Thanks, Louka; but we must do what we are told. (Louka makes a grimace.) Good-night.\n\nLOUKA\n(carelessly). Good-night. (She goes out, swaggering.)\n(Raina, left alone, goes to the chest of drawers, and adores the portrait there with feelings that are beyond all expression. She does not kiss it or press it to her breast, or shew it any mark of bodily affection; but she takes it in her hands and elevates it like a priestess.)\n\nRAINA\n(looking up at the picture with worship.) Oh, I shall never be unworthy of you any more, my hero—never, never, never. (She replaces it reverently, and selects a novel from the little pile of books. She turns over the leaves dreamily; finds her page; turns the book inside out at it; and then, with a happy sigh, gets into bed and prepares to read herself to sleep. But before abandoning herself to fiction, she raises her eyes once more, thinking of the blessed reality and murmurs) My hero! my hero!\n(A distant shot breaks the quiet of the night outside. She starts, listening; and two more shots, much nearer, follow, startling her so that she scrambles out of bed, and hastily blows out the candle on the chest of drawers. Then, putting her fingers in her ears, she runs to the dressing-table and blows out the light there, and hurries back to bed. The room is now in darkness: nothing is visible but the glimmer of the light in the pierced ball before the image, and the starlight seen through the slits at the top of the shutters. The firing breaks out again: there is a startling fusillade quite close at hand. Whilst it is still echoing, the shutters disappear, pulled open from without, and for an instant the rectangle of snowy starlight flashes out with the figure of a man in black upon it. The shutters close immediately and the room is dark again. But the silence is now broken by the sound of panting. Then there is a scrape; and the flame of a match is seen in the middle of the room.)\n\nRAINA\n(crouching on the bed). Who's there? (The match is out instantly.) Who's there? Who is that?\n\nA MAN'S VOICE\n(in the darkness, subduedly, but threateningly). Sh—sh! Don't call out or you'll be shot. Be good; and no harm will happen to you. (She is heard leaving her bed, and making for the door.) Take care, there's no use in trying to run away. Remember, if you raise your voice my pistol will go off. (Commandingly.) Strike a light and let me see you. Do you hear? (Another moment of silence and darkness. Then she is heard retreating to the dressing-table. She lights a candle, and the mystery is at an end. A man of about 35, in a deplorable plight, bespattered with mud and blood and snow, his belt and the strap of his revolver case keeping together the torn ruins of the blue coat of a Servian artillery officer. As far as the candlelight and his unwashed, unkempt condition make it possible to judge, he is a man of middling stature and undistinguished appearance, with strong neck and shoulders, a roundish, obstinate looking head covered with short crisp bronze curls, clear quick blue eyes and good brows and mouth, a hopelessly prosaic nose like that of a strong-minded baby, trim soldierlike carriage and energetic manner, and with all his wits about him in spite of his desperate predicament—even with a sense of humor of it, without, however, the least intention of trifling with it or throwing away a chance. He reckons up what he can guess about Raina—her age, her social position, her character, the extent to which she is frightened—at a glance, and continues, more politely but still most determinedly) Excuse my disturbing you; but you recognise my uniform—Servian. If I'm caught I shall be killed. (Determinedly.) Do you understand that?\n\nRAINA\nYes.\n\nMAN\nWell, I don't intend to get killed if I can help it. (Still more determinedly.) Do you understand that? (He locks the door with a snap.)\n\nRAINA\n(disdainfully). I suppose not. (She draws herself up superbly, and looks him straight in the face, saying with emphasis) Some soldiers, I know, are afraid of death.\n\nMAN\n(with grim goodhumor). All of them, dear lady, all of them, believe me. It is our duty to live as long as we can, and kill as many of the enemy as we can. Now if you raise an alarm—\n\nRAINA\n(cutting him short). You will shoot me. How do you know that I am afraid to die?\n\nMAN\n(cunningly). Ah; but suppose I don't shoot you, what will happen then? Why, a lot of your cavalry—the greatest blackguards in your army—will burst into this pretty room of yours and slaughter me here like a pig; for I'll fight like a demon: they shan't get me into the street to amuse themselves with: I know what they are. Are you prepared to receive that sort of company in your present undress? (Raina, suddenly conscious of her nightgown, instinctively shrinks and gathers it more closely about her. He watches her, and adds, pitilessly) It's rather scanty, eh? (She turns to the ottoman. He raises his pistol instantly, and cries) Stop! (She stops.) Where are you going?\n\nRAINA\n(with dignified patience). Only to get my cloak.\nMAN (darting to the ottoman and snatching the cloak). A good idea. No: I'll keep the cloak: and you will take care that nobody comes in and sees you without it. This is a better weapon than the pistol. (He throws the pistol down on the ottoman.)\nRAINA (revolted). It is not the weapon of a gentleman!\n\nMAN\nIt's good enough for a man with only you to stand between him and death. (As they look at one another for a moment, Raina hardly able to believe that even a Servian officer can be so cynically and selfishly unchivalrous, they are startled by a sharp fusillade in the street. The chill of imminent death hushes the man's voice as he adds) Do you hear? If you are going to bring those scoundrels in on me you shall receive them as you are. (Raina meets his eye with unflinching scorn. Suddenly he starts, listening. There is a step outside. Someone tries the door, and then knocks hurriedly and urgently at it. Raina looks at the man, breathless. He throws up his head with the gesture of a man who sees that it is all over with him, and, dropping the manner which he has been assuming to intimidate her, flings the cloak to her, exclaiming, sincerely and kindly) No use: I'm done for. Quick! wrap yourself up: they're coming!\n\nRAINA\n(catching the cloak eagerly). Oh, thank you. (She wraps herself up with great relief. He draws his sabre and turns to the door, waiting.)\n\nLOUKA\n(outside, knocking). My lady, my lady! Get up, quick, and open the door.\n\nRAINA\n(anxiously). What will you do?\n\nMAN\n(grimly). Never mind. Keep out of the way. It will not last long.\n\nRAINA\n(impulsively). I'll help you. Hide yourself, oh, hide yourself, quick, behind the curtain. (She seizes him by a torn strip of his sleeve, and pulls him towards the window.)\n\nMAN\n(yielding to her). There is just half a chance, if you keep your head. Remember: nine soldiers out of ten are born fools. (He hides behind the curtain, looking out for a moment to say, finally) If they find me, I promise you a fight—a devil of a fight! (He disappears. Raina takes of the cloak and throws it across the foot of the bed. Then with a sleepy, disturbed air, she opens the door. Louka enters excitedly.)\n\nLOUKA\nA man has been seen climbing up the water-pipe to your balcony—a Servian. The soldiers want to search for him; and they are so wild and drunk and furious. My lady says you are to dress at once.\n\nRAINA\n(as if annoyed at being disturbed). They shall not search here. Why have they been let in?\n\nCATHERINE\n(coming in hastily). Raina, darling, are you safe? Have you seen anyone or heard anything?\n\nRAINA\nI heard the shooting. Surely the soldiers will not dare come in here?\n\nCATHERINE\nI have found a Russian officer, thank Heaven: he knows Sergius. (Speaking through the door to someone outside.) Sir, will you come in now! My daughter is ready.\n\n(A young Russian officer, in Bulgarian uniform, enters, sword in hand.)\n\nTHE OFFICER\n(with soft, feline politeness and stiff military carriage). Good evening, gracious lady; I am sorry to intrude, but there is a fugitive hiding on the balcony. Will you and the gracious lady your mother please to withdraw whilst we search?\n\nRAINA\n(petulantly). Nonsense, sir, you can see that there is no one on the balcony. (She throws the shutters wide open and stands with her back to the curtain where the man is hidden, pointing to the moonlit balcony. A couple of shots are fired right under the window, and a bullet shatters the glass opposite Raina, who winks and gasps, but stands her ground, whilst Catherine screams, and the officer rushes to the balcony.)\n\nTHE OFFICER\n(on the balcony, shouting savagely down to the street). Cease firing there, you fools: do you hear? Cease firing, damn you. (He glares down for a moment; then turns to Raina, trying to resume his polite manner.) Could anyone have got in without your knowledge? Were you asleep?\n\nRAINA\nNo, I have not been to bed.\n\nTHE OFFICER\n(impatiently, coming back into the room). Your neighbours have their heads so full of runaway Servians that they see them everywhere. (Politely.) Gracious lady, a thousand pardons. Good-night. (Military bow, which Raina returns coldly. Another to Catherine, who follows him out. Raina closes the shutters. She turns and sees Louka, who has been watching the scene curiously.)\n\nRAINA\nDon't leave my mother, Louka, whilst the soldiers are here. (Louka glances at Raina, at the ottoman, at the curtain; then purses her lips secretively, laughs to herself, and goes out. Raina follows her to the door, shuts it behind her with a slam, and locks it violently. The man immediately steps out from behind the curtain, sheathing his sabre, and dismissing the danger from his mind in a businesslike way.)\n\nMAN\nA narrow shave; but a miss is as good as a mile. Dear young lady, your servant until death. I wish for your sake I had joined the Bulgarian army instead of the Servian. I am not a native Servian.\n\nRAINA\n(haughtily). No, you are one of the Austrians who set the Servians on to rob us of our national liberty, and who officer their army for them. We hate them!\n\nMAN\nAustrian! not I. Don't hate me, dear young lady. I am only a Swiss, fighting merely as a professional soldier. I joined Servia because it was nearest to me. Be generous: you've beaten us hollow.\n\nRAINA\nHave I not been generous?\n\nMAN\nNoble!—heroic! But I'm not saved yet. This particular rush will soon pass through; but the pursuit will go on all night by fits and starts. I must take my chance to get off during a quiet interval. You don't mind my waiting just a minute or two, do you?\n\nRAINA\nOh, no: I am sorry you will have to go into danger again. (Motioning towards ottoman.) Won't you sit—(She breaks off with an irrepressible cry of alarm as she catches sight of the pistol. The man, all nerves, shies like a frightened horse.)\n\nMAN\n(irritably). Don't frighten me like that. What is it?\n\nRAINA\nYour pistol! It was staring that officer in the face all the time. What an escape!\n\nMAN (vexed at being unnecessarily terrified). Oh, is that all?\n\nRAINA (staring at him rather superciliously, conceiving a poorer and poorer opinion of him, and feeling proportionately more and more at her ease with him). I am sorry I frightened you. (She takes up the pistol and hands it to him.) Pray take it to protect yourself against me.\n\nMAN\n(grinning wearily at the sarcasm as he takes the pistol). No use, dear young lady: there's nothing in it. It's not loaded. (He makes a grimace at it, and drops it disparagingly into his revolver case.)\nRAINA. Load it by all means.\n\nMAN\nI've no ammunition. What use are cartridges in battle? I always carry chocolate instead; and I finished the last cake of that yesterday.\n\nRAINA\n(outraged in her most cherished ideals of manhood). Chocolate! Do you stuff your pockets with sweets—like a schoolboy—even in the field?\n\nMAN\nYes. Isn't it contemptible?\n\n(Raina stares at him, unable to utter her feelings. Then she sails away scornfully to the chest of drawers, and returns with the box of confectionery in her hand.)\n\nRAINA\nAllow me. I am sorry I have eaten them all except these. (She offers him the box.)\n\nMAN\n(ravenously). You're an angel! (He gobbles the comfits.) Creams! Delicious! (He looks anxiously to see whether there are any more. There are none. He accepts the inevitable with pathetic goodhumor, and says, with grateful emotion) Bless you, dear lady. You can always tell an old soldier by the inside of his holsters and cartridge boxes. The young ones carry pistols and cartridges; the old ones, grub. Thank you. (He hands back the box. She snatches it contemptuously from him and throws it away. This impatient action is so sudden that he shies again.) Ugh! Don't do things so suddenly, gracious lady. Don't revenge yourself because I frightened you just now.\n\nRAINA\n(superbly). Frighten me! Do you know, sir, that though I am only a woman, I think I am at heart as brave as you.\n\nMAN\nI should think so. You haven't been under fire for three days as I have. I can stand two days without shewing it much; but no man can stand three days: I'm as nervous as a mouse. (He sits down on the ottoman, and takes his head in his hands.) Would you like to see me cry?\n\nRAINA\n(quickly). No.\n\nMAN\nIf you would, all you have to do is to scold me just as if I were a little boy and you my nurse. If I were in camp now they'd play all sorts of tricks on me.\n\nRAINA\n(a little moved). I'm sorry. I won't scold you. (Touched by the sympathy in her tone, he raises his head and looks gratefully at her: she immediately draws hack and says stiffly) You must excuse me: our soldiers are not like that. (She moves away from the ottoman.)\n\nMAN\nOh, yes, they are. There are only two sorts of soldiers: old ones and young ones. I've served fourteen years: half of your fellows never smelt powder before. Why, how is it that you've just beaten us? Sheer ignorance of the art of war, nothing else. (Indignantly.) I never saw anything so unprofessional.\n\nRAINA\n(ironically). Oh, was it unprofessional to beat you?\n\nMAN\nWell, come, is it professional to throw a regiment of cavalry on a battery of machine guns, with the dead certainty that if the guns go off not a horse or man will ever get within fifty yards of the fire? I couldn't believe my eyes when I saw it.\n\nRAINA\n(eagerly turning to him, as all her enthusiasm and her dream of glory rush back on her). Did you see the great cavalry charge? Oh, tell me about it. Describe it to me.\n\nMAN\nYou never saw a cavalry charge, did you?\n\nRAINA\nHow could I?\n\nMAN\nAh, perhaps not—of course. Well, it's a funny sight. It's like slinging a handful of peas against a window pane: first one comes; then two or three close behind him; and then all the rest in a lump.\n\nRAINA\n(her eyes dilating as she raises her clasped hands ecstatically). Yes, first One!—the bravest of the brave!\n\nMAN\n(prosaically). Hm! you should see the poor devil pulling at his horse.\n\nRAINA\nWhy should he pull at his horse?\n\nMAN\n(impatient of so stupid a question). It's running away with him, of course: do you suppose the fellow wants to get there before the others and be killed? Then they all come. You can tell the young ones by their wildness and their slashing. The old ones come bunched up under the number one guard: they know that they are mere projectiles, and that it's no use trying to fight. The wounds are mostly broken knees, from the horses cannoning together.\n\nRAINA\nUgh! But I don't believe the first man is a coward. I believe he is a hero!\n\nMAN\n(goodhumoredly). That's what you'd have said if you'd seen the first man in the charge to-day.\n\nRAINA\n(breathless). Ah, I knew it! Tell me—tell me about him.\n\nMAN\nHe did it like an operatic tenor—a regular handsome fellow, with flashing eyes and lovely moustache, shouting a war-cry and charging like Don Quixote at the windmills. We nearly burst with laughter at him; but when the sergeant ran up as white as a sheet, and told us they'd sent us the wrong cartridges, and that we couldn't fire a shot for the next ten minutes, we laughed at the other side of our mouths. I never felt so sick in my life, though I've been in one or two very tight places. And I hadn't even a revolver cartridge—nothing but chocolate. We'd no bayonets—nothing. Of course, they just cut us to bits. And there was Don Quixote flourishing like a drum major, thinking he'd done the cleverest thing ever known, whereas he ought to be courtmartialled for it. Of all the fools ever let loose on a field of battle, that man must be the very maddest. He and his regiment simply committed suicide—only the pistol missed fire, that's all.\n\nRAINA\n(deeply wounded, but steadfastly loyal to her ideals). Indeed! Would you know him again if you saw him?\n\nMAN\nShall I ever forget him. (She again goes to the chest of drawers. He watches her with a vague hope that she may have something else for him to eat. She takes the portrait from its stand and brings it to him.)\n\nRAINA\nThat is a photograph of the gentleman—the patriot and hero—to whom I am betrothed.\n\nMAN\n(looking at it). I'm really very sorry. (Looking at her.) Was it fair to lead me on? (He looks at the portrait again.) Yes: that's him: not a doubt of it. (He stifles a laugh.)\n\nRAINA\n(quickly). Why do you laugh?\n\nMAN\n(shamefacedly, but still greatly tickled). I didn't laugh, I assure you. At least I didn't mean to. But when I think of him charging the windmills and thinking he was doing the finest thing—(chokes with suppressed laughter).\n\nRAINA\n(sternly). Give me back the portrait, sir.\n\nMAN\n(with sincere remorse). Of course. Certainly. I'm really very sorry. (She deliberately kisses it, and looks him straight in the face, before returning to the chest of drawers to replace it. He follows her, apologizing.) Perhaps I'm quite wrong, you know: no doubt I am. Most likely he had got wind of the cartridge business somehow, and knew it was a safe job.\n\nRAINA\nThat is to say, he was a pretender and a coward! You did not dare say that before.\n\nMAN\n(with a comic gesture of despair). It's no use, dear lady: I can't make you see it from the professional point of view. (As he turns away to get back to the ottoman, the firing begins again in the distance.)\n\nRAINA\n(sternly, as she sees him listening to the shots). So much the better for you.\n\nMAN\n(turning). How?\n\nRAINA\nYou are my enemy; and you are at my mercy. What would I do if I were a professional soldier?\n\nMAN\nAh, true, dear young lady: you're always right. I know how good you have been to me: to my last hour I shall remember those three chocolate creams. It was unsoldierly; but it was angelic.\n\nRAINA\n(coldly). Thank you. And now I will do a soldierly thing. You cannot stay here after what you have just said about my future husband; but I will go out on the balcony and see whether it is safe for you to climb down into the street. (She turns to the window.)\n\nMAN\n(changing countenance). Down that waterpipe! Stop! Wait! I can't! I daren't! The very thought of it makes me giddy. I came up it fast enough with death behind me. But to face it now in cold blood!—(He sinks on the ottoman.) It's no use: I give up: I'm beaten. Give the alarm. (He drops his head in his hands in the deepest dejection.)\n\nRAINA\n(disarmed by pity). Come, don't be disheartened. (She stoops over him almost maternally: he shakes his head.) Oh, you are a very poor soldier—a chocolate cream soldier. Come, cheer up: it takes less courage to climb down than to face capture—remember that.\n\nMAN\n(dreamily, lulled by her voice). No, capture only means death; and death is sleep—oh, sleep, sleep, sleep, undisturbed sleep! Climbing down the pipe means doing something—exerting myself—thinking! Death ten times over first.\n\nRAINA\n(softly and wonderingly, catching the rhythm of his weariness). Are you so sleepy as that?\nMAN. I've not had two hours' undisturbed sleep since the war began. I'm on the staff: you don't know what that means. I haven't closed my eyes for thirty-six hours.\n\nRAINA\n(desperately). But what am I to do with you.\n\nMAN\n(staggering up). Of course I must do something. (He shakes himself; pulls himself together; and speaks with rallied vigour and courage.) You see, sleep or no sleep, hunger or no hunger, tired or not tired, you can always do a thing when you know it must be done. Well, that pipe must be got down—(He hits himself on the chest, and adds)—Do you hear that, you chocolate cream soldier? (He turns to the window.)\n\nRAINA\n(anxiously). But if you fall?\n\nMAN\nI shall sleep as if the stones were a feather bed. Good-bye. (He makes boldly for the window, and his hand is on the shutter when there is a terrible burst of firing in the street beneath.)\n\nRAINA\n(rushing to him). Stop! (She catches him by the shoulder, and turns him quite round.) They'll kill you.\n\nMAN\n(coolly, but attentively). Never mind: this sort of thing is all in my day's work. I'm bound to take my chance. (Decisively.) Now do what I tell you. Put out the candles, so that they shan't see the light when I open the shutters. And keep away from the window, whatever you do. If they see me, they're sure to have a shot at me.\n\nRAINA\n(clinging to him). They're sure to see you: it's bright moonlight. I'll save you—oh, how can you be so indifferent? You want me to save you, don't you?\n\nMAN\nI really don't want to be troublesome. (She shakes him in her impatience.) I am not indifferent, dear young lady, I assure you. But how is it to be done?\n\nRAINA\nCome away from the window—please. (She coaxes him back to the middle of the room. He submits humbly. She releases him, and addresses him patronizingly.) Now listen. You must trust to our hospitality. You do not yet know in whose house you are. I am a Petkoff.\n\nMAN\nWhat's that?\n\nRAINA\n(rather indignantly). I mean that I belong to the family of the Petkoffs, the richest and best known in our country.\n\nMAN\nOh, yes, of course. I beg your pardon. The Petkoffs, to be sure. How stupid of me!\n\nRAINA\nYou know you never heard of them until this minute. How can you stoop to pretend?\n\nMAN\nForgive me: I'm too tired to think; and the change of subject was too much for me. Don't scold me.\n\nRAINA\nI forgot. It might make you cry. (He nods, quite seriously. She pouts and then resumes her patronizing tone.) I must tell you that my father holds the highest command of any Bulgarian in our army. He is (proudly) a Major.\n\nMAN\n(pretending to be deeply impressed). A Major! Bless me! Think of that!\n\nRAINA\nYou shewed great ignorance in thinking that it was necessary to climb up to the balcony, because ours is the only private house that has two rows of windows. There is a flight of stairs inside to get up and down by.\n\nMAN\nStairs! How grand! You live in great luxury indeed, dear young lady.\n\nRAINA\nDo you know what a library is?\n\nMAN\nA library? A roomful of books.\n\nRAINA\nYes, we have one, the only one in Bulgaria.\n\nMAN\nActually a real library! I should like to see that.\n\nRAINA\n(affectedly). I tell you these things to shew you that you are not in the house of ignorant country folk who would kill you the moment they saw your Servian uniform, but among civilized people. We go to Bucharest every year for the opera season; and I have spent a whole month in Vienna.\n\nMAN\nI saw that, dear young lady. I saw at once that you knew the world.\n\nRAINA\nHave you ever seen the opera of Ernani?\n\nMAN\nIs that the one with the devil in it in red velvet, and a soldier's chorus?\n\nRAINA\n(contemptuously). No!\n\nMAN\n(stifling a heavy sigh of weariness). Then I don't know it.\n\nRAINA\nI thought you might have remembered the great scene where Ernani, flying from his foes just as you are tonight, takes refuge in the castle of his bitterest enemy, an old Castilian noble. The noble refuses to give him up. His guest is sacred to him.\n\nMAN\n(quickly waking up a little). Have your people got that notion?\n\nRAINA\n(with dignity). My mother and I can understand that notion, as you call it. And if instead of threatening me with your pistol as you did, you had simply thrown yourself as a fugitive on our hospitality, you would have been as safe as in your father's house.\n\nMAN\nQuite sure?\n\nRAINA\n(turning her back on him in disgust.) Oh, it is useless to try and make you understand.\n\nMAN\nDon't be angry: you see how awkward it would be for me if there was any mistake. My father is a very hospitable man: he keeps six hotels; but I couldn't trust him as far as that. What about YOUR father?\n\nRAINA\nHe is away at Slivnitza fighting for his country. I answer for your safety. There is my hand in pledge of it. Will that reassure you? (She offers him her hand.)\n\nMAN\n(looking dubiously at his own hand). Better not touch my hand, dear young lady. I must have a wash first.\n\nRAINA\n(touched). That is very nice of you. I see that you are a gentleman.\n\nMAN\n(puzzled). Eh?\n\nRAINA\nYou must not think I am surprised. Bulgarians of really good standing—people in OUR position—wash their hands nearly every day. But I appreciate your delicacy. You may take my hand. (She offers it again.)\n\nMAN\n(kissing it with his hands behind his back). Thanks, gracious young lady: I feel safe at last. And now would you mind breaking the news to your mother? I had better not stay here secretly longer than is necessary.\n\nRAINA\nIf you will be so good as to keep perfectly still whilst I am away.\n\nMAN\nCertainly. (He sits down on the ottoman.)\n(Raina goes to the bed and wraps herself in the fur cloak. His eyes close. She goes to the door, but on turning for a last look at him, sees that he is dropping of to sleep.)\n\nRAINA\n(at the door). You are not going asleep, are you? (He murmurs inarticulately: she runs to him and shakes him.) Do you hear? Wake up: you are falling asleep.\n\nMAN\nEh? Falling aslee—? Oh, no, not the least in the world: I was only thinking. It's all right: I'm wide awake.\n\nRAINA\n(severely). Will you please stand up while I am away. (He rises reluctantly.) All the time, mind.\n\nMAN\n(standing unsteadily). Certainly—certainly: you may depend on me.\n\n(Raina looks doubtfully at him. He smiles foolishly. She goes reluctantly, turning again at the door, and almost catching him in the act of yawning. She goes out.)\n\nMAN\n(drowsily). Sleep, sleep, sleep, sleep, slee—(The words trail off into a murmur. He wakes again with a shock on the point of falling.) Where am I? That's what I want to know: where am I? Must keep awake. Nothing keeps me awake except danger—remember that—(intently) danger, danger, danger, dan— Where's danger? Must find it. (He starts of vaguely around the room in search of it.) What am I looking for? Sleep—danger—don't know. (He stumbles against the bed.) Ah, yes: now I know. All right now. I'm to go to bed, but not to sleep—be sure not to sleep—because of danger. Not to lie down, either, only sit down. (He sits on the bed. A blissful expression comes into his face.) Ah! (With a happy sigh he sinks back at full length; lifts his boots into the bed with a final effort; and falls fast asleep instantly.)\n(Catherine comes in, followed by Raina.)\n\nRAINA\n(looking at the ottoman). He's gone! I left him here.\n\nCATHERINE\nHere! Then he must have climbed down from the—\n\nRAINA\n(seeing him). Oh! (She points.)\n\nCATHERINE\n(scandalized). Well! (She strides to the left side of the bed, Raina following and standing opposite her on the right.) He's fast asleep. The brute!\n\nRAINA\n(anxiously). Sh!\n\nCATHERINE\n(shaking him). Sir! (Shaking him again, harder.) Sir!! (Vehemently shaking very bard.) Sir!!!\n\nRAINA\n(catching her arm). Don't, mamma: the poor dear is worn out. Let him sleep.\n\nCATHERINE\n(letting him go and turning amazed to Raina). The poor dear! Raina!!! (She looks sternly at her daughter. The man sleeps profoundly.)EmbedShare URLCopyEmbedCopy"
}