{
 "_type": "song",
 "annotation_count": 0,
 "api_path": "/songs/2924212",
 "full_title": "Chapter One: The Vanishing of Will Byers Script by Stranger Things",
 "header_image_thumbnail_url": "https://images.genius.com/69223636a73d5d170e605e3ff0786e5e.300x165x1.png",
 "header_image_url": "https://images.genius.com/69223636a73d5d170e605e3ff0786e5e.728x400x1.png",
 "id": 2924212,
 "instrumental": false,
 "lyrics_owner_id": 1587767,
 "lyrics_state": "complete",
 "lyrics_updated_at": 1600164825,
 "path": "/Stranger-things-chapter-one-the-vanishing-of-will-byers-script-annotated",
 "pyongs_count": null,
 "song_art_image_thumbnail_url": "https://images.genius.com/69223636a73d5d170e605e3ff0786e5e.300x165x1.png",
 "song_art_image_url": "https://images.genius.com/69223636a73d5d170e605e3ff0786e5e.728x400x1.png",
 "stats": {
  "unreviewed_annotations": 0,
  "hot": false,
  "pageviews": 45452
 },
 "title": "Chapter One: The Vanishing of Will Byers Script",
 "title_with_featured": "Chapter One: The Vanishing of Will Byers Script",
 "updated_by_human_at": 1600164825,
 "url": "https://genius.com/Stranger-things-chapter-one-the-vanishing-of-will-byers-script-annotated",
 "song_art_primary_color": "#a31a15",
 "song_art_secondary_color": "#7c0d0d",
 "song_art_text_color": "#fff",
 "primary_artist": {
  "_type": "artist",
  "api_path": "/artists/1041199",
  "header_image_url": "https://images.genius.com/db98f331e2ca9e2fd4e3aeaa3a750840.1000x500x1.jpg",
  "id": 1041199,
  "image_url": "https://images.genius.com/75a6ed56900348e9b22e74501ba51581.260x260x1.png",
  "index_character": "s",
  "is_meme_verified": false,
  "is_verified": false,
  "name": "Stranger Things",
  "slug": "Stranger-things",
  "url": "https://genius.com/artists/Stranger-things"
 },
 "artist": "Stranger Things",
 "lyrics": "Crickets are chirping. We see a shot of the night sky. A caption pops up, “NOVEMBER 6th, 1983/HAWKINS, INDIANA”. The caption fades away. The camera pans down to a government facility. Another caption pops up. “HAWKINS NATIONAL LABORATORY/U.S. DEPARTMENT OF ENERGY’.\nCUT TO: INT. HALLWAY\nSome lights are flickering. The camera pans down to a door. After a few moments, a man in a lab coat bursts through the door, running. Behind him, an alarm is sounding. Cut to him running through hallways. He eventually reaches an elevator and frantically pushes the button. The elevator begins coming down. He looks back down the hallway and then goes back to pushing the button. The elevator dings and opens. He gets in and pushes the button inside of the elevator. He stands for a moment, breathing heavily. A low growling is heard above him. He looks up and the growling grows louder. As the elevator doors close, he screams and is pulled upwards.\nCUT TO: EXT. WHEELER HOUSEHOLD\nA sprinkler is on outside. Cut to a wide shot of the house.\n\nMIKE: Something is coming. Something hungry for blood.\n\nCut to Mike inside the house.\nMIKE: A shadow grows on the wall behind you, swallowing you in darkness.\nIt is almost here.\n\nThe camera shows us Dustin, Lucas, and Will, before switching to a shot showing all four boys around a table. They’re playing Dungeons and Dragons.\n\nWILL: What is it?\n\nDUSTIN: What if it's the Demogorgon? Oh, Jesus, we're so screwed if it's the Demogorgon.\n\nLUCAS: It's not the Demogorgon.\n\nMIKE: An army of troglodytes charge into the chamber!\nMike slams a figurine onto the table.\n\nDUSTIN: Troglodytes?\n\nLUCAS: Told ya.\n\nThey laugh. Mike suddenly looks nervous and looks around.\n\nMIKE: Wait a minute. Did you hear that? That... that sound? Boom... boom... Boom!\n\nHe slams his hands on the table, startling the other boys.\n\nMIKE: That didn't come from the troglodytes, no, that... That came from something else. The Demogorgon!\n\nMike slams another figurine onto the table.\n\nDUSTIN: We're in deep shit.\n\nMIKE: Will, your action!\n\nWILL: I don't know!\n\nLUCAS: Fireball him!\n\nWILL: I'd have to roll a 13 or higher!\nDUSTIN: Too risky. Cast a protection spell.\n\nLUCAS: Don't be a pussy. Fireball him!\n\nDUSTIN: Cast Protection.\n\nMIKE: The Demogorgon is tired of your silly human bickering! It stomps towards you. Boom!\n\nLUCAS: Fireball him, Will!\n\nMIKE: Another stomp, boom!\n\nDUSTIN: Cast Protection.\n\nMIKE: He roars in anger!\n\nWILL: Fireball!\n\nWill throws some dice, but they fall off the table.\n\nWILL: Oh, shit!\n\nLUCAS: Where'd it go? Where is it?\n\nThey all get up from the table to search for the die.\nWILL: I don't know!\n\nDUSTIN: Is it a 13?\n\nWILL: I don't know!\n\nLUCAS: Where is it?\n\nDUSTIN: Oh, my God! Oh, my God! Oh, my God!\n\nKAREN: Mike! Mike!\n\nLUCAS: Can you find it yet?\n\nWILL: No, I can't find it!\n\nKAREN: Mike!\n\nKaren opens the door to the basement. Mike is at the bottom of the stairs.\n\nDUSTIN: Oh, my God! Oh, my God!\n\nMIKE: Mom, we're in the middle of a campaign!\n\nKAREN: You mean the end? Fifteen after.\n\nShe leaves. Mike runs up after her.\n\nLUCAS: Oh, my God! Freaking idiot!\n\nWILL: Why do we have to go?\n\nMIKE: Mom, wait, just 20 more minutes!\n\nMike walks into the kitchen, where his mom is. His dad fiddles with the TV in the background.\n\nKAREN: It's a school night, Michael. I just put Holly to bed. You can finish next weekend.\n\nMIKE: But that'll ruin the flow!\n\nKAREN: Michael I'm serious.\n\nMIKE: Mom, the campaign took two weeks to plan. How was I supposed to know it was gonna take ten hours?\n\nKAREN: You've been playing for ten hours?\n\nMIKE: Dad, don't you think that 20 more -\n\nTED: I think you should listen to your mother. (He hits the TV and groans.) Dang dumb piece of junk.\n\nCut back to the basement.\n\nWILL: Oh, I got it! Does the seven count?\n\nLUCAS: It was a seven? Did Mike see it? (Will shakes his head.) Then it doesn't count.\n\nThe boys get ready to leave. Dustin picks up a pizza box.\n\nDUSTIN: Yo, hey, guys. Does anyone want this?\n\nLUCAS & WIL: No.\n\nDustin goes upstairs to Nancy’s room with the pizza. She’s on the phone with Barbara.\n\nNANCY: Yeah. No, I don't think... Yeah, he's cute. Barb, no, I don't think so. Barb, you're not -\n\nDUSTIN: Hey, Nancy. There's a slice left if you want it. Sausage and pepperoni!\n\nNANCY: Hold on.\n\nShe puts the phone down and walks over to the door. Dustin smiles. She smiles and closes the door in his face. Cut to Dustin joining the other boys outside.\n\nDUSTIN: There's something wrong with your sister.\n\nMIKE: What are you talking about?\n\nDUSTIN: She's got a stick up her butt.\n\nLUCAS: Yeah. It's because she's been dating that douchebag, Steve Harrington.\n\nDUSTIN: Yeah, she's turning into a real jerk.\n\nMIKE: She's always been a real jerk.\n\nDUSTIN: Nuh-uh, she used to be cool.\n\nLucas, Dustin, and Will begin riding away on their bikes.\n\nDUSTIN: Like that time she dressed up as an elf for our Elder tree campaign.\n\nMIKE: Four years ago!\n\nDUSTIN: Just saying.\n\nLUCAS: Later.\n\nWill stays behind for a moment.\n\nWILL: It was a seven.\n\nMIKE: Huh?\n\nWILL: The roll, it was a seven. The Demogorgon, it got me. See you tomorrow.\n\nAs Will catches up with Lucas and Dustin, the garage lights flicker. Mike turns off the lights and heads back inside. Cut to the other boys riding home. Lucas turns into his driveway.\n\nLUCAS: Good night, ladies.\n\nDUSTIN: Kiss your mom 'night for me. (To Will) Race you back to my place? Winner gets a comic.\n\nWILL: Any comic?\n\nDUSTIN: Yeah.\n\nWill speeds ahead of Dustin.\n\nDUSTIN: Hey! Hey! I didn't say \"go\"! Get back here! I'm gonna kill you!\n\nWILL: (As he passes Dustin’s house) I'll take your X-Men 134!\n\nWill continues to speed away. Dustin stops in front of his house, panting.\n\nDUSTIN: Son of a bitch.\n\nCut to Will continuing to ride. The camera pans to some signs on a fence he passes. One reads, “hnL/HAWKINS NATIONAL LABORATORY/U.S. DEPARTMENT OF ENERGY”. A second reads, “RESTRICTED/AREA/NO TRESPASSING/U.S. GOVERNMENT/PROPERTY”. The light on Will’s bike flickers off. It flickers back on just in time for Will to spot a figure in the road. Will gasps and veers off the road, crashing.\nHe looks up at the road to see the figure turning towards him, with unnaturally long arms. He abandons his bike and runs into the forest. Cut to him reaching his house. He quickly runs inside and locks the door behind him. His dog barks. He looks for his family.\n\nWILL: Mom? Jonathan? Mom?\n\nHe looks out a window and sees the figure approaching the house. He tries dialing 911, but all he receives on the other end is static.\n\nWILL: Hello? Hello?\n\nHe sees the figure approach the front door. His dog continues barking, but backs away. The lock unlocks. Will runs to the shed behind the house, leaving the phone off the hook. He retrieves a shotgun from the wall of the shed and frantically begins to load it. He points it at the door, but after a few moments, hears growling from the back of the shed. He turns around and his eyes widen. The growling turns into screeching. The light in the shed gets brighter and brighter, until it suddenly stops, as does the shrieking. The camera cuts to a shot of the entire shed, now empty. The screen fades to black.\nOPENING CREDITS\nCUT TO: INT. HOPPER’S HOUSE\nWe see a child’s drawing of a kid and two adults next to a house. The camera slowly pans over various empty cans and trash to a TV, which is on.\n\nDONNA: And that's it for News Center this morning. Thanks for joining us. Let's hand off now to Liz at the news desk.\n\nLIZ: All right, thank you, Donna. Turning now to local news, we're getting reports of surges and power outages all across the county. Last night, hundreds of homes in East Hawkins were affected, leaving many residents in the dark. The cause of the outage is still unknown. We reached out to Roane County Water and Electric, and a spokesperson says that they are confident power will be restored to all remaining homes within the next several hours.\n\nThe camera continues panning to Hopper, who is asleep on his couch. Somewhere, a dog barks, waking Hopper. He sighs and looks at his watch. Cut to a shot of the lake, which then pans over to Hopper smoking on his porch. Back inside, he takes a shower, brushes his teeth, smokes some more, takes some pills, drinks some beer, and smokes even more. Cut to him putting on his police uniform, including his holster, his badge, and his hat. As he leaves, the camera pans back to the TV.\n\nLIZ: In other news, you might wanna stay home tonight or at least pack an umbrella. We turn to everybody's favorite morning weather guy, Charles.\n\nCUT TO: EXT. BYER’S HOUSEHOLD\n\nJOYCE: Where the hell are they?\n\nCut to inside the house. Jonathan is making breakfast.\n\nJOYCE: Jonathan?\n\nJONATHAN: Check the couch!\n\nCut to Joyce searching the couch.\n\nJOYCE: Ugh, I did. (She finds them) Oh, got them.\n\nShe enters the kitchen.\n\nJOYCE: Okay, sweetie, I will see you tonight.\n\nJONATHAN: Yeah, see you later.\n\nJOYCE: Where's Will?\n\nJONATHAN: Oh, I didn't get him up yet. He's probably still sleeping.\n\nJOYCE: Jonathan, you have to make sure he's up!\n\nJONATHAN: Mom, I'm making breakfast.\n\nJoyce goes to wake up Will.\n\nJOYCE: I told you this a thousand times. Will! Come on, honey. It's time to get up. (She finds that Will isn't in his room) He came home last night, right?\n\nJONATHAN: He's not in his room?\n\nJOYCE: Did he come home or not?\n\nJONATHAN: I don't know.\n\nJOYCE: You don't know?\n\nJONATHAN: No. I got home late. I was working.\n\nJOYCE: You were working?\n\nJONATHAN: Eric asked if I could cover. I said yeah. I just thought we could use the extra cash.\n\nJOYCE: Jonathan, we've talked about this.\n\nJONATHAN: I know...\n\nJOYCE: You can't take shifts when I'm working.\n\nJONATHAN: Mom, it's not a big deal. Look, he was at the Wheelers' all day. I'm sure he just stayed over.\n\nJOYCE: I can't believe you. I can't believe you sometimes.\n\nJoyce picks up the phone and calls the Wheelers. Cut to the Wheelers eating breakfast, with the phone ringing in the background. Nancy watches Mike pour syrup on his food.\n\nNANCY: That's disgusting.\n\nMIKE: You're disgusting.\n\nKaren picks up the phone.\n\nKAREN: Hello?\n\nJOYCE: Hi, Karen. It's Joyce.\n\nKAREN: Oh, Joyce, hi.\n\nMike squirts syrup on Nancy's plate.\n\nNANCY: What the hell, Mike?\n\nTED: Hey!\n\nKAREN: Quiet!\n\nTED: Language.\n\nNANCY: Are you kidding?\n\nJOYCE: Was that Will I heard back there?\n\nKAREN: Will? No, no, no, it's just Mike.\n\nJOYCE: Will didn't spend the night?\n\nKAREN: No, he left here a little bit after 8:00. Why? He's not home?\n\nJOYCE: Um, you know what? I think he just left early for... for school. Thank you so much.\n\nKAREN: Okay.\n\nJOYCE: Bye.\n\nKAREN: Bye.\n\nJoyce and Jonathan exchange glances.\nCUT TO: EXT. HAWKINS MIDDLE SCHOOL\nMike, Lucas, and Dustin bike to school. They lock their bikes up.\n\nMIKE: That's weird. I don't see him.\n\nLUCAS: I'm telling you, his mom's right. He probably just went to class early again.\n\nDUSTIN: Yeah, he's always paranoid Gursky's gonna give him another pop quiz.\n\nTwo school bullies, Troy and James, approach them.\n\nTROY: Step right up, ladies and gentlemen. Step right up and get your tickets for the freak show. Who do you think would make more money in a freak show? Midnight, Frogface, or Toothless?\n\nAs he says this, he pushes the boys one by one. James looks pensive for a moment.\n\nJAMES: I'd go with Toothless.\n\nDUSTIN: I told you a million times, my teeth are coming in. It's called cleidocranial dysplasia.\n\nJAMES: (In a mocking voice) \"I told you a million times.\"\n\nTROY: Do the arm thing.\n\nJAMES: Do it, freak!\n\nDustin cracks his arms. James and Troy groan and recoil.\n\nTROY: God, it gets me every time.\n\nTroy and James walk away, pushing the boys as they go.\n\nLUCAS: Assholes.\n\nMIKE: I think it's kinda cool. It's like you have superpowers or something. Like Mr. Fantastic.\n\nDUSTIN: Yeah, except I can't fight evil with it.\n\nCUT TO: INT. HALLWAY AT HIGH SCHOOL\n\nBARB: So, did he call?\n\nNANCY: Keep your voice down.\n\nBARB: Did he?\n\nNANCY: I told you, it's not like that. Okay, I mean, yes, he likes me, but not like that. We just made out a couple times.\n\nBARB: \"We just made out a couple times.\" Nance, seriously, you're gonna be so cool now, it's ridiculous.\n\nNANCY: No, I'm not.\n\nBARB: You better still hang out with me, that's all I'm saying. If you become friends with Tommy H. or Carol -\n\nNANCY: Oh, that's gross! Okay, I'm telling you, it was a one-time... Two-time thing.\n\nInside Nancy's locker is a note \"MEET ME IN BATHROOM. STEVE\".\n\nBARB: You were saying?\n\nCUT TO: INT. BATHROOM AT HIGH SCHOOL\n\nNancy and Steve are having a making out session.\n\nNANCY: Steve\n\nSTEVE: Mmm-hmm?\n\nNANCY:  I have to go.\n\nSTEVE: In a minute.\n\nThe school bell rings.\n\nNANCY: Steve. I really, like seriously, I have to go.\n\nSTEVE:Wait, wait, wait. Let's... Come on, let's do something tonight, yeah?\n\nNANCY:Uh No, I can't. I have to study for Kaminsky's test.\n\nSTEVE:Oh, come on. What's your GPA again? 3.999...\n\nNANCY:Kaminsky's tests are impossible.\n\nSTEVE: Well, then, just let me help.\n\nNANCY: You failed chem.\n\nSTEVE: C-minus.\n\nNANCY: Well, in that case...\n\nSTEVE:So I'll be over around, say, like, 8:00?\n\nNANCY: Are you crazy? My mom would not...\n\nSTEVE: I'll climb through your window. She won't even know I'm there. I'm stealthy, like a ninja.\n\nNANCY: You are crazy.\n\nSTEVE: Wait, wait, wait. Just... Okay, forget about that. We can just We can just, like, chill in my car. We can find a nice quiet place to park, and.\n\nNANCY: Steve, I have to study. I'm not kidding.\n\nSTEVE: Well, why do you think I want it to be nice and quiet?\n\nNANCY: You're an idiot, Steve Harrington.\n\nShe's leaving but then turns around...\n\nNANCY: Meet me at Dearborn and Maple at 8:00. To study.\n\nShe leaves as the bell rings, Steve picks up his stuff.\n\nCut to: EXT, POLICE STATION\n\nA van arrives at the police...\n\nCUT TO: INT. POLICE STATION\n\n...and its driver, Chief of Police Jim Hopper , enters the place.\n\nFLO: Good of you to show.\n\nAfter passing by receptionist Flo, he comes near the table where officers Powell and Callahan are playing cards.\n\nJIM:Oh, hey, morning, Flo. Morning, everybody.\n\nPOWELL: Hey, Chief.\n\nCALLAHAN: Damn! You look like hell, Chief.\n\nJIM: Oh, yeah?\n\nCALLAHAN:  Yeah.\n\nJIM:Well, I looked better than your wife when I left her this morning.\n\nFLO: While you were drinking or sleeping, or whatever it is you deemed so necessary on Monday morning, Phil Larson called. Said some kids are stealing the gnomes out of his garden again.\n\nJIM: Oh, those garden gnomes again. Well, I'll tell you what, I'm gonna get right on that.\n\nJim picks up a donut and messes with the cards in Powell's hand.\n\nFLO: On a more pressing matter, Joyce Byers can't find her son this morning.\n\nJIM:Mmm. Okay, I'm gonna get on that. - Just give me a minute.\n\nFLO: Joyce is very upset.\n\nJIM: Well, Flo, Flo, we've discussed this. Mornings are for coffee and contemplation.\n\nFLO:  Chief, she's already in your....\n\nJIM: Coffee and contemplation, Flo!\n\nHe enters the room, and, due to not paying attention, is surprised by Joyce already waiting.\n\nChief is now typing the file on Joyce's charges as she, clearly nervous, smokes for relief.\n\nJOYCE: I have been waiting here over an hour, Hopper.\n\nJIM: And I apologize again.\n\nJOYCE:I'm going out of my mind!\n\nJIM: Look, boy his age, he's probably just playing hookie, okay?\n\nJOYCE:No, not my Will. He's not like that. - He wouldn't do that.\n\nJIM:Well, you never know. I mean, my mom thought I was on the debate team, when really I was just screwing Chrissy Carpenter in the back of my dad's Oldsmobile, so...\n\nJOYCE:Look, he's not like you, Hopper. He's not like me. He's not like most. He has a couple of friends, but, you know, the kids, they're mean. They make fun of him. They call him names. They laugh at him, his clothes...\n\nJIM:His clothes? What's wrong with his clothes?\n\nJOYCE: I don't know.Does that matter?\n\nJIM:Maybe.\n\nJOYCE: Look, he's... He's a sensitive kid. Lonnie... Lonnie used to say he was queer. Called him a fag.\n\nJIM: Is he?\n\nJOYCE:He's missing! Is what he is.\n\nJIM: When was the last time you heard from Lonnie?\n\nJOYCE:Uh, last I heard, he was in Indianapolis. That was about a year ago. But he has nothing to do with this.\n\nJIM:  Why don't you give me his number?\n\nJOYCE: You know, Hopper, he has nothing to do with this. Trust me.\n\nJIM: Joyce, 99 out of 100 times, kid goes missing, the kid is with a parent or relative.\n\nJOYCE:What about the other time?\n\nJIM:  What?\n\nJOYCE: You said, \"99 out of 100.\" What about the other time, the one?\n\nJIM: Joyce.\n\nJOYCE: The one!\n\nJIM: Joyce, this is Hawkins, okay? You wanna know the worst thing that's ever happened here in the four years I've been working here? Do you wanna know the worst thing? It was when an owl attacked Eleanor Gillespie's head because it thought that her hair was a nest.\n\nJOYCE: Okay, fine. I will call Lonnie. He will talk to me before he talks to...\n\nJIM: What, a pig?\n\nJOYCE: A cop! Just find my son, Hop. Find him!\n\nCut to HAWKINS LAB, EXT\n\nCars arrive at the research facility. From them, emerge a team of scientists carrying briefcases, including...\n\nSCIENTIST: Dr. Brenner.\n\n...who shakes this scientist's hand.\nCut to HAWKINS LAB, INT\n\nBRENNER: This way, gentlemen. The entire east wing will be evacuated within the hour. We've sealed off this area following quarantine protocol.\n\nThe team of scientists, including Dr. Brenner, suit up in protective suits, grab guns and flashlights, and go down an elevator, where they proceed to the quarantined underground subsystem. There, they find strange biologic growth spreading - originating from a mysterious fracture in the wall.\n\nSCIENTIST: This is where it came from?\n\nBRENNAN: Yes.\n\nSCIENTIST: And the girl?\n\nBRENNAN:She can't have gone far.\n\nA growl is heard from the growth as we...\nCut to FOREST\n...see two bare feet walking along the dry leaves. As they stop, the camera pans up to a young girl dressed in a hospital gown, with a completely shaven head. Then we cut to her point of view.\n\nCut to BENNY'S BURGERS, EXT\n\nShe's watching Benny Hammond, owner of the local burger joint, leaving through the back door to put garbage in the can outside. As he walks back, the girl is pensive.\n\n\nCut to BENNY'S BURGERS, INT\n\nThe girl enters the back door, passes by the pantry, and gets to see Benny serving a costumer.\n\nBENNY: All right, and one more.\n\nHey, Ben. What do you think about that, uh\nBENNY: Hey, I don't know.\n-I don't know.\nI don't know, 37 points per game average - Thirty-seven now, but\n- Mr. Basket.\n\nThe girl enters the kitchen, eventually appearing by a basket of fries, which she starts to gobble. Benny eventually notices her...\n\nBENNY: Hey! Come here!\n\n...and she grabs the basket and tries running away, before Benny gets her just as she's about to leave through the door she came in.\nBENNY:Hey, come here! You think you can steal from me, boy?\n\nHe then takes a look at the kid he just caught\nBENNY: the girl,What in the hell?\n\nRemember, finish chapter 12 and answer 12.\n3 on the difference between an experiment and other forms of science investigation.\nThis will be on the test, which will cover chapters 10 through 12.\nIt will be multiple choice with an essay section.\n\nSo, did it come? Sorry, boys.\nI hate to be the bearer of bad news, but it came.\n\nYes!\n\nThe Heathkit ham shack.\n\n- Whoa.\n\n- Ain't she a beaut?\n\nI bet you can talk to New York on this thing.\n\nThink bigger.\n\n- California?\n\n- Bigger.\n\nAustralia? Oh, man! When Will sees this, he's totally gonna blow his shit.\n\nLucas!\n\nSorry.\n\nHello, this is Mike Wheeler, president of Hawkins Middle AV Club.\n\nWhat are you doing?\n\nHello, this is Dustin, and this is the secretary and treasurer of Hawkins Middle AV Club. Do you eat kangaroos for breakfast?\n\nSorry to interrupt, but, uh, may I borrow Michael, Lucas and Dustin?\n\nJIM: Okay, okay, okay. One at a time, all right? [points to Mike] You. You said he takes what?\n\nMIKE: Mirkwood.\n\nJIM:  Mirkwood?\n\nMIKE: Yeah.\n\nJIM:  Have you ever heard of Mirkwood?\n\nCALLAHAN: I have not. That sounds made up to me.\n\nLUCAS: No, it's from Lord of the Rings.\n\nDUSTIN: Well, The Hobbit.\n\nLUCAS: Who cares?\n\nDUSTIN:  He asked!\n\nLUCAS: [mocking]\"He asked!\"\n\nMIKE:  Shut up, guys!\n\nJIM:  Hey, hey, hey!  What'd I just say?  Shut up. One at a damn time. [to Mike] You.\n\nMIKE:  Mirkwood, it's a real road. It's just the name that's made up. It's where Cornwallis and Kerley meet.\n\nJIM:  Yeah, all right, I think I know that.\n\nMIKE: We can show you, if you want.\n\nJIM: I said that I know it!\n\nMIKE: We can help look.\n\nDUSTIN: Yeah.\n\nJIM: No.\n[the boys protest]\nJIM: No. After school, you are all to go home. Immediately. That means no biking around looking for your friend, no investigating, no nonsense. This isn't some Lord of the Rings book.\n\nDUSTIN: The Hobbit.\n\nLUCAS: Shut up!\n\n- Hey!\n\nJIM: Stop it! Do I make myself clear? Do I make myself clear?\n\nMIKE: Yes, sir.\n\n- Yeah.\n\nRing-a-ding-ding! Anybody home?\n\nPassword?\n\nUh, Rada Radaga Radagast?\n\nYeah.\nYou may enter.\n\nThank you, sir.\n\nSo, guess what? I got off early and Ta-da! Poltergeist.\n\nI I thought I wasn't allowed to see it.\n\nI changed my mind.\nAs long as you don't have nightmares for a week.\n\nNo, I won't.\nI don't get scared like that anymore.\n\nOh, yeah? Not even of clowns?\n\nNo.\n\nWhat about my witch?\n\n- No.\nMom\n\n- Ooh\n\n- I'm not five anymore.\n\n- But Will Byers\n- I'm going to cook you up in my\n\n- Stop.\nThat's so stupid.\nMom!\n\nWill?\n- Will?\n- Will? Will?\n- Will?\n- Will!\n- Will!\n- Will? Will! Where are you?\n\nGeez.\nYour parents forget to feed you? Is that why you ran away? They, uh They hurt you? You went to the hospital, you got scared, you ran off, you wound up here, is that it? All right.\nI'll give this back, all right? And you can have as much as you want.\nAll right? Maybe even some ice cream.\nBut you gotta answer a few of my questions first, all right? We got a deal? All right, let's start with the easy stuff.\nAll right? My name's Benny.\nBenny Hammond.\nSee? Like this.\nHere.\nI got you.\nDon't worry.\nIt's okay.\nNice to meet you, yeah.\nAnd you are? Eleven? What's that mean? What's it mean? -\n\nNo.\n\n- Well, I'll be damned.\nShe speaks.\n\"No\"? No, what? All right.\nI guess no more food, then.\n\nEleven.\n\nYeah.\nWhat's it mean?\n\nEleven.\n\nAll right, then.\nHere you go.\nTake it easy, take it easy.\nYeah, look, all I know is that she's scared to death.\nYeah, I think maybe she's been abused or kidnapped or something.\nYeah, it'd be great if someone would come by.\nYeah, we're at 4819 Randolph Lane.\nYeah, Randolph.\n\nWill Byers? Will! Will Byers? Come on, kid! Will? Hey! I got something.\n\n- That his bike?\n\n- Yeah, he must have crashed.\n\nYou think he got hurt in the fall?\n\nNot so hurt he couldn't walk away.\n\nBike like this is like a Cadillac to these kids.\nHe would've walked it home.\nget off work if I win.\nOh, Friday I'm supposed to but we will cover whatever the damages are to your property.\n- It's just, um - That's for sure.\nIs Lonnie there? - Lonnie isn't here right now.\n- Can you please - I told you, Lonnie's not here.\n- Who is this? - His girlfriend, Cynthia.\n- Cynthia.\n- Who the hell is this? - Cynthia, this is Joyce.\n- Who? - Lonnie's ex-wife.\n- I really need to speak to him - Lonnie's not here.\n- Can you please put\nNo!\n- Why don't you call back later?\nNo, not later. Now!\nCan\n- Bitch!\n- Mom.\n- What?\n- You have to stay calm.\nHey, you've reached Lonnie.\nLeave a message and I'll holler right back at ya.\nLonnie, some teenager just hung up on me.\nWill is is missing.\nI don't know where he is.\nI need I just need you to call me back, please, just Damn it! Damn it! Mom? What? Cops.\n- It was just lying there? - Yeah.\nCal? - Did it have any blood on it, or - No, no, no, no, no Phil? If you found the bike out there, why are you here? - Well, he had a key to the house, right? - Yeah.\nSo maybe he came home.\nYou think I didn't check my own house? I'm not saying that.\n- Has this always been here? - What? I don't know.\nProbably.\nI mean, I have two boys.\nLook at this place.\nYou're not sure? Hey.\nHey, what's up with this guy, huh? Nothing, he's probably just hungry.\nCome on.\n- Hey!\n- Jesus! What are you, deaf? I've been calling you.\nWhat's going on? Hello?\n- Are you sure you're okay, Chief?\n- Listen, I want you to call Flo.\nI want to get a search party together, all right? All the volunteers she can muster.\nBring flashlights, too.\nHey, you think we got a problem here? We should be out there right now.\nWe should be helping look for him.\nWe've been over this, Mike.\nThe chief says - I don't care what the chief said.\n- Michael! We have to do something.\nWill can be in danger.\nMore reason to stay put.\n- Mom!\n- End of discussion.\nSo me and Barbara are gonna study at her house tonight.\n- That's cool, right?\n- No, not cool.\nWhat? Why not?\nWhy do you think? Am I speaking Chinese in this house? Until we know Will is okay, no one leaves.\n- This is such bullshit.\n- Language.\nSo we're under house arrest? Just because Mike's friend got lost on the way home from\n- Wait, this is Will's fault?\n- Nancy, take that back.\n- No!\n- You're just pissed off 'cause you wanna hang out with Steve.\n- Steve?\n- Who is Steve?\n- Her new boyfriend.\n- You are such a douchebag, Mike!\nLanguage! Nancy, come back.\nCome back! It's okay.\nIt's okay, Holly.\nHere, have some juice, okay? You see, Michael?\n- You see what happens?\n- What happens when what?\nI'm the only one acting normal here! I'm the only one that cares about Will!\nThat is really unfair, son.\nWe care.\n- Mike! - Let him go.\nI hope you're enjoying your chicken, Ted.\nWhat did I do? Hey! What'd I do?\n- Will!\n- Will Byers! Will! Will, we're here for you, bud! He's a good student.\n- What?\n- Will.\nHe's a good student.\nGreat one, actually.\nI don't think we've met.\nScott Clarke.\nTeacher, Hawkins Middle.\nEarth and biology.\nI always had a distaste for science.\nWell, maybe you had a bad teacher.\nYeah, Ms.\nRatliff was a piece of work.\nRatliff? You bet.\nShe's still kicking around, believe it or not.\nOh, I believe it.\nMummies never die, so they tell me.\nSarah, my daughter Galaxies, the universe, whatnot She always understood all that stuff.\nI always figured there was enough going on down here, I never needed to look elsewhere.\nYour daughter, what grade is she? - Maybe I'll get her in my class.\n- No, she, uh She lives with her mom in the city.\nThanks for coming out, Teach.\nWe really appreciate it.\n- She died a few years back.\n- Sorry? His kid.\nLucas, do you copy? It's Mike.\n- Lucas? - Hey, it's Lucas.\nI know it's you.\nAnd say \"over\" when you're done talking so I know when you're done.\nOver.\nI'm done.\nOver.\nI'm worried about Will.\nOver.\nYeah.\nThis is crazy.\nOver.\nI was thinking Will could've cast Protection last night, but he didn't.\nHe cast Fireball.\n- Over.\n- What's your point? Over.\nMy point is he could've played it safe, but he didn't.\nHe put himself in danger to help the party.\nOver.\nMeet me in ten.\nOver and out.\nWhat are you doing here? I told you on the phone, I'm under house arrest now.\n- I figured we'd just study here.\n- No.\nNo way.\nOh, come on.\nI can't have you failing this test.\nSo just bear with me.\nWhat'd I tell you? Ninja.\nYou like that ice cream, huh? Smile looks good on you.\nYou know, smile? All right.\nYou just sit tight.\nWhoever it is, I'll tell 'em to go away real quick, all right? Yeah, yeah, yeah - Hey, can I help you?\n- Hi, you must be Benny Hammond.\nI'm afraid I am.\nI'm afraid we're closed for the evening, too.\n- So try back tomorrow morning.\n- Connie Frazier.\nSocial Services.\nAh, Social Services.\nMy apologies.\nI didn't expect you so soon.\n- That's a heck of a drive.\n- Not too bad this time of night.\nHey, listen, I I haven't told her that you're coming yet.\nI didn't want her running off again.\nShe's a tad skittish.\n- Children I work with usually are.\n- Right, right.\n- So, where is she? - Right.\nShe's in the kitchen.\n- Come on up.\nI'll introduce you.\n- Thank you.\nSorry again for trying to turn you away there.\n- It's fine.\n- You know, it's funny.\nYour, uh, voice sounds different on the Ah, man.\nThis is it.\nHey, guys.\nYou feel that? - I think maybe we should go back.\n- No.\nWe're not going back.\nJust stay close.\nCome on.\nJust stay on channel six.\nDon't do anything stupid.\nHey, guys, wait up.\nWait up! \"Which polymers occur naturally?\" Starch and cellulose.\nMmm.\n\"In a molecule of CH4, the hydrogen atoms are spatially oriented - towards the centers of\" - Tetrahedrons.\nWow.\nJesus, how many of these did you make? You said you wanted to help.\nHow about this? How about How about every time that you get something right, I have to take off an item of clothing.\nBut every time that you get something wrong - Uh, pass.\n- Oh, come on.\n- Come on.\n- No.\n- Come on.\nIt'll be fun.\n- No.\n\"During fractional distillation, hydrocarbons are separated according to their\" Melting point.\nOoh, it's boiling points.\nThat's what I meant.\nYeah, that's not what you said.\n- No.\n- No? Oh, do you need Do you need help, or No.\nSteve.\nSteve, come on.\nWhat? Are you crazy? My parents are here.\nThat's weird, I don't see them.\nWas this your plan all along? To to get in my room and then - get another notch on your belt.\n- No.\nNancy, no.\nI'm not Laurie, or Amy, or Becky.\nYou mean, you're not a slut.\nThat's not what I'm saying.\nYou know, you're so cute when you lie.\nShut up.\nBad Steve.\nBad.\nDon't do that to Miss Nancy.\nNANCY: You're an idiot, Steve Harrington.\nSTEVE: You are beautiful, Nancy Wheeler.\n\"Compared to the rate of inorganic reactions, the rate of organic reactions is generally\" Jonathan, wow.\nYou took these? These are great.\nWow, they really are.\n- I know I haven't been there for you.\n- I've been working so hard and I I just feel bad.\nI don't even barely know what's going on with you.\nAll right? I am sorry about that.\nHey, what is it? What is it, honey? - Nothing.\n- Tell me.\nTell me.\n- Come on.\nYou can - No.\nIt's just I should've been there for him.\nNo.\nOh, no.\nYou can't do that to yourself.\nThis was not your fault.\nDo you hear me? - He is close.\n- I know it.\nI I feel it in my heart.\nYou just have to You have to trust me on this, okay?\n- Yeah.\n- Oh, look at this.\nLook at this one.\nLook at this one.\n- I mean, that's it, right? - Yeah.\nThat's it.\nThat's the one.\nHello? Hello? Lonnie?\n- Dad?\n- Hopper? Who is this? Will?\n- Will?\n- It's Will? Mom, it's Will? Who is this?\n- What have you done to my boy?\n- What? What? Give me back my son! Hello? Hello, who is this? Hello? Who is this? Mom, who was it? Who was it, Mom? - It was him.\n- Look at me, Mom.\nWas it Will? - Yes.\n- What did he say? He just breathed.\nHe just breathed.\n- And was someone else there?\n- I\n- Mom, who was there? Who was it?\n- It was him.I know it was his breathing.\nI know it was his breathing.\nWill!\n- Will!\n- Byers! I've got your X-Men 134!\nDUSTIN: Guys, I really think we should turn back.\nLUCAS: Seriously, Dustin? You wanna be a baby, then go home already!\nDUSTIN: I'm just being realistic, Lucas!\nLUCAS: No, you're just being a big sissy!\nDUSTIN: Did you ever think Will went missing because he ran into something bad? And we're going to the exact same spot where he was last seen? - And we have no weapons or anything?\nMIKE: Dustin, shut up.\nDUSTIN: I'm just saying, does that seem smart to you?\nMIKE: Shut up. Shut up. Did you guys hear that?EmbedShare URLCopyEmbedCopy"
}