{
 "_type": "song",
 "annotation_count": 25,
 "api_path": "/songs/87690",
 "full_title": "Slaughterhouse-Five (Chapter 2) by Kurt Vonnegut",
 "header_image_thumbnail_url": "https://images.genius.com/b13429802dafd0a48650baf2c1f1c0e0.300x300x1.jpg",
 "header_image_url": "https://images.genius.com/b13429802dafd0a48650baf2c1f1c0e0.328x328x1.jpg",
 "id": 87690,
 "instrumental": false,
 "lyrics_owner_id": 133332,
 "lyrics_state": "complete",
 "lyrics_updated_at": 1601425156,
 "path": "/Kurt-vonnegut-slaughterhouse-five-chapter-2-annotated",
 "pyongs_count": 2,
 "song_art_image_thumbnail_url": "https://images.genius.com/b13429802dafd0a48650baf2c1f1c0e0.300x300x1.jpg",
 "song_art_image_url": "https://images.genius.com/b13429802dafd0a48650baf2c1f1c0e0.328x328x1.jpg",
 "stats": {
  "unreviewed_annotations": 4,
  "hot": false,
  "pageviews": 61771
 },
 "title": "Slaughterhouse-Five (Chapter 2)",
 "title_with_featured": "Slaughterhouse-Five (Chapter 2)",
 "updated_by_human_at": 1568654090,
 "url": "https://genius.com/Kurt-vonnegut-slaughterhouse-five-chapter-2-annotated",
 "song_art_primary_color": "#f41444",
 "song_art_secondary_color": "#800c14",
 "song_art_text_color": "#fff",
 "primary_artist": {
  "_type": "artist",
  "api_path": "/artists/24794",
  "header_image_url": "https://images.genius.com/88f5a1ccc5e2b7ce8c1101fa7ef4fdfb.200x300x1.jpg",
  "id": 24794,
  "image_url": "https://images.genius.com/88f5a1ccc5e2b7ce8c1101fa7ef4fdfb.200x300x1.jpg",
  "index_character": "k",
  "is_meme_verified": false,
  "is_verified": false,
  "name": "Kurt Vonnegut",
  "slug": "Kurt-vonnegut",
  "url": "https://genius.com/artists/Kurt-vonnegut"
 },
 "artist": "Kurt Vonnegut",
 "lyrics": "Listen: Billy Pilgrim has come unstuck in time. Billy has gone to sleep a senile widower and awakened on his wedding day. He has walked through a door in 1955 and come out another one in 1941. He has gone back through that door to find himself in 1963. He has seen his birth and death many times, he says, and pays random visits to all the events in between.\n\nHe says.\n\nBilly is spastic in time, has no control over where he is going next, and the trips aren't necessarily fun. He is in a constant state of stage fright, he says, because he never knows what part of his life he is going to have to act in next.\n\nBilly was bon in 1922 in Ilium, New York, the only child of a barber there. He was a funny-looking child who became a funny-looking youth-tall and weak, and shaped like a bottle of Coca-Cola. He graduated from Ilium High School in the upper third of his class, and attended night sessions at the Ilium School of Optometry for one semester before being drafted for military service in the Second World War. His father died in a hunting accident during the war. So it goes.\n\nBilly saw service with the infantry in Europe, and was taken prisoner by the Germans. After his honorable discharge from the Army in 1945, Billy again enrolled in the Ilium School of Optometry. During his senior year there, he became engaged to the daughter of the founder and owner of the school, and then suffered a mild nervous collapse.\n\nHe was treated in a veterans' hospital near Lake Placid, and was given shock treatments and released. He married his fiancée, finished his \n\neducation, and was set up in business in Ilium by his father-in-law. Ilium is a particularly good city for optometrists because the General Forge and Foundry Company is there. Every employee is required to own a pair of safety glasses, and to wear them in areas where manufacturing is going on. GF&F has sixty-eight thousand employees in Ilium. That calls for a lot of lenses and a lot of frames.\n\nFrames are where the money is.\n\nBilly became rich. He had two children, Barbara and Robert. In time, his daughter Barbara married another optometrist., and Billy set him up in business. Billy's son Robert had a lot of trouble in high school, but then he joined the famous Green Berets. He straightened out, became a fine young man, and he fought in Vietnam.\n\nEarly in 1968, a group of optometrists, with Billy among them, chartered an airplane to fly them from Ilium to an international convention of optometrists in Montreal. The plane crashed on top of Sugarbush Mountain, in Vermont. Everybody was killed but Billy. So it goes.\n\nWhile Billy was recuperating in a hospital in Vermont, his wife died accidentally of carbon-monoxide poisoning. So it goes.\n\nWhen Billy finally got home to Ilium after the airplane crash, he was quiet for a while. He had a terrible scar across the top of his skull. He didn't resume practice. He had a housekeeper. His daughter came over almost every day.\nAnd then, without any warning, Billy went to New York City, and got on an all-night radio program devoted to talk. He told about having come unstuck in time. He said, too, that he had been kidnapped by a flying saucer in 1967. The saucer was from the planet Tralfamadore, he said. He was taken to Tralfamadore, where he was displayed naked in a zoo, he said. He was mated there with a former Earthling movie star named Montana Wildhack.\n\nSome night owls in Ilium heard Billy on the radio, and one of them called Billy's daughter Barbara. Barbara was upset. She and her husband went down to New York and brought Billy home. Billy insisted mildly that everything he had said on the radio was true. He said he had been kidnapped by the Tralfamadorians on the night of his daughter's wedding. He hadn't been missed, he said, because the Tralfamadorians had taken him through a time warp, so that he could be on Tralfamadore for years, and still be away from Earth for only a microsecond.\n\nAnother month went by without incident, and then Billy wrote a letter to the Ilium News Leader, which the paper published. It described the creatures from Tralfamadore.\nThe letter said that they were two feet high, and green, and shaped like plumber's friends. Their suction cups were on the ground, and their shafts, which were extremely flexible, usually pointed to the sky. At the top of each shaft was a little hand with a green eye in its palm. The creatures were friendly, and they could see in four dimensions. They\nPitied Earthlings for being able to see only three. They had many wonderful things to teach Earthlings, especially about time. Billy promised to tell what some of those wonderful things were in his next letter.\n\nBilly was working on his second letter when the first letter was published. The second letter started out like this:\n\n'The most important thing I learned on Tralfamadore was that when a person dies he only appears to die. He is still very much alive in the past, so it is very silly for people to cry at his funeral. All moments, past, present and future, always have existed, always will exist. The Tralfamadorians can look at all the different moments just that way we can look at a stretch of the Rocky Mountains, for instance. They can see how permanent all the moments are, and they can look at any moment that interests them. It is just an illusion we have here on Earth that one moment follows another one, like beads on a string, and that once a moment is gone it is gone forever.\n'When a Tralfamadorian sees a corpse, all he thinks is that the dead person is in a bad condition in that particular moment, but that the same person is just fine in plenty of other moments. Now, when I myself hear that somebody is dead, I simply shrug and say what the Tralfamadorians say about dead people, which is \"so it goes.\"'\n\nAnd so on.\n\nBilly was working on this letter in the basement rumpus room of his empty house. It was his housekeeper's day off. There was an old typewriter in the rumpus room. It was a beast. It weighed as much as a storage battery. Billy couldn't carry it very far very easily, which was why he was writing in the rumpus room instead of somewhere else.\n\nThe oil burner had quit. A mouse had eaten through the insulation of a wire leading to the thermostat. The temperature in the house was down to fifty degrees, but Billy hadn't noticed. He wasn't warmly dressed, either. He was barefoot, and still in his pajamas and a bathrobe, though it was late afternoon. His bare feet were blue and ivory. The cockles of Billy's heart, at any rate, were glowing coals. What made them so hot was Billy's belief that he was going to comfort so many people with the truth about time. His door chimes upstairs had been ringing and ringing. It was his daughter Barbara up there wanting in. Now she let herself in with a key, crossed the floor over his head calling, 'Father? Daddy, where are you?' And so on.\n\nBilly didn't answer her, so she was nearly hysterical, expecting to find his corpse. And then she looked into the very last place there was to look-which was the rumpus room.\n\n'Why didn't you answer me when I called?' Barbara wanted to know, standing there in the door of the rumpus room. She had the afternoon paper with her, the one in which Billy described his friends from Tralfamadore.\n\n'I didn't hear you,' said Billy.\nThe orchestration of the moment was this: Barbara was only twenty-one years old, but she thought her father was senile, even though he was only forty-six-senile because of damage to his brain in the airplane crash. She also thought that she was head of the family, since she had had to manage her mother's funeral, since she had to get a housekeeper for Billy, and all that. Also, Barbara and her husband were having to look after Billy's business interests, which were considerable, since Billy didn't seem to give a damn for business any more. All this responsibility at such an early age made her a bitchy flibbertigibbet. And Billy, meanwhile, was trying to hang onto his dignity, to persuade Barbara and everybody else that he was far from senile, that, on the contrary, he was devoting himself to a calling much higher than mere business.\n\nHe was doing nothing less now, he thought, then prescribing corrective lenses for Earthling souls. So many of those souls were lost and wretched, Billy believed, because they could not see as well as his little green friends on Tralfamadore.\n\n'Don't lie to me, Father,' said Barbara. 'I know perfectly well you heard me when I called.' This was a fairly pretty girl, except that she had legs like an Edwardian grand piano. Now she raised hell with him about the letter in the paper. She said he was making a laughing stock of himself and everybody associated with him.\n\n'Father, Father, Father,' said Barbara, 'what are we going to do with you? Are you going to force us to put you where your mother is?' Billy's mother was still alive. She was in bed in an old people's home called Pine Knoll on the edge of Ilium.\n\n'What is it about my letter that makes you so mad?' Billy wanted to know. 'It's all just crazy. None of it's true! ' 'It's all true. ' Billy's anger was not going to rise with hers. He never got mad at anything. He was wonderful that way. 'There is no such planet as Tralfamadore.'\n\n'It can't be detected from Earth, if that's what you mean,' said Billy. 'Earth can't be detected from Tralfamadore, as far as that goes. They're both very small. They're very far apart.'\n\n'Where did you get a crazy name like \"Tralfamadore?\"' 'That's what the creatures who live there call it. 'Oh God,' said Barbara, and she turned her back on him. She celebrated frustration by clapping her hands. 'May I ask you a simple question?' 'Of course.' 'Why is it you never mentioned any of this before the airplane crash?' 'I didn't think the time was ripe.'\n\nAnd so on. Billy says that he first came unstuck in time in 1944, long before his trip to Tralfamadore. The Tralfamadorians didn't have anything to do with his coming unstuck They were simply able to give him insights into what was really going on\nBilly first came unstuck while the Second World War was in progress. Billy was a chaplain's assistant in the war. A chaplain's assistant is customarily a figure of fun in the American Army. Billy was no exception. He was powerless to harm the enemy or to help his friends. In fact, he had no friends. He was a valet to a preacher, expected no promotions or medals, bore no arms, and had a meek faith in a loving Jesus which most soldiers found putrid.\n\nWhile on maneuvers in South Carolina, Billy played hymns he knew from childhood, played them on a little black organ which was waterproof. It had thirty-nine keys and two stops-vox humana and vox celeste. Billy also had charge of a portable altar, an olive-drab attaché case with telescoping legs. It was lined with crimson plush, and nestled in that passionate plush were an anodized aluminum cross and a Bible.\n\nThe altar and the organ were made by a vacuum-cleaner company in Camden, New Jersey-and said so.\n\nOne time on maneuvers Billy was playing 'A Mighty Fortress Is Our God,' with music by Johann Sebastian Bach and words by Martin Luther. It was Sunday morning. Billy and his chaplain had gathered a congregatation of about fifty soldiers on a Carolina hillside. An umpire appeared. There were umpires everywhere, men who said who was winning or losing the theoretical battle, who was alive and who was dead.\n\nThe umpire had comical news. The congregation had been theoretically spotted from the air by a theoretical enemy. They were all theoretically dead now. The theoretical corpses laughed and ate a hearty noontime meal.\n\nRemembering this incident years later, Billy was struck by what a Tralfamadorian adventure with death that had been, to be dead and to eat at the same time.\nToward the end of maneuvers., Billy was given an emergency furlough home because his father, a barber in Ilium, New York, was shot dead by a friend while they were out hunting deer. So it goes.\n\nWhen Billy got back from his furlough., there were orders for him to go overseas. He was needed in the headquarters company of an infantry regiment fighting in Luxembourg. The regimental chaplain's assistant had been killed in action. So it goes.\n\nWhen Billy joined the regiment, it was in the process of being destroyed by the Germans in the famous Battle of the Bulge. Billy never even got to meet the chaplain he was supposed to assist, was never even issued a steel helmet and combat boots. This was in December of 1944, during the last mighty German attack of the war.\n\nBilly survived, but he was a dazed wanderer far behind the new German lines. Three other wanderers, not quite so dazed, allowed Billy to tag along. Two of them were scouts, and one was an antitank gunner. They were without food or maps. Avoiding Germans they were delivering themselves into rural silences ever more profound. They ate snow.\n\nThey went Indian file. First came the scouts, clever, graceful quiet. They had rifles. Next came the antitank gunner, clumsy and dense, warning Germans away with a Colt .45 automatic in one hand and a trench knife in the other.\n\nLast came Billy Pilgrim, empty-handed, bleakly ready for death. Billy was Preposterous-six feet and three inches tall, with a chest and shoulders like a box of kitchen matches. He had no helmet, no overcoat, no weapon and no boots. On his feet were cheap, low-cut civilian shoes which he had bought for his father's funeral. Billy had lost a heel, which made him bob up-and-down, up-and-down. The involuntary dancing up and down, up and down, made his hip joints sore.\n\nBilly was wearing a thin field jacket, a shirt and trousers of scratchy wool, and long underwear that was soaked with sweat. He was the only one of the four who had a beard. It was a random, bristly beard, and some of the bristles were white, even though\nBilly was only twenty-one years old. He was also going bald. Wind and cold and violent exercise had turned his face crimson\nHe didn't look like a soldier at all. He looked like a filthy flamingo.\n\nAnd on the third day of wandering, somebody shot at the four from far away-shot four times as they crossed a narrow brick road. One shot was for the scouts. The next one was for the antitank gunner, whose name was Roland Weary.\n\nThe third bullet was for the filthy flamingo, who stopped dead center in the road when the lethal bee buzzed past his ear. Billy stood there politely, giving the marksman another chance. It was his addled understanding of the rules of warfare that the marksman should be given a second chance. The next shot missed Billy's kneecaps by inches, going end- on-end, from the sound of it.\n\nRoland Weary and the scouts were safe in a ditch, and Weary growled at Billy, 'Get out of the road, you dumb motherfucker.' The last word was still a novelty in the speech of white people in 1944. It was fresh and astonishing to Billy, who had never fucked anybody-and it did its job. It woke him up and got him off the road.\n\n'Saved your life again, you dumb bastard,' Weary said to Billy in the ditch. He had been saving Billy's life for days, cursing him, kicking him, slapping him, making him move. It was absolutely necessary that cruelty be used, because Billy wouldn't do anything to save himself. Billy wanted to quit. He was cold, hungry, embarrassed, incompetent. He could scarcely distinguish between sleep and wakefulness now, on the third day, found no important differences either, between walking and standing still\nHe wished everybody would leave him alone. 'You guys go on without me,' he said again and again.\n\nWeary was as new to war as Billy. He was a replacement, too. As a part of a gun crew, he had helped to fire one shot in anger-from a 57-millimeter antitank gun. The gun made a ripping sound like the opening of a zipper on the fly of God Almighty. The gun lapped up snow and vegetation with a blowtorch feet long. The flame left a black arrow on the ground, showing the Germans exactly where the gun was hidden. The shot was a miss.\n\nWhat had been missed was a Tiger tank. It swiveled its 88-millimeter snout around sniffingly, saw the arrow on the ground. It fired. It killed everybody on the gun crew but Weary. So it goes.\n\nRoland Weary was only eighteen, was at the end of an unhappy childhood spent mostly in Pittsburgh, Pennsylvania. He had been unpopular in Pittsburgh. He had been unpopular because he was stupid and fat and mean, and smelled like bacon no matter how much he washed. He was always being ditched in Pittsburgh by people who did not want him with them.\n\nIt made Weary sick to be ditched. When Weary was ditched, he would find somebody who was even more unpopular than himself, and he would horse around with that person for a while, pretending to be friendly. And then he would find some pretext for beating the shit out of him.\n\nIt was a pattern. It was a crazy, sexy, murderous relationship Weary entered into with people he eventually beat up. He told hem about his father's collection of guns and swords and torture instruments and leg irons and so on. Weary's father, who was a plumber, actually did collect such things, and his collection was insured for four thousand dollars. He wasn't alone. He belonged to a big club composed of people who collected things like that.\n\nWeary's father once gave Weary's mother a Spanish thumbscrew in--working condition--for a kitchen paperweight. Another time he gave her a table lamp whose base was a model one foot high of the famous 'Iron Maiden of Nuremburg.' The real Iron Maiden was a medieval torture instrument, a sort of boiler which was shaped like a woman on the outside-and lined with spikes. The front of the woman was composed of two hinged doors. The idea was to put a criminal inside and then close the doors slowly. There were two special spikes where his eyes would be. There was a drain in the bottom to let out all the blood.\n\nSo it goes.\n\nWeary had told Billy Pilgrim about the Iron Maiden, about the drain in the bottom-and what that was for. He had talked to Billy about dum-dums. He told him about his father's Derringer pistol, which could be carried in a vest pocket, which was yet capable of making a hole in a man 'which a bull bat could fly through without touching either wing.'\n\nWeary scornfully bet Billy one time that he didn't even know what a blood gutter was. Billy guessed that it was the drain in the bottom of the Iron Maiden, but that was wrong. A blood gutter, Billy learned, was the shallow groove in the side of the blade of a sword or bayonet.\n\nWeary told Billy about neat tortures he'd read about or seen in the movies or heard on the radio-about other neat tortures he himself had invented. One of the inventions was sticking a dentist's drill into a guy's ear. He asked Billy what he thought the worst form of execution was. Billy had no opinion. The correct answer turned out to be this: 'You stake a guy out on an anthill in the desert-see? He's face upward, and you put honey all over his balls and pecker, and you cut off his eyelids so he has to stare at the sun till he dies.' So it goes.\n\nNow, lying in the ditch with Billy and the scouts after having been shot at, Weary made Billy take a very close look at his trench knife. It wasn't government issue. It was a present from his father. It had a ten-inch blade that was triangular 'in 'cross section. Its grip consisted of brass knuckles, was a chain of rings through which Weary slipped his stubby fingers. The rings weren't simple. They bristled with spikes.\n\nWeary laid the spikes along Billy's cheek, roweled the cheek with savagely affectionate restraint. 'How'd you-like to be hit with this-hm? Hmmmmmmmmm?' he wanted to know.\n\n'I wouldn't,' said Billy. 'Know why the blade's triangular?' 'No.' 'Makes a wound that won't close up.' 'Oh.' 'Makes a three-sided hole in a guy. You stick an ordinary knife in a guy-makes a slit, right? A slit closes right up. Right? 'Right.'\n\n'Shit. What do you know? What the hell they teach you in college?'\n\n'I wasn't there very long.' said Billy, which was true. He had had only six months of\n\ncollege and\n\nthe college hadn't been a regular college, either. It had been the night school of the Ilium School of Optometry.\n\n\"Joe College,' said Weary scathingly. Billy shrugged.\n\n'There's more to life than what you read in books.' said Weary. 'You'll find that out.'\n\nBilly made no reply to this, either, there in the ditch, since he didn't want the conversation to go on any longer than necessary. He was dimly tempted to say, though, that he knew a thing or two about gore. Billy, after all, had contemplated torture and hideous wounds at the beginning and the end of nearly every day of his childhood. Billy had an extremely gruesome crucifix hanging on the wall of his little bedroom in Ilium. A military surgeon would have admired the clinical fidelity of the artist's rendition of all Christ's wounds-the spear wound, the thorn wounds, the holes that were made by the iron spikes. Billy's Christ died horribly. He was pitiful.\n\nSo it goes.\n\nBilly wasn't a Catholic, even though he grew up with a ghastly crucifix on the wall. His father had no religion. His mother was a substitute organist for several churches around town. She took Billy with her whenever she played, taught him to play a little, too. She said she was going to join a church as soon as she decided which one was right.\n\nShe never did decide. She did develop a terrific hankering for a crucifix, though. And she bought one from a Sante Fé gift shop during a trip the little family made out West during the Great Depression. Like so many Americans, she was trying to construct a life that made sense from things she found in gift shops.\n\nAnd the crucifix went up on the wall of Billy Pilgrim.\n\nThe two scouts, loving the walnut stocks of their rifles in the ditch, whispered that it was time to move out again. Ten minutes had gone by without anybody's coming to see if they were hit or not, to finish them off. Whoever had shot was evidently far away and all alone.\n\nAnd the four crawled out of the ditch without drawing any more fire. They crawled into a forest like the big, unlucky mammals they were. Then they stood up and began to walk quickly. The forest was dark and cold. The pines were planted in ranks and files. There was no undergrowth. Four inches of unmarked snow blanketed the ground. The Americans had no choice but to leave trails in the show as unambiguous as diagrams in a book on ballroom dancing--step, slide, rest-step, slide, rest.\n\n'Close it up and keep it closed!' Roland Weary warned Billy Pilgrim as they moved out. Weary looked like Tweedledum or Tweedledee, all bundled up for battle. He was short and thick.\n\nHe had every piece of equipment he had ever been issued, every present he'd received from home: helmet, helmet liner, wool cap, scarf, gloves, cotton undershirt, woolen undershirt, wool shirt, sweater, blouse, jacket, overcoat, cotton underpants, woolen underpants, woolen trousers, cotton socks, woolen socks, combat boots, gas mask, canteen, mess kit, first-aid kit, trench knife, blanket, shelter-half, raincoat, bulletproof Bible, a pamphlet entitled 'Know Your Enemy,' another pamphlet entitled 'Why We Fight' and another pamphlet of German phrases rendered in English phonetics, which would enable Weary to ask Germans questions such as 'Where is your headquarters?' and 'How many howitzers have you?' Or to tell them, 'Surrender. Your situation is hopeless,' and so on.\n\nWeary had a block of balsa wood which was supposed to be a foxhole pillow. He had a prophylactic kit containing two tough condoms 'For the Prevention of Disease Only!' He had a whistle he wasn't going to show anybody until he got promoted to corporal. He had a dirty picture of a woman attempting sexual intercourse with a Shetland pony. He had made Billy Pilgrim admire that picture several times.\n\nThe woman and the pony were posed before velvet draperies which were fringed with deedlee-balls. They were flanked by Doric columns. In front of one column was a potted palm. The Picture that Weary had was a print of the first dirty photograph in history. The word photography was first used in 1839, and it was in that year, too, that Louis J. M. Daguerre revealed to the French Academy that an image formed on a silvered metal plate covered with a thin film of silver iodide could be developed in the presence of mercury vapor.\n\nIn 1841, only two years later, an assistant to Daguerre, André Le Fèvre, was arrested in the Tuileries Gardens for attempting to sell a gentleman a picture of the woman and the pony. That was where Weary bought his picture, too-in the Tuileries. Le Fèvre argued that the picture was fine art, and that his intention was to make Greek mythology come alive. He said that columns and the potted palm proved that.\n\nWhen asked which myth he meant to represent, Le Fèvre replied that there were thousands of myths like that, with the woman a mortal and the pony a god.\n\nHe was sentenced to six months in prison. He died there of pneumonia. So it goes.\n\nBilly and the Scouts were skinny people. Roland Weary had fat to burn. He was a roaring furnace under all his layers of wool and straps and canvas. He had so much energy that he bustled back and forth between Billy and the scouts, delivering dumb messages which nobody had sent and which nobody was pleased to receive. He also began to suspect, since he was so much busier than anybody else, that he was the leader.\n\nHe was so hot and bundled up, in fact, that he had no sense of danger. His vision of the outside world was limited to what he could see through a narrow slit between the rim of his helmet and his scarf from home, which concealed his baby face from the bridge of his nose on down. He was so snug in there that he was able to pretend that he was safe at home, having survived the war, and that he was telling his parents and his sister a true war story-whereas the true war story was still going on.\n\nWeary's version of the true war story went like this: There was a big German attack, and Weary and his antitank buddies fought like hell until everybody was killed but Weary. So it goes. And then Weary tied in with two scouts, and they became close friends immediately, and they decided to fight them way back to their own lines. They were going to travel fast. They were damned if they'd surrender. They shook hands all around. They called themselves 'The Three Musketeers.'\n\nBut then this damn college kid, who was so weak he shouldn't even have been in the army, asked if he could come along. He didn't even have a gun or a knife. He didn't even have a helmet or a cap. He couldn't even walk right-kept bobbing up-and down, up-and- down, driving everybody crazy, giving their position away. He was pitiful. The Three Musketeers pushed and carried and dragged the college kid all the way back to their own lines, Weary's story went. They saved his God-damned hide for him.\n\nIn real life, Weary was retracing his steps, trying to find out what had happened to Billy. He had told the scouts to wait while he went back for the college bastard. He passed under a low branch now. It hit the top of his helmet with a clonk. Weary didn't\nHear it. Somewhere a big dog was barking. Weary didn't hear that, either. His war story was at a very exciting point. An officer was congratulating the Three Musketeers, telling them that he was going to put them in for Bronze Stars.\n\n'Anything else I can do for you boys?' said the officer.\n\n'Yes, sir,' said one of the scouts. 'We'd like to stick together for the rest of the war, sir. Is there some way you can fix it so nobody will ever break up the Three Musketeers?'\n\nBilly Pilgrim had stopped in the forest. He was leaning against a tree with his eyes closed. His head was tilted back and his nostrils were flaring. He was like a poet in the Parthenon.\n\nThis was when Billy first came unstuck in time. His attention began to swing grandly through the full arc of his life, passing into death, which was violet light. There wasn't anybody else there, or any thing. There was just violet light and a hum. And then Billy swung into life again, going backwards until he was in pre-birth, which was red light and bubbling sounds. And then he swung into life again and stopped. He was a little boy taking a shower with his hairy father at the Ilium Y.M.C.A. He smelled chlorine from the swimming pool next door, heard the springboard boom.\n\nLittle Billy was terrified, because his father had said Billy was going to learn to swim by the method of sink-or-swim. Ms father was going to throw Billy into the deep end, and Billy was going to damn well swim.\n\nIt was like an execution. Billy was numb as his father carried him from the shower room to the pool. His eyes were closed. When he opened his eyes, he was on the bottom of the pool, and there was beautiful music everywhere. He lost consciousness, but the music went on. He dimly sensed that somebody was rescuing him. Billy resented that.\n\nFrom there he traveled in time to 1965. He was forty-one years old, and he was visiting his decrepit mother at Pine Knoll, an old people's home he had put her in only a month before. She had caught pneumonia, and wasn't expected to live. She did live, though, for years after that.\n\nHer voice was nearly gone, so, in order to hear her, Billy had to put his ear right next to her papery lips. She evidently had something very important to say.\n\n'How ...?' she began, and she stopped. She was too tired. She hoped that she wouldn’t have to say the rest of the sentence, and that Billy would finish it for her.\n\nBut Billy had no idea what was on her mind. 'How what, Mother?' he prompted.\n\nShe swallowed hard, shed some tears. Then she gathered energy from all over her ruined body, even from her toes and fingertips. At last she had accumulated enough to whisper this complete sentence:\n\n'How did I get so old? '\n\nBilly's antique mother passed out, and Billy was led from the room by a pretty nurse. The body of an old man covered by a sheet was wheeled by just as Billy entered the corridor. The man had been a famous marathon runner in his day. So it goes. This was before Billy had his head broken in an airplane crash, by the way-before he became so vocal about flying saucers and traveling in time.\n\nBilly sat down in a waiting room. He wasn't a widower yet. He sensed something hard under the cushion of his overstuffed chair. He dug it out, discovered that it was a book, The Execution of Private Slovik, by William Bradford Huie. It was a true account of the death before an American firing squad of private Eddie D. Slovik, 36896415, the only American soldier to be shot for cowardice since the Civil War. So it goes.\n\nBilly read the opinion of a staff judge advocate who reviewed Slovik's case, which ended like this: He has directly challenged the authority of the government, and future discipline depends upon a resolute reply to this challenge. If the death penalty is ever to be imposed for desertion, it should be imposed in this case, not as a punitive measure nor as retribution, but to maintain that discipline upon which alone an army can succeed against the enemy. There was no recommendation for clemency in the case and none is here recommended. So it goes.\n\nBilly blinked in 1965, traveled in time to 1958. He was at a banquet in honour of a Little League team of which his son Robert was a member. The coach, who had never been married, was speaking. He was all choked up. 'Honest to God,' he was Saying, 'I'd consider it an honor just to be water boy for these kids.'\n\nBilly blinked in 1958, traveled in time to 1961. It was New Year's Eve, and Billy was disgracefully drunk at a party where everybody was in optometry or married to an optometrist.\n\nBilly usually didn't drink much, because the war had ruined his stomach, but he certainly had a snootful now, and he was being unfaithful to his wife Valencia for the first and only time. He had somehow persuaded a woman to come into the laundry room of the house, and then sit up on the gas dryer, which was running.\n\nThe woman was very drunk herself, and she helped Billy get her girdle off. 'What was it you wanted to talk about?' she said.\n\n'It's all night,' said Billy. He honestly thought it was all right. He couldn't remember the name of the woman.\n\n'How come they call you Billy instead of William?' 'Business reasons,' said Billy. That was true. His father-in-law, who owned the Ilium School of Optometry, who had set Billy up in practice, was a genius in his field. He told Billy to encourage people to call him Billy-because it would stick in their memories. It would also make him seem slightly magical, since there weren't any other grown Billys around. It also compelled people to think of him as a friend right away.\n\nSomewhere in there was an awful scene, with people expressing disgust for Billy and the woman, and Billy found himself out in his automobile, trying to find the steering wheel.\n\nThe main thing now was to find the steering wheel. At first, Billy windmilled his arms, hoping to find it by luck. When that didn't work, he became methodical, working in such a way that the wheel could not possibly escape him. He placed himself hard against the left-hand door, searched every square inch of the area before him. When he failed to find the wheel, he moved over six inches, and searched again. Amazingly, he was eventually hard against the right-hand door, without having found the wheel.\n\nHe concluded that somebody had stolen it. This angered him as he passed out.\n\nHe was in the back seat of his car, which was why he couldn't find the steering wheel.\n\nNow somebody was shaking Billy awake. Billy still felt drunk, was still angered by the stolen steering wheel. He was back in the Second World War again, behind the German lines. The person who was shaking him was Roland Weary. Weary had gathered the front of Billy's field jacket into his hands. He banged Billy against a tree, then puffed him away from it, flung him in the direction he was supposed to take under his own power.\n\nBilly stopped, shook his head. 'You go on,' he said. 'What? ' 'You guys go on without me. I'm all right.' 'You're what?'\n\n'I'm O.K.'\n\n'Jesus-I'd hate to see somebody sick,' said Weary, through five layers of humid scarf from home. Billy had never seen Weary's face. He had tried to imagine it one time, had imagined a toad in a fishbowl.\n\nWeary kicked and shoved Billy for a quarter of a mile. The scouts were waiting between the banks of a frozen creek. They had heard the dog. They had heard men calling back and forth, too-calling like hunters who had a pretty good idea of where their quarry was.\n\nThe banks of the creek were high enough to allow the scouts to stand without being seen. Billy staggered down the bank ridiculously. After him came Weary, clanking and clinking and tinkling and hot.\n\n'Here he is, boys,' said Weary. 'He don't want to live, but he's gonna live anyway. When he gets out of this, by God, he's gonna owe his life to the Three Musketeers. '\n\nBilly Pilgrim, there in the creekbed, thought he, Billy Pilgrim, was turning to steam painlessly. If everybody would leave him alone for just a little while, he thought, he wouldn't cause anybody any more trouble. He would turn to steam and float up among the treetops.\n\nSomewhere the big dog barked again. With the help of fear and echoes and winter silences, that dog had a voice like a big bronze gong.\n\nRoland Weary, eighteen years old, insinuated himself between the scouts, draped a heavy arm around the shoulder of each. 'So what do the Three Musketeers do now?' he said.\n\nBilly Pilgrim was having a delightful hallucination. He was wearing dry, warm, white sweatsocks, and he was skating on a ballroom floor. Thousands cheered. This wasn't time-travel. It had never happened, never would happen. It was the craziness of a dying young man with his shoes full of snow.\n\nOne scout hung his head, let spit fall from his lips. The other did the same. They studied the infinitesimal effects of spit on snow and history. They were small, graceful people. They had been behind German lines before many times--living like woods creatures, living from moment to moment in useful terror, thinking brainlessly with their spinal cords.\n\nNow they twisted out from under Weary's loving arms. They told Weary that he and Billy had better find somebody to surrender to. The Scouts weren't going to wait for them any more.\n\nAnd they ditched Weary and Billy in the creekbed.\n\nBilly Pilgrim went on skating, doing tricks in sweat-socks, tricks that most people would consider impossible-making turns, stopping on a dime and so on. The cheering went on, but its tone was altered as the hallucination gave way to time-travel\nBilly stopped skating, found himself at a lectern in a Chinese restaurant in Ilium, New York, on an early afternoon in the autumn of 1957. He was receiving a standing ovation from the Lions Club. He had just been elected President, and it was necessary that he speak. He was scared stiff, thought a ghastly mistake had been made. All those prosperous, solid men out there would discover now that they had elected a ludicrous waif. They would hear his reedy voice, the one he'd had in the war. He swallowed, knew that all he -had for a voice box was a little whistle cut from a willow switch. Worse-he had nothing to say. The crowd quieted down. Everybody was pink and beaming.\n\nBilly opened his mouth, and out came a deep, resonant tone. His voice was a gorgeous instrument. It told jokes which brought down the house. It grew serious, told jokes again, and ended on a note of humility. The explanation of the miracle was this: Billy had taken a course in public speaking.\n\nAnd then he was back in the bed of the frozen creek again. Roland Weary was about to beat the living shit out of him.\n\nWeary was filled with a tragic wrath. He had been ditched again. He stuffed his pistol into its holster. He slipped his knife into its scabbard. Its triangular blade and blood gutters on all three faces. And then he shook Billy hard, rattled his skeleton, slammed him against a bank.\n\nWeary barked and whimpered through his layers of scarf from home. He spoke unintelligibly of the sacrifices he had made on Billy's behalf. He dilated upon the piety and heroism of 'The Three Musketeers,' portrayed, in the most glowing and impassioned hues, their virtue and magnanimity, the imperishable honor they acquired for themselves, and the great services they rendered to Christianity.\n\nIt was entirely Billy's fault that this fighting organization no longer existed, Weary felt, and Billy was going to pay. Weary socked Billy a good one on the side of the jaw, knocked Billy away from the bank and onto the snow-covered ice of the creek. Billy was down on all fours on the ice, and Weary kicked him in the ribs, rolled him over on his side. Billy tried to form himself into a ball.\n\n'You shouldn't even be in the Army,' said Weary.\n\nBilly was involuntarily making convulsive sounds that were a lot like laughter. 'You think it's funny, huh?' Weary inquired. He walked around to Billy's back. Billy's jacket and shirt and undershirt had been hauled up around his shoulders by the violence, so his back was naked. There, inches from the tips of Weary's combat boots, were the pitiful buttons of Billy's spine.\n\nWeary drew back his right boot, aimed a kick at the spine, at the tube which had so many of Billy's important wires in it. Weary was going to break that tube.\n\nBut then Weary saw that he had an audience. Five German soldiers and a police dog on a leash were looking down into the bed of the creek. The soldiers' blue eyes were filled with bleary civilian curiosity as to why one American would try to murder another one so far from home, and why the victim should laugh.2EmbedShare URLCopyEmbedCopy"
}